[
  {
    "qid": "train_979",
    "input_seq": "What is the ISNI of the person that won the National Society of Film Critics Award for Best Actress for The Grifters?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"National Society of Film Critics Award for Best Actress\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"The Grifters\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_980",
    "input_seq": "What is the relationship between Crossroads, which was nominated for the Golden Raspberry Award for Worst Picture, and Shonda Rhimes?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Crossroads\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Golden Raspberry Award for Worst Picture\" . ?e_2 <pred:name> \"Shonda Rhimes\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_981",
    "input_seq": "What the seminary established in 1630 whose headquarter location is near Cambridge?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"seminary\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Cambridge\" . ?e_1 <inception> ?pv . ?pv <pred:year> 1630 .   }"
  },
  {
    "qid": "train_982",
    "input_seq": "For the American-football team with member William Powell (Arizona Cardinals member), how many subscribers does the team have for its Twitter username, AZCardinals?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"William Powell\" . ?e_1 <member_of_sports_team> ?e_2 . ?e_2 <pred:name> \"Arizona Cardinals\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"AZCardinals\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_983",
    "input_seq": "To which territorial jurisdiction does SHO_Homeland, the Twitter username of the television series whose number of episodes is 84, apply?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"84\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SHO_Homeland\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }"
  },
  {
    "qid": "train_984",
    "input_seq": "Is http://www.newline.com the official website for the higher learning institution whose ISNI is 0000 0001 2169 1048?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2169 1048\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.newline.com\" .  }"
  },
  {
    "qid": "train_985",
    "input_seq": "Does the boarding school that Dominic West attended have a motto of Unidade, Acção, Progresso ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"boarding school\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Dominic West\" .  ?e <motto_text> ?pv . ?pv <pred:value> \"Unidade, Acção, Progresso\" .  }"
  },
  {
    "qid": "train_986",
    "input_seq": "How many counties in Wisconsin with a population of less than 9200000 share a border with Dane County?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Wisconsin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"9200000\"^^xsd:double ) . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Dane County\" .  }"
  },
  {
    "qid": "train_987",
    "input_seq": "What is the number of dynasties named after Windsor Castle or that has the British Museum person-institution is 152002",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" .  { ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Windsor Castle\" .  } UNION { ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"152002\" .  } }"
  },
  {
    "qid": "train_988",
    "input_seq": "How many chemical elements were discovered, or invented, after 1669?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical element\" . ?e <time_of_discovery_or_invention> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1669 ) .  }"
  },
  {
    "qid": "train_989",
    "input_seq": "What is the birthdate of the voice actor for the character Captain of the Guards on Tangled, with production cost of 260000000 USD?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Tangled\" . ?e_1 <cost> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"260000000\"^^xsd:double . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Captain of the Guards\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_990",
    "input_seq": "Is the film titled De rouille et d'os longer than 12.9 hours?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"De rouille et d'os\" . ?e <duration> ?pv . ?pv <pred:unit> \"hour\" . ?pv <pred:value> ?v . FILTER ( ?v > \"12.9\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_991",
    "input_seq": "When did Samuel Beckett get educated at Trinity College Dublin?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Samuel Beckett\" . ?e_2 <pred:name> \"Trinity College Dublin\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_992",
    "input_seq": "Which metropolitan region whose area is over 3700 square miles has the smallest land area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square mile\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"3700\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_993",
    "input_seq": "Which National Football League Draft occured in 2007 with the Tampa Bay Buccaneers as participants?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"National Football League Draft\" . ?e <point_in_time> ?pv . ?pv <pred:year> 2007 . ?e <participant> ?e_1 . ?e_1 <pred:name> \"Tampa Bay Buccaneers\" .  }"
  },
  {
    "qid": "train_994",
    "input_seq": "Which movie is shorter, A Christmas Carol (the one that has Whoopi Goldberg as a cast member) or Fatal Attraction?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"A Christmas Carol\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Whoopi Goldberg\" .   } UNION { ?e <pred:name> \"Fatal Attraction\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_995",
    "input_seq": "Is the work period start date of the person whose Twitter username is bobmarley (having 1427560 subscribers) prior to the year 1960?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"bobmarley\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1427560\"^^xsd:double . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1960 ) .  }"
  },
  {
    "qid": "train_996",
    "input_seq": "What language is associated with the official website http://www.sanjuanco.com for the Washington county whose area is 1609 square kilometers?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"1609\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sanjuanco.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_997",
    "input_seq": "What is the number of independent record labels that is Lili Taylor's record label and that has the official website http://www.xlrecordings.com/",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent record label\" . ?e_1 <record_label> ?e . ?e_1 <pred:name> \"Lili Taylor\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.xlrecordings.com/\" .  }"
  },
  {
    "qid": "train_998",
    "input_seq": "Which county in Michigan with a population under 4000000 has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"4000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_999",
    "input_seq": "English-speaking Jack Thompson has what connection to the Labour Party that Stephen Fry belongs to?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jack Thompson\" . ?e_1 <languages_spoken,_written_or_signed> ?e_3 . ?e_3 <pred:name> \"English\" . ?e_2 <pred:name> \"Labour Party\" . ?e_4 <member_of_political_party> ?e_2 . ?e_4 <pred:name> \"Stephen Fry\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1000",
    "input_seq": "When did Michael Chabon with the  Locus Award for Best Science Fiction Novel?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Locus Award for Best Science Fiction Novel\" . ?e_2 <pred:name> \"Michael Chabon\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1001",
    "input_seq": "North was filmed in how many US states?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e_1 <filming_location> ?e . ?e_1 <pred:name> \"North\" .   }"
  },
  {
    "qid": "train_1002",
    "input_seq": "How many constitutional monarchies are the birthplace of the human whose Munzinger IBA is 00000026731?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"constitutional monarchy\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000026731\" .   }"
  },
  {
    "qid": "train_1003",
    "input_seq": "Of animated series hailing from the USA, which boasts the biggest run of seasons?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1004",
    "input_seq": "When did a county of Califnronia with the capital Auburn (the one whose area is 18560000 square metres) reach the population of 367,309 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Auburn\" . ?e_1 <area> ?pv_1 . ?pv_1 <pred:unit> \"square metre\" . ?pv_1 <pred:value> \"18560000\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"367309\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1005",
    "input_seq": "What is the date of death of the person born on 1963-08-02?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1963-08-02\"^^xsd:date . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1006",
    "input_seq": "What is the codename of Star Wars Episode IV: A New Hope, an Academy Award recipient for Best Costume Design?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Star Wars Episode IV: A New Hope\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Costume Design\" .  ?e <codename> ?pv .  }"
  },
  {
    "qid": "train_1007",
    "input_seq": "Which film is titled Girl, Interrupted?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Girl, Interrupted\" .  }"
  },
  {
    "qid": "train_1008",
    "input_seq": "Which CANTIC-ID designates the person who is Lynn Redgrave's parent?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <child> ?e_1 . ?e_1 <pred:name> \"Lynn Redgrave\" .  ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_1009",
    "input_seq": "When did the city that is the headquarters location of Unione Calcio Sampdoria have a population of 588688?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <headquarters_location> ?e . ?e_1 <pred:name> \"Unione Calcio Sampdoria\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"588688\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1010",
    "input_seq": "What is the date a movie, that received  Academy Award for Best Actor (the subject of this statement is 34th Academy Awards), was published ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Actor\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"34th Academy Awards\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_1011",
    "input_seq": "What is the pronunciation audioof the city with 13159388 people?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13159388\"^^xsd:double . ?e <pronunciation_audio> ?pv .  }"
  },
  {
    "qid": "train_1012",
    "input_seq": "What is the ISNI of the university with UK Provider Reference Number 10007825?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <UK_Provider_Reference_Number> ?pv_1 . ?pv_1 <pred:value> \"10007825\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1013",
    "input_seq": "What language is used by the official website of the theatre award nominated to Lois Smith at http://www.tonyawards.com/en_US/index.html?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Lois Smith\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tonyawards.com/en_US/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1014",
    "input_seq": "Which human has the ISNI 0000 0001 0958 7803 and an occupation of model?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0958 7803\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"model\" .  }"
  },
  {
    "qid": "train_1015",
    "input_seq": "Who has more children, Sofia Coppola or John C. Calhoun?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sofia Coppola\" .  } UNION { ?e <pred:name> \"John C. Calhoun\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1016",
    "input_seq": "How many Illinois counties are home to a United States city and are the birthplace of Dr. Seuss?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_3 <place_of_birth> ?e_1 . ?e_3 <pred:name> \"Dr. Seuss\" .   }"
  },
  {
    "qid": "train_1017",
    "input_seq": "Does the longer run-time belong to A Midsummer Night's Dream, originating in Italy, or The Missing, with composer James Horner?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"A Midsummer Night's Dream\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Italy\" .   } UNION { ?e <pred:name> \"The Missing\" . ?e <composer> ?e_2 . ?e_2 <pred:name> \"James Horner\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1018",
    "input_seq": "Does the student enrollment exceed 760 for the higher education institution in Tasmania (official website http://www.tas.gov.au/)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Tasmania\" . ?e_1 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tas.gov.au/\" . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"760\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1019",
    "input_seq": "When did Arlington County start using the local dialing code 571?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Arlington County\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"571\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local_dialing_code> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1020",
    "input_seq": "Which Munzinger IBA designates the writer of the script for The Descendants?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"The Descendants\" .  ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_1021",
    "input_seq": "Which human plays the character role of Claire Bennet as a cast member of the television series that also includes Ali Larter as a cast member?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"television series\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Ali Larter\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Claire Bennet\" .  }"
  },
  {
    "qid": "train_1022",
    "input_seq": "What is the relationship between Michael Mann (the one whose date of birth is 1942-05-18) and English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Mann\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1942-05-18\"^^xsd:date . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1023",
    "input_seq": "WS the band that set up in Winnipeg not founded in 1876?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Winnipeg\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1876 ) .  }"
  },
  {
    "qid": "train_1024",
    "input_seq": "How was the population of 2264879 determined for the county of California with an ISNI of 0000 0004 0638 8149?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0638 8149\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2264879\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1025",
    "input_seq": "How many match appearances did Shane Smeltz have as a member of Perth Glory FC?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Shane Smeltz\" . ?e_2 <pred:name> \"Perth Glory FC\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_1026",
    "input_seq": "What is the relationship between Stan Laurel and the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stan Laurel\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1027",
    "input_seq": "Does the smaller run of seasons belong to Seinfeld or to Sex and the City, a SAG Award nominee for Outstanding Performance by an Ensemble in a Comedy Series?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Seinfeld\" .  } UNION { ?e <pred:name> \"Sex and the City\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series\" .   } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1028",
    "input_seq": "Which has more students, Laval University or Butler University?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Laval University\" .  } UNION { ?e <pred:name> \"Butler University\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1029",
    "input_seq": "How many businesspersons have ROME Occupation Code (v3) D1201 or that have the occupation of Chuck Berry?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"businessperson\" .  { ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"D1201\" .  } UNION { ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Chuck Berry\" .  } }"
  },
  {
    "qid": "train_1030",
    "input_seq": "Does Brooklyn (whose genre is drama film) or G.I. Joe: Retaliation have the longer running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brooklyn\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"drama film\" .   } UNION { ?e <pred:name> \"G.I. Joe: Retaliation\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1031",
    "input_seq": "What is the birth name of Cat Stevens?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cat Stevens\" . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_1032",
    "input_seq": "Tell me the number of administrative territorial entities that have an inception time prior to 1870.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1870 ) .  }"
  },
  {
    "qid": "train_1033",
    "input_seq": "Was the Nintendo GameID GINX69 entertainment released later than 2002 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"GINX69\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2002 ) .  }"
  },
  {
    "qid": "train_1034",
    "input_seq": "What is the Instagram username of the Philadelphia Phillies?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Philadelphia Phillies\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_1035",
    "input_seq": "What population in New York is the smallest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1036",
    "input_seq": "How is Cory Doctorow connected to Isaac Asimov?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cory Doctorow\" . ?e_2 <pred:name> \"Isaac Asimov\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1037",
    "input_seq": "Which website officially represents Tuscaloosa?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tuscaloosa\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1038",
    "input_seq": "How many sovereign states have a nominal GDP that is higher than 1003100000000 Czech koruna and more than 80000 out-of-school children?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"Czech koruna\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1003100000000\"^^xsd:double ) . ?e <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"80000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1039",
    "input_seq": "Which person has the ISNI of 0000 0001 1443 5740?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1443 5740\" .  }"
  },
  {
    "qid": "train_1040",
    "input_seq": "What is the ISNI of Gordon Brown (the one that is an employee of United Nations)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gordon Brown\" . ?e <employer> ?e_1 . ?e_1 <pred:name> \"United Nations\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1041",
    "input_seq": "What is the character role of Jorja Fox in CSI: Crime Scene Investigation?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"CSI: Crime Scene Investigation\" . ?e_2 <pred:name> \"Jorja Fox\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1042",
    "input_seq": "What association does Alanis Morissette have with Maverick Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alanis Morissette\" . ?e_2 <pred:name> \"Maverick Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1043",
    "input_seq": "Does ISNI 0000 0000 9889 4196 identify alternative rocker Mike Mills ?",
    "target_seq": "ASK { ?e <pred:name> \"Mike Mills\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"alternative rock\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9889 4196\" .  }"
  },
  {
    "qid": "train_1044",
    "input_seq": "Does INE municipality code 08019 designate the port city with a population above 7100 in 1820 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"port city\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"7100\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1820 . ?e <INE_municipality_code> ?pv . ?pv <pred:value> \"08019\" .  }"
  },
  {
    "qid": "train_1045",
    "input_seq": "Who is the reviewer for the Haiti national association football team that ranks 136?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <country_for_sport> ?e_1 . ?e_1 <pred:name> \"Haiti\" .  ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"136\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <review_score_by> ?qpv .  }"
  },
  {
    "qid": "train_1046",
    "input_seq": "What is the character role of Kirsten Dunst as a cast member in Spider-Man (whose genre is teen film)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Spider-Man\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"teen film\" . ?e_2 <pred:name> \"Kirsten Dunst\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1047",
    "input_seq": "What is Daniel Radcliffe's role in Harry Potter and the Prisoner of Azkaban starring Richard Griffiths?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Richard Griffiths\" . ?e_2 <pred:name> \"Daniel Radcliffe\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1048",
    "input_seq": "Which city has a higher elevation above sea level, Salt Lake City or Mansfield with the postal code 44900-44999?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Salt Lake City\" . } UNION { ?e <pred:name> \"Mansfield\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"44900–44999\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1049",
    "input_seq": "Was the person that died on 1977-11-30 not born in 1965?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1977-11-30\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1965 ) .  }"
  },
  {
    "qid": "train_1050",
    "input_seq": "What is the relationship between Roberto Orci to 39th Daytime Emmy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roberto Orci\" . ?e_2 <pred:name> \"39th Daytime Emmy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1051",
    "input_seq": "When did the US city whose PermID is 4297597680 have a population of 439896?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"4297597680\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"439896\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1052",
    "input_seq": "Was the animated feature film that is followed by Ice Age: Continental Drift published after 1990 (the place of publication of this statement is Germany)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e_1 <follows> ?e . ?e_1 <pred:name> \"Ice Age: Continental Drift\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1990 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_1053",
    "input_seq": "Which Academy Awards ceremony has the official website http://www.oscar.com and has Christoph Waltz receiving?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.oscar.com\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Christoph Waltz\" .  }"
  },
  {
    "qid": "train_1054",
    "input_seq": "What was the founding date of the association football club with the official website is http://www.dafc.co.uk/ ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.dafc.co.uk/\" . ?e <inception> ?pv .  }"
  }
]