[
  {
    "qid": "train_733",
    "input_seq": "Tell me the person whose name is Jonny Lee Miller in their native language and who is married to Angelina Jolie.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Jonny Lee Miller\" . ?e_1 <spouse> ?e . ?e_1 <pred:name> \"Angelina Jolie\" .  }"
  },
  {
    "qid": "train_734",
    "input_seq": "Among the animated series whose number of seasons is greater than 15, which has the most seasons?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"15\"^^xsd:double ) . ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_735",
    "input_seq": "Which TV station established prior to 2008 has the official website www.channel5.com ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television station\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.channel5.com\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v . FILTER ( ?v < 2008 ) .  }"
  },
  {
    "qid": "train_736",
    "input_seq": "How many visual artworks were published before 2016 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2016 ) .  }"
  },
  {
    "qid": "train_737",
    "input_seq": "Which has more people, Tempe or Beverly?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tempe\" .  } UNION { ?e <pred:name> \"Beverly\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_738",
    "input_seq": "When was 28758968 the population of the sovereign state whose demonym is malaysiana (the involved part of this statement is feminine singular) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"malaysiana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv_1 ] <applies_to_part> ?qpv_1 . ?qpv_1 <pred:value> \"feminine singular\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"28758968\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_739",
    "input_seq": "Who has more children, Abhishek Bachchan or Ulysses S. Grant?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Abhishek Bachchan\" .  } UNION { ?e <pred:name> \"Ulysses S. Grant\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_740",
    "input_seq": "which one has the least population within the ethnic group that has a population of over 17,000",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic group\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"17000\"^^xsd:double ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_741",
    "input_seq": "What is the relation between Evan Almighty and John Debney?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Evan Almighty\" . ?e_2 <pred:name> \"John Debney\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_742",
    "input_seq": "What is the connection between X-Men: The Last Stand to John Powell (the one that is the composer of Jumper)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"X-Men: The Last Stand\" . ?e_2 <pred:name> \"John Powell\" . ?e_3 <composer> ?e_2 . ?e_3 <pred:name> \"Jumper\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_743",
    "input_seq": "What is the zip code of the HQ of University of Western Ontario in London, birthplace of Justin Bieber?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"University of Western Ontario\" . ?e_2 <pred:name> \"London\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Justin Bieber\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_744",
    "input_seq": "Is 73 the edition number for the 37th Golden Globe Awards?",
    "target_seq": "ASK { ?e <pred:name> \"37th Golden Globe Awards\" . ?e <edition_number> ?pv . ?pv <pred:value> \"73\" .  }"
  },
  {
    "qid": "train_745",
    "input_seq": "What is the ISNI of the agent that usually has V for Vendetta (whose release region is Kuwait) as a property?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <properties_for_this_type> ?e_1 . ?e_1 <pred:name> \"V for Vendetta\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"Kuwait\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_747",
    "input_seq": "Tell me the one with the least watershed area within the river that has discharge over 3300 cubic metres per second.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <discharge> ?pv_1 . ?pv_1 <pred:unit> \"cubic metre per second\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"3300\"^^xsd:double ) . ?e <watershed_area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_748",
    "input_seq": "What person is the composer of the visual artwork whose official website is http://www.mrshendersonpresentsmovie.co.uk/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <composer> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"visual artwork\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.mrshendersonpresentsmovie.co.uk/\" .   }"
  },
  {
    "qid": "train_749",
    "input_seq": "I want to know the electronic dance music that has famous people Aphex Twin",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"electronic dance music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Aphex Twin\" .   }"
  },
  {
    "qid": "train_750",
    "input_seq": "what is the number of short films that are entitled The Animatrix or that largely depicts epilepsy",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"short film\" .  { ?e <title> ?pv . ?pv <pred:value> \"The Animatrix\" .  } UNION { ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"epilepsy\" .  } }"
  },
  {
    "qid": "train_751",
    "input_seq": "Which movie's script did Richard Brooks (the one that died from heart failure) write?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Richard Brooks\" . ?e_1 <cause_of_death> ?e_2 . ?e_2 <pred:name> \"heart failure\" .   }"
  },
  {
    "qid": "train_752",
    "input_seq": "When did the Jean Cocteau-scripted Beauty and the Beast win the Louis Delluc Prize?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Beauty and the Beast\" . ?e_1 <screenwriter> ?e_3 . ?e_3 <pred:name> \"Jean Cocteau\" . ?e_2 <pred:name> \"Louis Delluc Prize\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_753",
    "input_seq": "What is the person's height whose official website is http://www.slamduncan.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.slamduncan.com/\" . ?e <height> ?pv .  }"
  },
  {
    "qid": "train_754",
    "input_seq": "Who has less children, Wes Craven or Claudia Schiffer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wes Craven\" .  } UNION { ?e <pred:name> \"Claudia Schiffer\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_755",
    "input_seq": "How many followers have the owner of the Twitter username eddieizzard (the one that is influenced by Monty Python)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <influenced_by> ?e_1 . ?e_1 <pred:name> \"Monty Python\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"eddieizzard\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_756",
    "input_seq": "Who was the nominee associated with Academy Award for Best Picture nominated to : A Man for All Seasons (the one that was nominated for Academy Award for Best Actor) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"A Man for All Seasons\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Actor\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_757",
    "input_seq": "When was The Birdcage nominated for MTV Movie Award for Best Comedic Performance?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Birdcage\" . ?e_2 <pred:name> \"MTV Movie Award for Best Comedic Performance\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_758",
    "input_seq": "What is the relationship between Jermaine Jackson (the one that is educated at University of Detroit Mercy) and small forward?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jermaine Jackson\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"University of Detroit Mercy\" . ?e_2 <pred:name> \"small forward\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_759",
    "input_seq": "When did Nazi Germany stop being Baden-Baden's country?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Baden-Baden\" . ?e_2 <pred:name> \"Nazi Germany\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_760",
    "input_seq": "How many census-designated places have 20814 as their postal code, and the population of more or less than 310 mil. people?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"census-designated place\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"310000000\"^^xsd:double ) . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"20814\" .  }"
  },
  {
    "qid": "train_761",
    "input_seq": "Is Aladdin the title of Alice in Wonderland that originates in France?",
    "target_seq": "ASK { ?e <pred:name> \"Alice in Wonderland\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"France\" .  ?e <title> ?pv . ?pv <pred:value> \"Aladdin\" .  }"
  },
  {
    "qid": "train_762",
    "input_seq": "How is Australia which has a diplomatic relation with French Polynesia related to Nepal?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Australia\" . ?e_1 <diplomatic_relation> ?e_3 . ?e_3 <pred:name> \"French Polynesia\" . ?e_2 <pred:name> \"Nepal\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_763",
    "input_seq": "What is Andy Warhol's IPI base code?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Andy Warhol\" . ?e <IPI_base_code> ?pv .  }"
  },
  {
    "qid": "train_764",
    "input_seq": "ISNI number 0000 0000 9993 4153 belongs to which person?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9993 4153\" .  }"
  },
  {
    "qid": "train_765",
    "input_seq": "Which one is shorter, A Star is Born (directions by George Cukor) or Drugstore Cowboy?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"A Star Is Born\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"George Cukor\" .   } UNION { ?e <pred:name> \"Drugstore Cowboy\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_766",
    "input_seq": "Does Dover, official website http://www.cityofdover.com/, or Bakersfield have the smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dover\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofdover.com/\" . } UNION { ?e <pred:name> \"Bakersfield\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_767",
    "input_seq": "How is the drama film Restless connected to Bryce Dallas Howard?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Restless\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"drama film\" . ?e_2 <pred:name> \"Bryce Dallas Howard\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_768",
    "input_seq": "Which human has the Twitter username tomhanks and is a cast member of Philadelphia (which has Gary Goetzman as a cast member)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"tomhanks\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Philadelphia\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Gary Goetzman\" .  }"
  },
  {
    "qid": "train_769",
    "input_seq": "When did the county of Oregon that shares border with Washoe County have a population of 7820?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Washoe County\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7820\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_770",
    "input_seq": "How many high schools have the official website https://www.andover.edu/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.andover.edu/\" .  }"
  },
  {
    "qid": "train_771",
    "input_seq": "What is the university whose headquarters is located in Chicago (the one that is the birthplace of Philip K. Dick) (the street address of this statement is 3300 South Federal Street) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Chicago\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Philip K. Dick\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_1 ] <located_at_street_address_(DEPRECATED)> ?qpv . ?qpv <pred:value> \"3300 South Federal Street\" .  }"
  },
  {
    "qid": "train_772",
    "input_seq": "How is single-player video game Batman Forever related to action game?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Batman Forever\" . ?e_1 <game_mode> ?e_3 . ?e_3 <pred:name> \"single-player video game\" . ?e_2 <pred:name> \"action game\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_773",
    "input_seq": "How many big cities are located in the continent of Europe or whose postal code is 70173?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" .  { ?e <continent> ?e_1 . ?e_1 <pred:name> \"Europe\" .  } UNION { ?e <postal_code> ?pv . ?pv <pred:value> \"70173\" .  } }"
  },
  {
    "qid": "train_774",
    "input_seq": "What is the relationship between The Ten Commandments (the one whose official website is http://www.epicstoriesofthebible.com) and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Ten Commandments\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.epicstoriesofthebible.com\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_775",
    "input_seq": "Did  Aladdin (the one with a cost of US$ 28000000) were released after 2011 in Sweden?",
    "target_seq": "ASK { ?e <pred:name> \"Aladdin\" . ?e <cost> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"28000000\"^^xsd:double . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2011 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }"
  },
  {
    "qid": "train_776",
    "input_seq": "Of studio albums that do not clock in at 1700 seconds, which is shortest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"studio album\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"second\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"1700\"^^xsd:double ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_777",
    "input_seq": "When did Dave Thomas (the one whose ISNI is 0000 0003 9865 4290) stop being a member of the England national football team?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dave Thomas\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0003 9865 4290\" . ?e_2 <pred:name> \"England national football team\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_778",
    "input_seq": "Which series of films shares the genre of the Frank Capra film?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film series\" . ?e <genre> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_2 <genre> ?e_1 . ?e_2 <pred:name> \"Frank Capra\" .   }"
  },
  {
    "qid": "train_779",
    "input_seq": "When was the Academy Awards ceremony that was received by Little Miss Sunshine?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Little Miss Sunshine\" .  ?e <point_in_time> ?pv .  }"
  },
  {
    "qid": "train_780",
    "input_seq": "What is the ISNI of the bad that sets up in Kingston upon Hull?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Kingston upon Hull\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_781",
    "input_seq": "Where did the visual artwork entitled Awakenings that was published on 1991-02-14 get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Awakenings\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1991-02-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_782",
    "input_seq": "How many armies are a part of Cisco Systems?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"Cisco Systems\" .   }"
  },
  {
    "qid": "train_783",
    "input_seq": "What's the run-time of the movie inspired by the Oklahoma! with libretto by Oscar Hammerstein II?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"Oklahoma!\" . ?e_1 <librettist> ?e_2 . ?e_2 <pred:name> \"Oscar Hammerstein II\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_784",
    "input_seq": "What is the connection between Jack Kirby to screenwriter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jack Kirby\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_785",
    "input_seq": "Which person has ISNI 0000 0000 7840 6642?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7840 6642\" .  }"
  },
  {
    "qid": "train_786",
    "input_seq": "What is the connection between Barbra Streisand to Democratic Party?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Barbra Streisand\" . ?e_2 <pred:name> \"Democratic Party\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_787",
    "input_seq": "What is the relationship between Thuringia (the one whose NUTS code is DEG0) and Thuringia (the one whose native label is Thüringen) ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thuringia\" . ?e_1 <NUTS_code> ?pv . ?pv <pred:value> \"DEG0\" . ?e_2 <pred:name> \"Thuringia\" . ?e_2 <native_label> ?pv_1 . ?pv_1 <pred:value> \"Thüringen\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_788",
    "input_seq": "Is the ISNI of Gaumont Film Company 0000 0001 2265 3959 ?",
    "target_seq": "ASK { ?e <pred:name> \"Gaumont Film Company\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2265 3959\" .  }"
  },
  {
    "qid": "train_789",
    "input_seq": "How is Mae Whitman related to the description English American?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mae Whitman\" . ?e_2 <pred:name> \"English American\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_790",
    "input_seq": "William Fichtner won a SAG Award for Outstanding Performance by a Cast in a Motion Picture for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture\" . ?e_2 <pred:name> \"William Fichtner\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_791",
    "input_seq": "For which work was Kenneth Branagh nominated for an Academy Award for Best Live Action Short Film?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kenneth Branagh\" . ?e_2 <pred:name> \"Academy Award for Best Live Action Short Film\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_792",
    "input_seq": "How many literary awards has Larry Niven been given?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Larry Niven\" .   }"
  },
  {
    "qid": "train_793",
    "input_seq": "Which work of Bruce Sterling was awarded the John W. Campbell Memorial Award for Best Science Fiction Novel?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"John W. Campbell Memorial Award for Best Science Fiction Novel\" . ?e_2 <pred:name> \"Bruce Sterling\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_794",
    "input_seq": "Is 1C2841 the sRGB color hex triplet for the color gold ?",
    "target_seq": "ASK { ?e <pred:name> \"gold\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"1C2841\" .  }"
  },
  {
    "qid": "train_795",
    "input_seq": "How many democracies have the demonym Slovakiyänan or a nominal GDP greater than 15000000000000 Russian rubles?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" .  { ?e <demonym> ?pv . ?pv <pred:value> \"Slovakiyänan\" .  } UNION { ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"Russian ruble\" . ?pv <pred:value> ?v . FILTER ( ?v > \"15000000000000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_796",
    "input_seq": "What's the relationship between Tom Hardy (nickname Tom) and the single season TV show Oliver Twist?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oliver Twist\" . ?e_1 <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1\"^^xsd:double . ?e_2 <pred:name> \"Tom Hardy\" . ?e_2 <nickname> ?pv_1 . ?pv_1 <pred:value> \"Tom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_797",
    "input_seq": "Where was the film titled Broadcast News published on 1988-04-14 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Broadcast News\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-04-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_798",
    "input_seq": "Which has lower elevation above sea level, Bergamo or Mogadishu?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bergamo\" .  } UNION { ?e <pred:name> \"Mogadishu\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_799",
    "input_seq": "Who is taller, Jackie Chan or Thomas Jefferson (the one that founds United States Military Academy)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jackie Chan\" .  } UNION { ?e <pred:name> \"Thomas Jefferson\" . ?e_1 <founded_by> ?e . ?e_1 <pred:name> \"United States Military Academy\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_800",
    "input_seq": "What is the connection between Patrick Warburton to Paterson (the one whose local dialing code is 201)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Patrick Warburton\" . ?e_2 <pred:name> \"Paterson\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"201\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_801",
    "input_seq": "Does Steve Jobs, with Michael Stuhlbarg as a cast member, have a run-time exceeding 10 weeks ?",
    "target_seq": "ASK { ?e <pred:name> \"Steve Jobs\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Michael Stuhlbarg\" .  ?e <duration> ?pv . ?pv <pred:unit> \"week\" . ?pv <pred:value> ?v . FILTER ( ?v > \"10\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_802",
    "input_seq": "What is Ty Burrell's character role it  The Incredible Hulk (the one that has William Hurt as a cast member)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Incredible Hulk\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"William Hurt\" . ?e_2 <pred:name> \"Ty Burrell\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_803",
    "input_seq": "How many US states have a population count exceeding 530,000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"530000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_804",
    "input_seq": "What is the beginning date that Ross Turnbull (who is a member of Middlesbrough F.C.) becomes a member of Leeds United F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ross Turnbull\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Middlesbrough F.C.\" . ?e_2 <pred:name> \"Leeds United F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_805",
    "input_seq": "Is the American football team whose Twitter username is jaguars founded before the year 1943?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"jaguars\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1943 ) .  }"
  },
  {
    "qid": "train_806",
    "input_seq": "When did George Clinton (the one that hold the position Governor of New York) hold the position of Governor of New York?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Governor of New York\" . ?e_2 <pred:name> \"George Clinton\" . ?e_2 <position_held> ?e_3 . ?e_3 <pred:name> \"Governor of New York\" . ?e_1 <officeholder> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <officeholder> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_807",
    "input_seq": "Was it more expensive to make Ghost or Casablanca, nominated for an Academy Award for Best Actor?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ghost\" .  } UNION { ?e <pred:name> \"Casablanca\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Actor\" .   } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_808",
    "input_seq": "What is the length of the runway 15R/33L at Logan International Airport?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Logan International Airport\" . ?e <runway> ?pv . ?pv <pred:value> \"15R/33L\" . [ <pred:fact_h> ?e ; <pred:fact_r> <runway> ; <pred:fact_t> ?pv ] <length> ?qpv .  }"
  },
  {
    "qid": "train_809",
    "input_seq": "What film received the Academy Award for Best Production Design at the 75th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Production Design\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"75th Academy Awards\" .  }"
  },
  {
    "qid": "train_810",
    "input_seq": "What has Craig Thomas, who died of leukemia, to do with a playwright?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Craig Thomas\" . ?e_1 <cause_of_death> ?e_3 . ?e_3 <pred:name> \"leukemia\" . ?e_2 <pred:name> \"playwright\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_811",
    "input_seq": "What is the character role of Henry Fonda in  War and Peace (the one that origins from Italy)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"War and Peace\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"Italy\" . ?e_2 <pred:name> \"Henry Fonda\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_813",
    "input_seq": "When was Priyadarshan born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Priyadarshan\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_814",
    "input_seq": "Is İstanbul the native name of the product whose pronunciation audio is Nl-pasta.ogg?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"Nl-pasta.ogg\" . ?e <native_label> ?pv . ?pv <pred:value> \"İstanbul\" .  }"
  },
  {
    "qid": "train_815",
    "input_seq": "Does Constantine (that has Shia LaBeouf as a cast member) or Jane Eyre (whose release date is 2011-12-01) have the longer running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Constantine\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Shia LaBeouf\" . } UNION { ?e <pred:name> \"Jane Eyre\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-12-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]