[
  {
    "qid": "train_4679",
    "input_seq": "For which work was Joshua Logan nominated for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Joshua Logan\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4680",
    "input_seq": "What is the connection between country music to Allman Brothers Band?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"country music\" . ?e_2 <pred:name> \"Allman Brothers Band\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4681",
    "input_seq": "The visual artwork titled Rang De Basanti had which release location on 2006-06-29?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Rang De Basanti\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-06-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4682",
    "input_seq": "How is Raphael related to Rome (the one that is the working location of Leonardo da Vinci) ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Raphael\" . ?e_2 <pred:name> \"Rome\" . ?e_3 <work_location> ?e_2 . ?e_3 <pred:name> \"Leonardo da Vinci\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4683",
    "input_seq": "Is the website of the association football club with the native label of _μιλο_ Φιλάθλ_ν __ακλείο_ http://www.cityofmiddletown.com/ ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sacha Baron Cohen\" . ?e_2 <pred:name> \"English people\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4684",
    "input_seq": "Is the ISNI of the human whose CANTIC-ID is a10920985 equal to 0000 0001 0674 2281?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a10920985\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0674 2281\" .  }"
  },
  {
    "qid": "train_4685",
    "input_seq": "What is the connection between homicide to murder?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"homicide\" . ?e_2 <pred:name> \"murder\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4686",
    "input_seq": "Tell me the Academy Awards ceremony that comes after 48th Academy Awards or that has point in time other than 2007",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" .  { ?e <follows> ?e_1 . ?e_1 <pred:name> \"48th Academy Awards\" .  } UNION { ?e <point_in_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2007 ) .  } }"
  },
  {
    "qid": "train_4687",
    "input_seq": "Is Edinburgh the native name for the Timeline whose release date is 1999?",
    "target_seq": "ASK { ?e <pred:name> \"Timeline\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> 1999 . ?e <native_label> ?pv . ?pv <pred:value> \"Edinburgh\" .  }"
  },
  {
    "qid": "train_4688",
    "input_seq": "Is ml the IETF language tag for the language that is the original language of Friends that was published on 1999-01-01?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e_1 <original_language_of_film_or_TV_show> ?e . ?e_1 <pred:name> \"Friends\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1999-01-01\"^^xsd:date . ?e <IETF_language_tag> ?pv . ?pv <pred:value> \"ml\" .  }"
  },
  {
    "qid": "train_4689",
    "input_seq": "Which area has higher elevation above sea level, Auckland or Innsbruck?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Auckland\" .  } UNION { ?e <pred:name> \"Innsbruck\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4690",
    "input_seq": "What is the connection between Bethlehem (the one that is the twinned administrative body of Rabat) to Sacramento?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bethlehem\" . ?e_3 <twinned_administrative_body> ?e_1 . ?e_3 <pred:name> \"Rabat\" . ?e_2 <pred:name> \"Sacramento\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4691",
    "input_seq": "What is the title of Star Wars Episode II: Attack of the Clones?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Star Wars Episode II: Attack of the Clones\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_4692",
    "input_seq": "When did the 2003 invasion of Iraq end?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"2003 invasion of Iraq\" . ?e <end_time> ?pv .  }"
  },
  {
    "qid": "train_4693",
    "input_seq": "Which travel entity is designated by IAB number 672?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"travel\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"672\" .  }"
  },
  {
    "qid": "train_4694",
    "input_seq": "Of news programs with more than 2900 episodes, which has the lowest season count?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"2900\"^^xsd:double ) . ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4695",
    "input_seq": "Which island whose population is under 60000 has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"60000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4696",
    "input_seq": "What is the nominee of Chinatown which was nominated for the Academy Award for Best Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chinatown\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_4697",
    "input_seq": "What political ideology is the area of employment of the person who received a Prometheus Award for the award-winning work Nineteen Eighty-Four?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political ideology\" . ?e_1 <field_of_work> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"Prometheus Award\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv . ?qpv <pred:value> \"Nineteen Eighty-Four\" .   }"
  },
  {
    "qid": "train_4698",
    "input_seq": "Which has more people, Dover (the one whose elevation (above sea level) is 11 metre) or Henderson?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dover\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"11\"^^xsd:double . } UNION { ?e <pred:name> \"Henderson\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4699",
    "input_seq": "What is the sovereign state whose ISNI is 0000 0001 2369 5958?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2369 5958\" .  }"
  },
  {
    "qid": "train_4700",
    "input_seq": "What television series' producer is the person who is the screenwriter of Dark Shadows (whose release region is Argentina)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <producer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_2 <screenwriter> ?e_1 . ?e_2 <pred:name> \"Dark Shadows\" . ?e_2 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Argentina\" .   }"
  },
  {
    "qid": "train_4701",
    "input_seq": "Is a10281605 the CANTIC-ID of the person with ISNI 0000 0001 1469 059X?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1469 059X\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10281605\" .  }"
  },
  {
    "qid": "train_4702",
    "input_seq": "How many provinces in China are the twinned administrative body of the prefecture of Japan that is the twinned administrative body of Delhi (the start date of this statement is 2007-03-05)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"prefecture of Japan\" . ?e_1 <twinned_administrative_body> ?e_2 . ?e_2 <pred:name> \"Delhi\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv . ?qpv <pred:date> \"2007-03-05\"^^xsd:date .   }"
  },
  {
    "qid": "train_4703",
    "input_seq": "How many subscribers does Robert Carlyle have on his robertcarlyle_ Twitter account?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Robert Carlyle\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"robertcarlyle_\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4704",
    "input_seq": "Does canton of Bern or Aachen, designated by ISNI number 0000 0004 0636 6660, occupy a larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"canton of Bern\" . } UNION { ?e <pred:name> \"Aachen\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0636 6660\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4706",
    "input_seq": "Who has greater mass, Chris Evans (the one whose height is 203 centimetre) or David Healy (the one that belongs to Northern Ireland)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chris Evans\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"203\"^^xsd:double . } UNION { ?e <pred:name> \"David Healy\" . ?e <country_for_sport> ?e_1 . ?e_1 <pred:name> \"Northern Ireland\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4707",
    "input_seq": "What is the Gremlin number of the amino acid whose SPLASH is splash10-001i-9000000000-a9f003887aee86656dc9?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"amino acid\" . ?e <SPLASH> ?pv_1 . ?pv_1 <pred:value> \"splash10-001i-9000000000-a9f003887aee86656dc9\" . ?e <Gmelin_number> ?pv .  }"
  },
  {
    "qid": "train_4708",
    "input_seq": "What is the date of birth for the person who died on 2000-01-01?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"2000-01-01\"^^xsd:date . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4709",
    "input_seq": "What first-level administrative-country subdivision shares a border with the capital whose demonym is KL-ite?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"capital\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"KL-ite\" .   }"
  },
  {
    "qid": "train_4710",
    "input_seq": "What is the link between FC Vaslui and Romania, release region of G.I. Joe: Retaliation?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"FC Vaslui\" . ?e_2 <pred:name> \"Romania\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"G.I. Joe: Retaliation\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4711",
    "input_seq": "How many learned societies were received by the person that has the ISNI of 0000 0000 7140 3633?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"learned society\" . ?e_1 <award_received> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7140 3633\" .   }"
  },
  {
    "qid": "train_4712",
    "input_seq": "When did Lincolnshire stop being located in England (which contains East Sussex)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lincolnshire\" . ?e_2 <pred:name> \"England\" . ?e_3 <located_in_the_administrative_territorial_entity> ?e_2 . ?e_3 <pred:name> \"East Sussex\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4713",
    "input_seq": "How is doo-wop connected to The Temptations (the one whose official website is https://www.temptationsofficial.com/)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"doo-wop\" . ?e_2 <pred:name> \"The Temptations\" . ?e_2 <official_website> ?pv . ?pv <pred:value> \"https://www.temptationsofficial.com/\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4714",
    "input_seq": "What is the number of metropolitan boroughs that are an administrative division of Greater Manchester?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Greater Manchester\" .   }"
  },
  {
    "qid": "train_4715",
    "input_seq": "What is the connection between Roman Holiday (the one that has Ed Begley, Jr. as a cast member) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roman Holiday\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Ed Begley, Jr.\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4716",
    "input_seq": "Does Melbourne (whose elevation is 4 meters above sea level) or Gadsden have the lower elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Melbourne\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"4\"^^xsd:double . } UNION { ?e <pred:name> \"Gadsden\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4717",
    "input_seq": "When did Ferrara have a population of 132009?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ferrara\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"132009\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4719",
    "input_seq": "Among the ceremonial counties of England whose population is greater than 4700, which has the largest population?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"4700\"^^xsd:double ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4720",
    "input_seq": "What is the connection between Craig Rocastle to Dover Athletic F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Craig Rocastle\" . ?e_2 <pred:name> \"Dover Athletic F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4721",
    "input_seq": "Is http://www.backboneentertainment.com/ the official website of Backbone Entertainment?",
    "target_seq": "ASK { ?e <pred:name> \"Backbone Entertainment\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.backboneentertainment.com/\" .  }"
  },
  {
    "qid": "train_4722",
    "input_seq": "How many models of video game console are there whose country is the sovereign state that has Germany-Angola diplomatic relations with Germany?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <diplomatic_relation> ?e_1 . ?e_2 <pred:name> \"Germany\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Germany-Angola relations\" .   }"
  },
  {
    "qid": "train_4723",
    "input_seq": "Does Ryan's Hope or The Edge of Night have more seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ryan's Hope\" .  } UNION { ?e <pred:name> \"The Edge of Night\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4724",
    "input_seq": "Where was The Fisher King published on 1991-10-31?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The Fisher King\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1991-10-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4725",
    "input_seq": "What association has an ISNI of 0000 0004 1936 7478?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 7478\" .  }"
  },
  {
    "qid": "train_4726",
    "input_seq": "What is the connection between Terminator 3: Rise of the Machines (the one whose producer is Mario Kassar) to Arnold Schwarzenegger?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Terminator 3: Rise of the Machines\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Mario Kassar\" . ?e_2 <pred:name> \"Arnold Schwarzenegger\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4727",
    "input_seq": "For the ceremonial county of England whose official website is http://www.northamptonshire.gov.uk/, what is the time point for its population of 723000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.northamptonshire.gov.uk/\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"723000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4729",
    "input_seq": "Did Roger Federer or Rafael Nadal win less prize money?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Roger Federer\" .  } UNION { ?e <pred:name> \"Rafael Nadal\" .  } ?e <prize_money> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4730",
    "input_seq": "What is the association of big band with Linda Ronstadt?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"big band\" . ?e_2 <pred:name> \"Linda Ronstadt\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4731",
    "input_seq": "Is Buckinghamshire or Greater Manchester smaller, area-wise?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Buckinghamshire\" .  } UNION { ?e <pred:name> \"Greater Manchester\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4732",
    "input_seq": "Is How I Met Your Mother titled Shanghai Knights?",
    "target_seq": "ASK { ?e <pred:name> \"How I Met Your Mother\" . ?e <title> ?pv . ?pv <pred:value> \"Shanghai Knights\" .  }"
  },
  {
    "qid": "train_4733",
    "input_seq": "How many subscribers are there for the Twitter username HolyEtchmiadzin of the organization that is the religion of Armenians?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e_1 <religion> ?e . ?e_1 <pred:name> \"Armenians\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"HolyEtchmiadzin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4734",
    "input_seq": "Which republic has the feminine plural demonym 'sierraleonesi'?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <demonym> ?pv . ?pv <pred:value> \"sierraleonesi\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv . ?qpv <pred:value> \"feminine plural\" .  }"
  },
  {
    "qid": "train_4735",
    "input_seq": "What is the subject of the statement that The Fighter (whose producer is Darren Aronofsky) was nominated for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Fighter\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Darren Aronofsky\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4736",
    "input_seq": "How many real properties are the home venue of A.S. Roma?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"real property\" . ?e_1 <home_venue> ?e . ?e_1 <pred:name> \"A.S. Roma\" .   }"
  },
  {
    "qid": "train_4737",
    "input_seq": "How many county in New Jersey shares border with the county of New Jersey whose ISNI is 0000 0004 0437 7569?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"county of New Jersey\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0437 7569\" .   }"
  },
  {
    "qid": "train_4738",
    "input_seq": "Which territorial jurisdiction is applicable for the official website https://www.cbs.com/shows/happy-together/ of Happy Together whose Twitter username is happytogether?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Happy Together\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"happytogether\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.cbs.com/shows/happy-together/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }"
  },
  {
    "qid": "train_4739",
    "input_seq": "Which human has the occupation of composer and has the Twitter username 'thebappilahiri'?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"composer\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"thebappilahiri\" .  }"
  },
  {
    "qid": "train_4740",
    "input_seq": "How many animated feature films have the release date that is not in the year 2000 and are succeeded by Cars 2 whose release date is 2011-06-24?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2000 ) . ?e <followed_by> ?e_1 . ?e_1 <pred:name> \"Cars 2\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-06-24\"^^xsd:date .  }"
  },
  {
    "qid": "train_4741",
    "input_seq": "What is Mandy Moore's Instagram username?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mandy Moore\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_4742",
    "input_seq": "What is the connection between Leonard Goldberg (the one whose date of birth is 1934-01-24) to The Wharton School?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Leonard Goldberg\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1934-01-24\"^^xsd:date . ?e_2 <pred:name> \"The Wharton School\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4743",
    "input_seq": "When did the professional life begin for the person with ISNI number 0000 0001 2141 9239?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2141 9239\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_4744",
    "input_seq": "Which university has ISNI 0000 0001 0165 1508?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0165 1508\" .  }"
  },
  {
    "qid": "train_4745",
    "input_seq": "Which movie features Samuel Horwitz in the cast?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Samuel Horwitz\" .   }"
  },
  {
    "qid": "train_4746",
    "input_seq": "Fish Tank has what connection to Croatia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fish Tank\" . ?e_2 <pred:name> \"Croatia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4747",
    "input_seq": "What is the title of the silent film that is written by William Shakespeare (the one that has the occupation of author) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"silent film\" . ?e <after_a_work_by> ?e_1 . ?e_1 <pred:name> \"William Shakespeare\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"author\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_4748",
    "input_seq": "What does Johnny Green (educated at Harvard University) have to do with 24th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Johnny Green\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"Harvard University\" . ?e_2 <pred:name> \"24th Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4749",
    "input_seq": "Regarding the sovereign state with the life expectancy of 67.615 years, and population of 24554000, tell me the determination method of this value.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <life_expectancy> ?pv_1 . ?pv_1 <pred:unit> \"year\" . ?pv_1 <pred:value> \"67.615\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"24554000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_4750",
    "input_seq": "What is the official website of the band in which Steven Wilson is a part of?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <member_of> ?e . ?e_1 <pred:name> \"Steven Wilson\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4751",
    "input_seq": "What is the connection between Wallachia (the one that has the religion Eastern Orthodox Church) to Romanian?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wallachia\" . ?e_1 <religion> ?e_3 . ?e_3 <pred:name> \"Eastern Orthodox Church\" . ?e_2 <pred:name> \"Romanian\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4752",
    "input_seq": "What Academy Awards ceremony award was received by Kevin Costner?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Kevin Costner\" .   }"
  },
  {
    "qid": "train_4753",
    "input_seq": "Where was the feature film with the exploitation visa number of 113661 published on 2005-10-13?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"113661\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-10-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4754",
    "input_seq": "About the sports season that has 71 as the edition number, tell me the end time.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sports season\" . ?e <edition_number> ?pv_1 . ?pv_1 <pred:value> \"71\" . ?e <end_time> ?pv .  }"
  },
  {
    "qid": "train_4755",
    "input_seq": "When did Norman Foster, the architect, receive his AIA Gold Medal?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Norman Foster\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"architect\" . ?e_2 <pred:name> \"AIA Gold Medal\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4756",
    "input_seq": "Is the elevation of the town with the TOID of 4000000074572432 seven meters above sea level?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074572432\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"7\"^^xsd:double .  }"
  },
  {
    "qid": "train_4757",
    "input_seq": "When was Robin Williams nominated for a Golden Raspberry Award for Worst Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Robin Williams\" . ?e_2 <pred:name> \"Golden Raspberry Award for Worst Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4758",
    "input_seq": "Was noise pop conceived before 1993?",
    "target_seq": "ASK { ?e <pred:name> \"noise pop\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1993 ) .  }"
  },
  {
    "qid": "train_4759",
    "input_seq": "How many Pennsylvania cities have a population less than 76000 and not 59000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of Pennsylvania\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"76000\"^^xsd:double ) . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"59000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4760",
    "input_seq": "Which is shorter, Sucker Punch or Hamlet whose script was written by Kenneth Branagh?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sucker Punch\" .  } UNION { ?e <pred:name> \"Hamlet\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Kenneth Branagh\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4761",
    "input_seq": "Of human settlements under 8500 square kilometres in size, which occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human settlement\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"8500\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4762",
    "input_seq": "Of chemical elements with an oxidation state under 10, which possesses the highest mass?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical element\" . ?e <oxidation_state> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"10\"^^xsd:double ) . ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]