[
  {
    "qid": "train_3618",
    "input_seq": "For the significant event which happened at the University of California, Berkeley, how many land-grant universities have its academic discipline as a significant event?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" . ?e <significant_event> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"academic discipline\" . ?e_2 <significant_event> ?e_1 . ?e_2 <pred:name> \"University of California, Berkeley\" .   }"
  },
  {
    "qid": "train_3619",
    "input_seq": "When did Suiza had a life expectancy of 80.18049 years?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"suiza\" . ?e <life_expectancy> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> \"80.18049\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <life_expectancy> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3620",
    "input_seq": "How many video game console models follow Xbox 360 or whose discontinued date is not in 2013?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" .  { ?e <follows> ?e_1 . ?e_1 <pred:name> \"Xbox 360\" .  } UNION { ?e <discontinued_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2013 ) .  } }"
  },
  {
    "qid": "train_3621",
    "input_seq": "Tell me the relationship between Jersey Girl (it was published in 1992) and English",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jersey Girl\" . ?e_1 <publication_date> ?pv . ?pv <pred:year> 1992 . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3622",
    "input_seq": "What is the character role of Timothy Dalton in Flash Gordon (the one whose duration is 111 minute)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Flash Gordon\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"111\"^^xsd:double . ?e_2 <pred:name> \"Timothy Dalton\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3623",
    "input_seq": "Lincoln, elevation 358 meters, is within which time zone?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"time zone\" . ?e_1 <located_in_time_zone> ?e . ?e_1 <pred:name> \"Lincoln\" . ?e_1 <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"358\"^^xsd:double .   }"
  },
  {
    "qid": "train_3624",
    "input_seq": "Which one lasted longer, Iron Man ((the one whose start time is 1994-09-24) or Monk?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Iron Man\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1994-09-24\"^^xsd:date . } UNION { ?e <pred:name> \"Monk\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3625",
    "input_seq": "For the person that is a cast member of King Arthur with the role name of Bors, when did this person start work?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"King Arthur\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Bors\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_3626",
    "input_seq": "When did Brian Jones (the one boen in 1981-08-23)  end to be a member of Jacksonville Jaguars?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brian Jones\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1981-08-23\"^^xsd:date . ?e_2 <pred:name> \"Jacksonville Jaguars\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3627",
    "input_seq": "Who is shorter, Paris Hilton or Mark Johnson?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Paris Hilton\" .  } UNION { ?e <pred:name> \"Mark Johnson\" . ?e <position_played_on_team_/_speciality> ?e_1 . ?e_1 <pred:name> \"first baseman\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3628",
    "input_seq": "How many United States public-educational institutions are established not in 1845?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public educational institution of the United States\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1845 ) .  }"
  },
  {
    "qid": "train_3629",
    "input_seq": "What is the connection between John Hawkes (the one whose date of death is 1998-05-15) to Stamford?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Hawkes\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"1998-05-15\"^^xsd:date . ?e_2 <pred:name> \"Stamford\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3630",
    "input_seq": "What is the connection between Johnson County (the one whose area is 1244 square kilometre) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Johnson County\" . ?e_1 <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"1244\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3631",
    "input_seq": "Wa a rock band residing in Guildford (the one whose TOID is 4000000074568981) established in a year other than 1772 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Guildford\" . ?e_1 <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074568981\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1772 ) .  }"
  },
  {
    "qid": "train_3632",
    "input_seq": "Which one has a longer run time, The Wire, or Jesus of Nazareth?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Wire\" .  } UNION { ?e <pred:name> \"Jesus of Nazareth\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3633",
    "input_seq": "Which movie is longer, Cinema Paradiso or The Da Vinci Code (the one that has Ian McKellen as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cinema Paradiso\" .  } UNION { ?e <pred:name> \"The Da Vinci Code\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Ian McKellen\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3634",
    "input_seq": "Is a10421002 the CANTIC-ID of Charles de Gaulle (the one that officailly opened 1968 Winter Olympics)?",
    "target_seq": "ASK { ?e <pred:name> \"Charles de Gaulle\" . ?e_1 <officially_opened_by> ?e . ?e_1 <pred:name> \"1968 Winter Olympics\" .  ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10421002\" .  }"
  },
  {
    "qid": "train_3635",
    "input_seq": "Which New York county whose population is under 27000000 has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"27000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3636",
    "input_seq": "When did the establishment of an art school, which is the place where Judy Davis studied, take place?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art school\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Judy Davis\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3637",
    "input_seq": "Which person with the Munzinger IBA 00000023593 was educated at Wellesley College?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000023593\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"Wellesley College\" .  }"
  },
  {
    "qid": "train_3638",
    "input_seq": "What is the official website for the visual artwork titled Green Lantern?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Green Lantern\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3639",
    "input_seq": "What does Charlton Heston have to do with film director?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Charlton Heston\" . ?e_2 <pred:name> \"film director\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3640",
    "input_seq": "Which sovereign state shares a border with the sovereign state whose demonym is senegales (in the subject of Guinea–Senegal border)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"senegales\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Guinea–Senegal border\" .  }"
  },
  {
    "qid": "train_3641",
    "input_seq": "Larry the Cable Guy is the voice of which character on Cars 2, released in Sweden?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cars 2\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Sweden\" . ?e_2 <pred:name> \"Larry the Cable Guy\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3642",
    "input_seq": "Regarding Amy Adams (who is a part of the New Zealand National Party), when was he or she born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Amy Adams\" . ?e <member_of_political_party> ?e_1 . ?e_1 <pred:name> \"New Zealand National Party\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3643",
    "input_seq": "Where is the film, that has Carol Burnett as a cast member, published with the publication date of 1982-12-16?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Carol Burnett\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1982-12-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3644",
    "input_seq": "Did Terminator Salvation with Terry Crews as a cast member or Inland Empire perform more poorly at the box office?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Terminator Salvation\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Terry Crews\" .   } UNION { ?e <pred:name> \"Inland Empire\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3645",
    "input_seq": "Where was the visual artwork whose CANTIC-ID is a12020217 published on 2000-05-25?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a12020217\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-05-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3646",
    "input_seq": "What is the relationship between Richard Roxburgh and an actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Roxburgh\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3647",
    "input_seq": "For the University of Richmond's headquarter location in Richmond (the one that shares border with Henrico County), at what street address is it located?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"University of Richmond\" . ?e_2 <pred:name> \"Richmond\" . ?e_2 <shares_border_with> ?e_3 . ?e_3 <pred:name> \"Henrico County\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <located_at_street_address_(DEPRECATED)> ?qpv .  }"
  },
  {
    "qid": "train_3648",
    "input_seq": "What is the official website for the screenwriter of The Great Gatsby published on May 16, 2013?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"The Great Gatsby\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2013-05-16\"^^xsd:date . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3649",
    "input_seq": "Who has the instagram user name, stevenwmoffat?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"stevenwmoffat\" .  }"
  },
  {
    "qid": "train_3650",
    "input_seq": "What is the relationship between Collingwood Football Club to Australian rules football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Collingwood Football Club\" . ?e_2 <pred:name> \"Australian rules football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3651",
    "input_seq": "When did  Durham (the one whose country is Kingdom of Great Britain) stop becoming a part of the Kingdom of Great Britain?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Durham\" . ?e_1 <country> ?e_3 . ?e_3 <pred:name> \"Kingdom of Great Britain\" . ?e_2 <pred:name> \"Kingdom of Great Britain\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3652",
    "input_seq": "Where was a movie, that contains English-speaking Theodore Shapiro  as a cast member, published on 4th March 2004?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Theodore Shapiro\" . ?e_1 <languages_spoken,_written_or_signed> ?e_2 . ?e_2 <pred:name> \"English\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2004-03-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3654",
    "input_seq": "Which ISNI belongs to the person who was the 2004 Filmfare Award winner for Best Director?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Filmfare Award for Best Director\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 2004 . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3655",
    "input_seq": "What is the native label of an Indian state with the official website  https://www.maharashtra.gov.in ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.maharashtra.gov.in/\" . ?e <native_label> ?pv .  }"
  },
  {
    "qid": "train_3656",
    "input_seq": "Was Ebbsfleet United F.C. founded after 1889?",
    "target_seq": "ASK { ?e <pred:name> \"Ebbsfleet United F.C.\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1889 ) .  }"
  },
  {
    "qid": "train_3657",
    "input_seq": "What is the relationship between soul music and Missy Elliott?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"soul music\" . ?e_2 <pred:name> \"Missy Elliott\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3658",
    "input_seq": "Which area has more people, Decatur (the one whose subreddit is Decatur) or Odessa (the one whose official website is http://www.odessa-tx.gov/)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Decatur\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Decatur\" . } UNION { ?e <pred:name> \"Odessa\" . ?e <official_website> ?pv_2 . ?pv_2 <pred:value> \"http://www.odessa-tx.gov/\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3659",
    "input_seq": "How is Elite Squad: The Enemy Within related to Los Angeles?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Elite Squad: The Enemy Within\" . ?e_2 <pred:name> \"Los Angeles\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3660",
    "input_seq": "Whose work on An American in Paris earned an Academy Award nomination for Best Writing, Original Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"An American in Paris\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Original Screenplay\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_3661",
    "input_seq": "How many North Carolina counties are in the time zone of Pleasantville (which is located in Eastern Time Zone)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of North Carolina\" . ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"time zone\" . ?e_2 <located_in_time_zone> ?e_1 . ?e_2 <pred:name> \"Pleasantville\" . ?e_2 <located_in_time_zone> ?e_3 . ?e_3 <pred:name> \"Eastern Time Zone\" .   }"
  },
  {
    "qid": "train_3662",
    "input_seq": "Which has fewer people, Haifa or Phnom Penh?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Haifa\" .  } UNION { ?e <pred:name> \"Phnom Penh\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3663",
    "input_seq": "Which website is associated with the video game developer whose PermID is 4295875973?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"4295875973\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3664",
    "input_seq": "How is alternative rock related to Social Distortion?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"alternative rock\" . ?e_2 <pred:name> \"Social Distortion\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3665",
    "input_seq": "Which movie is longer, Chuck (the one that has Liev Schreiber as a cast member) or Arizona (the one that has William Holden as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chuck\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Liev Schreiber\" .   } UNION { ?e <pred:name> \"Arizona\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"William Holden\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3666",
    "input_seq": "At what start time is Gertrude Stein (the one whose height is 99.6 centimetres) collected in the Metropolitan Museum of Art?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gertrude Stein\" . ?e_1 <height> ?pv . ?pv <pred:unit> \"centimetre\" . ?pv <pred:value> \"99.6\"^^xsd:double . ?e_2 <pred:name> \"Metropolitan Museum of Art\" . ?e_1 <collection> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <collection> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3667",
    "input_seq": "Which has a smaller population, Seychelles or Sri Lanka?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Seychelles\" .  } UNION { ?e <pred:name> \"Sri Lanka\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3668",
    "input_seq": "How many subscribers are there on Twitter username sonic20th, belonging to an entertainment entity whose official website is http://sonic.sega.jp/ ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://sonic.sega.jp/\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3669",
    "input_seq": "How many hip hop musics began in 1980 or not in 1997?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"hip hop music\" .  { ?e <inception> ?pv . ?pv <pred:year> 1980 .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1997 ) .  } }"
  },
  {
    "qid": "train_3670",
    "input_seq": "Of Arizona counties bordering San Juan County, population 15772, which takes up the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"San Juan County\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"15772\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3671",
    "input_seq": "When was Chris Evans, who has an ISNI of 0000 0003 5597 5705, born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Evans\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0003 5597 5705\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3672",
    "input_seq": "For the woman whose official website is http://www.faithhill.com/, how many subscribers does the user have for her Twitter username of FaithHill?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.faithhill.com/\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"FaithHill\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3673",
    "input_seq": "Is http://www.tennessee.gov the official website of the New Jersey county containing the Somerville administrative division that is located in the Eastern Time Zone?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Somerville\" . ?e_1 <located_in_time_zone> ?e_2 . ?e_2 <pred:name> \"Eastern Time Zone\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tennessee.gov\" .  }"
  },
  {
    "qid": "train_3674",
    "input_seq": "What is the connection between Nitty Gritty Dirt Band to 2005 Grammy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nitty Gritty Dirt Band\" . ?e_2 <pred:name> \"2005 Grammy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3675",
    "input_seq": "What is the relationship between David Attenborough and biologist?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"David Attenborough\" . ?e_2 <pred:name> \"biologist\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3677",
    "input_seq": "Between Robert Redford or Salma Hayek, who is shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Robert Redford\" .  } UNION { ?e <pred:name> \"Salma Hayek\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3679",
    "input_seq": "How many dynasties are designated by British Museum person-institution 152002 or have the native label Plantagenets?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" .  { ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"152002\" .  } UNION { ?e <native_label> ?pv . ?pv <pred:value> \"Plantagenets\" .  } }"
  },
  {
    "qid": "train_3680",
    "input_seq": "How many empires have the demonym bizantino or are replaced by Burkina Faso?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" .  { ?e <demonym> ?pv . ?pv <pred:value> \"bizantino\" .  } UNION { ?e <replaced_by> ?e_1 . ?e_1 <pred:name> \"Burkina Faso\" .  } }"
  },
  {
    "qid": "train_3681",
    "input_seq": "How many civil wars have an end time before 1939 or have an end time not in 2011?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"civil war\" .  { ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1939 ) .  } UNION { ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2011 ) .  } }"
  },
  {
    "qid": "train_3682",
    "input_seq": "When did Basel become the twinned administrative body of Shanghai (the one that shares border with Suzhou)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Basel\" . ?e_2 <pred:name> \"Shanghai\" . ?e_3 <shares_border_with> ?e_2 . ?e_3 <pred:name> \"Suzhou\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3683",
    "input_seq": "How is Eragon (released for Microsoft Windows) related to Vivendi Games?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Eragon\" . ?e_1 <platform> ?e_3 . ?e_3 <pred:name> \"Microsoft Windows\" . ?e_2 <pred:name> \"Vivendi Games\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3684",
    "input_seq": "What character does David Bowie (the UK citizen) play in The Prestige?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Prestige\" . ?e_2 <pred:name> \"David Bowie\" . ?e_2 <country_of_citizenship> ?e_3 . ?e_3 <pred:name> \"United Kingdom\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3685",
    "input_seq": "Was it more expensive to make Edward Scissorhands or Sweeney Todd: The Demon Barber of Fleet Street, a Critics' Choice Movie Award nominee for Best Actor?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Edward Scissorhands\" .  } UNION { ?e <pred:name> \"Sweeney Todd: The Demon Barber of Fleet Street\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Critics' Choice Movie Award for Best Actor\" .   } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3686",
    "input_seq": "Is the start date of the industry having the Kingdom of Scotland as a participant after 854?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <participant> ?e_1 . ?e_1 <pred:name> \"Kingdom of Scotland\" .  ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 854 ) .  }"
  },
  {
    "qid": "train_3687",
    "input_seq": "Is http://www.michellebranch.com the official website of the person whose Instagram username is michellebranch?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"michellebranch\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.michellebranch.com\" .  }"
  },
  {
    "qid": "train_3688",
    "input_seq": "How many Summer Olympic Games have followed the Summer Olympic Games that were officially opened by Ronald Reagan?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Summer Olympic Games\" . ?e_1 <followed_by> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"Summer Olympic Games\" . ?e_1 <officially_opened_by> ?e_2 . ?e_2 <pred:name> \"Ronald Reagan\" .   }"
  },
  {
    "qid": "train_3689",
    "input_seq": "What is the relationship between The End Records and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The End Records\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3690",
    "input_seq": "Which area is larger, Pompano Beach or New Haven?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pompano Beach\" .  } UNION { ?e <pred:name> \"New Haven\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3691",
    "input_seq": "How is Mamma Mia! related to the musical film genre?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mamma Mia!\" . ?e_2 <pred:name> \"musical film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3692",
    "input_seq": "When did Cologne become the twinned administrative body of Istanbul whose local dialing code is +90 216?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cologne\" . ?e_2 <pred:name> \"Istanbul\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"+90 216\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3693",
    "input_seq": "What is the Glottolog code of the language whose Wikimedia language code is yi?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <Wikimedia_language_code> ?pv_1 . ?pv_1 <pred:value> \"yi\" . ?e <Glottolog_code> ?pv .  }"
  },
  {
    "qid": "train_3694",
    "input_seq": "Is the run-time shorter for Gladiator, released in the USA, or the silent movie Quo Vadis?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Gladiator\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"Quo Vadis\" . ?e <genre> ?e_2 . ?e_2 <pred:name> \"silent film\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3695",
    "input_seq": "Who was nominated for an Academy Award for Best Sound Editing for E.T. the Extra-Terrestrial?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Sound Editing\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"E.T. the Extra-Terrestrial\" .  }"
  },
  {
    "qid": "train_3696",
    "input_seq": "Which university headquartered in the US has local dialing code 561?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"561\" .   }"
  },
  {
    "qid": "train_3697",
    "input_seq": "What is the official website of the software license whose publisher is Apache Software Foundation ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software license\" . ?e <publisher> ?e_1 . ?e_1 <pred:name> \"Apache Software Foundation\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3698",
    "input_seq": "Which has a lesser annual number of weddings, Haute-Savoie or Seine-et-Marne?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Haute-Savoie\" .  } UNION { ?e <pred:name> \"Seine-et-Marne\" .  } ?e <annual_number_of_weddings> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3699",
    "input_seq": "What does Vivek have to do with Indian people?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vivek\" . ?e_2 <pred:name> \"Indian people\" . ?e_1 ?p ?e_2 .  }"
  }
]