[
  {
    "qid": "train_4114",
    "input_seq": "Was the person with the military rank of major not born in 1824?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <military_rank> ?e_1 . ?e_1 <pred:name> \"major\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1824 ) .  }"
  },
  {
    "qid": "train_4115",
    "input_seq": "Does Southwest Airlines or Marvel Entertainment have more employees?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Southwest Airlines\" .  } UNION { ?e <pred:name> \"Marvel Entertainment\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4116",
    "input_seq": "When was 33879 the students count of the higher education institution whose official website is http://www.utas.edu.au/ ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.utas.edu.au/\" . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33879\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4117",
    "input_seq": "Who does Bradley Cooper who uses French play in Limitless released in Chile?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Limitless\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Chile\" . ?e_2 <pred:name> \"Bradley Cooper\" . ?e_2 <languages_spoken,_written_or_signed> ?e_4 . ?e_4 <pred:name> \"French\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4118",
    "input_seq": "Does \"For the Hours\", which received a PEN/Faulkner Award for Fiction, have an ISBN-10 of 1-84724-253-7?",
    "target_seq": "ASK { ?e <pred:name> \"The Hours\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"PEN/Faulkner Award for Fiction\" .  ?e <ISBN-10> ?pv . ?pv <pred:value> \"1-84724-253-7\" .  }"
  },
  {
    "qid": "train_4119",
    "input_seq": "What big city is the twineed twinned administrative body of the capital where the Spanish Alaska was born?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"capital\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Alaska\" . ?e_2 <languages_spoken,_written_or_signed> ?e_3 . ?e_3 <pred:name> \"Spanish\" .   }"
  },
  {
    "qid": "train_4120",
    "input_seq": "What privately held company is the record label of the rock band whose Twitter username is _DeepPurple with 29063 subscribers?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"privately held company\" . ?e_1 <record_label> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"rock band\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"_DeepPurple\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"29063\"^^xsd:double .   }"
  },
  {
    "qid": "train_4121",
    "input_seq": "When was a school, whose official  website is http://bhhs.bhusd.org, founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://bhhs.bhusd.org/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4122",
    "input_seq": "When was born Innocent?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Innocent\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4123",
    "input_seq": "What is the link between Lewis Black and screenwriter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lewis Black\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4124",
    "input_seq": "What is the official website of the Memphis Grizzlies?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Memphis Grizzlies\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4125",
    "input_seq": "Which has the fewest episodes among the miniseries that ended after 1990?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1990 ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4126",
    "input_seq": "What is the Munzinger IBA of the person whose Deutsche Synchronkartei actor-ID is 24950?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv_1 . ?pv_1 <pred:value> \"24950\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_4127",
    "input_seq": "What is the Munzinger IBA for the person who wins an Academy Award for Best Supporting Actress (the award-winning work of this statement is A Patch of Blue)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Academy Award for Best Supporting Actress\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"A Patch of Blue\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_4128",
    "input_seq": "How many religious denominations are there in the country that is the Russian Soviet Federative Socialist Republic (the one that has a citizen Vladimir Lenin) or whose ISNI is 0000 0001 2184 7583?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religious denomination\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"Russian Soviet Federative Socialist Republic\" . ?e_2 <country_of_citizenship> ?e_1 . ?e_2 <pred:name> \"Vladimir Lenin\" .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2184 7583\" .  } }"
  },
  {
    "qid": "train_4129",
    "input_seq": "When did Schleswig-Holstein have a population of 2889821?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Schleswig-Holstein\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2889821\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4130",
    "input_seq": "How many empires were participated in the Ottoman wars in Europe?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e_1 <participant> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"war\" . ?e_1 <part_of> ?e_2 . ?e_2 <pred:name> \"Ottoman wars in Europe\" .   }"
  },
  {
    "qid": "train_4131",
    "input_seq": "Did the First War of Scottish Independence conclude in a year other than 2000 ?",
    "target_seq": "ASK { ?e <pred:name> \"First War of Scottish Independence\" . ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2000 ) .  }"
  },
  {
    "qid": "train_4132",
    "input_seq": "Which is longer, Hold Back the Dawn or Glory whose official website is http://www.widemanagement.com/glory-1?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hold Back the Dawn\" . } UNION { ?e <pred:name> \"Glory\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.widemanagement.com/glory-1\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4133",
    "input_seq": "What association does The Barbarian Invasions have with the Genie Award for Best Achievement in Overall Sound?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Barbarian Invasions\" . ?e_2 <pred:name> \"Genie Award for Best Achievement in Overall Sound\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4134",
    "input_seq": "What is the number of Michigan counties that have the county that is the sovereign state with the short name Amerika",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"Amerika\" .   }"
  },
  {
    "qid": "train_4135",
    "input_seq": "What is the establishment date of the Michigan county whose FIPS 6-4 for US counties is 26125?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"26125\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4136",
    "input_seq": "How many reds are denoted by sRGB color hex triplet B30033 or are the St. Louis Cardinals' namesake?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" .  { ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"B30033\" .  } UNION { ?e_1 <named_after> ?e . ?e_1 <pred:name> \"St. Louis Cardinals\" .  } }"
  },
  {
    "qid": "train_4137",
    "input_seq": "Which person under 1.8 meters tall lends their voice to Puss in Boots, released in Mexico?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <height> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"1.8\"^^xsd:double ) . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Puss in Boots\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"Mexico\" .  }"
  },
  {
    "qid": "train_4138",
    "input_seq": "Of California counties with over 4200 inhabitants, which occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"4200\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4139",
    "input_seq": "What is the connection between Bill Evans (the one that is involved in the conflict World War II) to baseball?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bill Evans\" . ?e_1 <conflict> ?e_3 . ?e_3 <pred:name> \"World War II\" . ?e_2 <pred:name> \"baseball\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4140",
    "input_seq": "What work is either titled Howards End or received an Academy Award for Best Production Design?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Howards End\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Production Design\" .  }"
  },
  {
    "qid": "train_4141",
    "input_seq": "Is the population of Hempstead greater than 92000 ?",
    "target_seq": "ASK { ?e <pred:name> \"Hempstead\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"92000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4142",
    "input_seq": "How many Christianities have the OSM tag or key Tag:denomination=lutheran or the official website http://www.patriarchia.ru/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" .  { ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:denomination=lutheran\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.patriarchia.ru/\" .  } }"
  },
  {
    "qid": "train_4143",
    "input_seq": "Is 0000 0001 0917 8268 the ISNI for the person that plays the character Abbey Bartlet on The West Wing?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"The West Wing\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Abbey Bartlet\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0917 8268\" .  }"
  },
  {
    "qid": "train_4144",
    "input_seq": "When did George Stevens become a member of Everton F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"George Stevens\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Everton F.C.\" . ?e_2 <pred:name> \"Everton F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4145",
    "input_seq": "Which movie is shorter, The World's Fastest Indian or Meet Dave?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The World's Fastest Indian\" .  } UNION { ?e <pred:name> \"Meet Dave\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4146",
    "input_seq": "Which video game console model of which Iron Man 2 is a single player game of the game library has the largest amount of units sold?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e_1 <platform> ?e . ?e_1 <pred:name> \"Iron Man 2\" . ?e_1 <game_mode> ?e_2 . ?e_2 <pred:name> \"single-player video game\" .  ?e <units_sold> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4147",
    "input_seq": "EPPO Code GALUDO classifies how many organism groups with a shared common name?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group of organisms known by one particular common name\" . ?e <EPPO_Code> ?pv . ?pv <pred:value> \"GALUDO\" .  }"
  },
  {
    "qid": "train_4148",
    "input_seq": "Do the Ramones (the one that uses the language English) or The Velvet Underground (the one whose duration is 2576 second) have less duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ramones\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" . } UNION { ?e <pred:name> \"The Velvet Underground\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"second\" . ?pv_1 <pred:value> \"2576\"^^xsd:double . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4149",
    "input_seq": "Where was the movie with title The Witches of Eastwick and publication date 1987-10-29 published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Witches of Eastwick\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1987-10-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4150",
    "input_seq": "How many national association football teams have a ranking greater than 100?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"100\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4151",
    "input_seq": "What is the character role of Mandy Moore in How I Met Your Mother ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"How I Met Your Mother\" . ?e_2 <pred:name> \"Mandy Moore\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4152",
    "input_seq": "Which location has related to Montgomery County with postal code 20993 that shares border with Fairfax County?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Montgomery County\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"20993\" . ?e_2 <pred:name> \"Fairfax County\" . ?e_1 <shares_border_with> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_2 ] <direction_relative_to_location> ?qpv .  }"
  },
  {
    "qid": "train_4153",
    "input_seq": "How many colleges of the University of Oxford have the official website http://www.balliol.ox.ac.uk/ or are the educational location of Oscar Wilde (whose genre is poetry)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.balliol.ox.ac.uk/\" .  } UNION { ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Oscar Wilde\" . ?e_1 <genre> ?e_2 . ?e_2 <pred:name> \"poetry\" .  } }"
  },
  {
    "qid": "train_4154",
    "input_seq": "How many programming languages have irc://irc.freenode.net/python.de as their IRC channel, and https://bugs.python.org/ as the BUG tracking system?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"programming language\" .  { ?e <IRC_channel> ?pv . ?pv <pred:value> \"irc://irc.freenode.net/python.de\" .  } UNION { ?e <bug_tracking_system> ?pv . ?pv <pred:value> \"https://bugs.python.org/\" .  } }"
  },
  {
    "qid": "train_4155",
    "input_seq": "Which movie is shorter, Hong Kong (the one whose title is Hong Kong) or Click?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hong Kong\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hong Kong\" . } UNION { ?e <pred:name> \"Click\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4156",
    "input_seq": "What is the connection between Tak Fujimoto to cinematographer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tak Fujimoto\" . ?e_2 <pred:name> \"cinematographer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4157",
    "input_seq": "Which one lasts longer, Hercules (the one whose number of episodes is 2) or Saturday Night's Main Event?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hercules\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2\"^^xsd:double . } UNION { ?e <pred:name> \"Saturday Night's Main Event\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4158",
    "input_seq": "How many literary genres have the Dewey Decimal Classification 398.21 or are psychological thrillers?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary genre\" .  { ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"398.21\" .  } UNION { ?e <genre> ?e_1 . ?e_1 <pred:name> \"psychological thriller\" .  } }"
  },
  {
    "qid": "train_4159",
    "input_seq": "What is the official website of the person whose ISNI is 0000 0001 1079 2302?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1079 2302\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4160",
    "input_seq": "How many businesses are owned by Microsoft (whose net profit is 16798000000 United States dollars) and have the ISIN US0846701086?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e_1 <owner_of> ?e . ?e_1 <pred:name> \"Microsoft\" . ?e_1 <net_profit> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"16798000000\"^^xsd:double .  ?e <ISIN> ?pv_1 . ?pv_1 <pred:value> \"US0846701086\" .  }"
  },
  {
    "qid": "train_4161",
    "input_seq": "Which one is larger, County Wicklow or County Dublin?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"County Wicklow\" .  } UNION { ?e <pred:name> \"County Dublin\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4162",
    "input_seq": "Which Texas county whose establishment date is not in 1838 has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 1838 ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4163",
    "input_seq": "What is the TOID for the city located in Wiltshire?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Wiltshire\" .  ?e <TOID> ?pv .  }"
  },
  {
    "qid": "train_4164",
    "input_seq": "How is Bedknobs and Broomsticks related to the genre children's film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bedknobs and Broomsticks\" . ?e_2 <pred:name> \"children's film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4165",
    "input_seq": "Which area is larger, Suva or Tripoli (the one whose country is Libya)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Suva\" .  } UNION { ?e <pred:name> \"Tripoli\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Libya\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4166",
    "input_seq": "What is the relationship between George Miller (the one that is a member of S.C. Braga) and association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"George Miller\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"S.C. Braga\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4167",
    "input_seq": "What association does Grammy Award winner Joe Jackson have with smooth jazz?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"smooth jazz\" . ?e_2 <pred:name> \"Joe Jackson\" . ?e_2 <award_received> ?e_3 . ?e_3 <pred:name> \"Grammy Award\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4168",
    "input_seq": "Which has the smallest area among the administrative territorial entities that are a geographic distribution of Javanese people?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e_1 <geographic_distribution> ?e . ?e_1 <pred:name> \"Javanese people\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4169",
    "input_seq": "When was Cheshire no longer in the country England, where table tennis originated?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cheshire\" . ?e_2 <pred:name> \"England\" . ?e_3 <country_of_origin> ?e_2 . ?e_3 <pred:name> \"table tennis\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4170",
    "input_seq": "How many Latin Grammy Awards for Best Male Pop Vocal Album has Luis Miguel won?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Latin Grammy Award for Best Male Pop Vocal Album\" . ?e_2 <pred:name> \"Luis Miguel\" . ?e_2 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Grammy Award for Best Latin Pop Album\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4171",
    "input_seq": "What is the relationship between Esteghlal F.C. and Tehran (the one that is the twinned administrative body of Budapest)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Esteghlal F.C.\" . ?e_2 <pred:name> \"Tehran\" . ?e_2 <twinned_administrative_body> ?e_3 . ?e_3 <pred:name> \"Budapest\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4172",
    "input_seq": "The risk of the disease designated by eMedicine 1100753 is related to which life stage?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phase of life\" . ?e <risk_factor> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"disease\" . ?e_1 <eMedicine> ?pv . ?pv <pred:value> \"1100753\" .   }"
  },
  {
    "qid": "train_4173",
    "input_seq": "How are A Christmas Carol, which was published on 2000-12-20, and the United Kingdom related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Christmas Carol\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2000-12-20\"^^xsd:date . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4174",
    "input_seq": "What is the connection between Speed 2: Cruise Control to Caribbean?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Speed 2: Cruise Control\" . ?e_2 <pred:name> \"Caribbean\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4175",
    "input_seq": "How many rivers are the origin of the name Bas-Rhin or whose discharge is not 200 cubic metres per second?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" .  { ?e_1 <named_after> ?e . ?e_1 <pred:name> \"Bas-Rhin\" .  } UNION { ?e <discharge> ?pv . ?pv <pred:unit> \"cubic metre per second\" . ?pv <pred:value> ?v . FILTER ( ?v != \"200\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_4176",
    "input_seq": "What is the determination method of Italian being the official language of San Marino, which has a diplomatic relation with Taiwan)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"San Marino\" . ?e_1 <diplomatic_relation> ?e_3 . ?e_3 <pred:name> \"Taiwan\" . ?e_2 <pred:name> \"Italian\" . ?e_1 <official_language> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <official_language> ; <pred:fact_t> ?e_2 ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_4177",
    "input_seq": "For the ceremonial county of England that has the capital Cambridge (the one that is the birthplace of Syd Barrett), what is the time point for its population is 806700?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Cambridge\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Syd Barrett\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"806700\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4178",
    "input_seq": "Is the run-time of the visual artwork whose official website is http://www.thefightermovie.com shorter than 1.1 academic terms?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.thefightermovie.com\" . ?e <duration> ?pv . ?pv <pred:unit> \"academic term\" . ?pv <pred:value> ?v . FILTER ( ?v < \"1.1\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4179",
    "input_seq": "Was the film titled Book of Shadows: Blair Witch 2 published earlier than the year 2012 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Book of Shadows: Blair Witch 2\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2012 ) .  }"
  },
  {
    "qid": "train_4180",
    "input_seq": "Who is the human that was nominated for MTV Video Music Award for Best Female Video?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"MTV Video Music Award for Best Female Video\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2000 .  }"
  },
  {
    "qid": "train_4181",
    "input_seq": "Which is longer, the Ohio River or the Columbia River?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ohio River\" .  } UNION { ?e <pred:name> \"Columbia River\" .  } ?e <length> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4182",
    "input_seq": "When was the person whose Munzinger IBA is 00000000133 was born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv_1 . ?pv_1 <pred:value> \"00000000133\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4183",
    "input_seq": "What is the connection between Pennsylvania Academy of the Fine Arts to National Historic Landmark?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pennsylvania Academy of the Fine Arts\" . ?e_2 <pred:name> \"National Historic Landmark\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4184",
    "input_seq": "Which has more seasons, Merlin (the one that has John Hurt as a cast member) or Adrian (the one whose start time is 2019-01-21)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Merlin\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"John Hurt\" . } UNION { ?e <pred:name> \"Adrian\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2019-01-21\"^^xsd:date . } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4185",
    "input_seq": "Who weighs less, Chris Evans (the one whose date of death is 2000-05-09) or Chris Cooper (the one that is a member of Seattle Seahawks)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chris Evans\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"2000-05-09\"^^xsd:date . } UNION { ?e <pred:name> \"Chris Cooper\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Seattle Seahawks\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4186",
    "input_seq": "Which association-football club has Jason Roberts as a member (the number of games played of this statement is 28) and has the official name Reading Football Club?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Jason Roberts\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <number_of_matches_played/races/starts> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"28\"^^xsd:double . ?e <official_name> ?pv . ?pv <pred:value> \"Reading Football Club\" .  }"
  },
  {
    "qid": "train_4188",
    "input_seq": "Where is the film that is shot in Strasbourg, whose publication date is 2011-12-22 published ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <filming_location> ?e_1 . ?e_1 <pred:name> \"Strasbourg\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2011-12-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4189",
    "input_seq": "Which university's ISNI number is 0000 0004 1937 1135?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1937 1135\" .  }"
  },
  {
    "qid": "train_4190",
    "input_seq": "What is the relationship between Richard Rorty and Yale University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Rorty\" . ?e_2 <pred:name> \"Yale University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4191",
    "input_seq": "How is Toy Story 3 related to Australia, where E.T. the Extra-Terrestrial was released?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Toy Story 3\" . ?e_2 <pred:name> \"Australia\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"E.T. the Extra-Terrestrial\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4192",
    "input_seq": "How tall is someone designated by ISNI 0000 0000 7357 9114?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7357 9114\" . ?e <height> ?pv .  }"
  }
]