[
  {
    "qid": "train_2703",
    "input_seq": "Which has more episodes, King of the Hill (the one that has Elijah Wood as a voice actor) or Dallas (the one whose distributor is Lorimar Television)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"King of the Hill\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Elijah Wood\" .   } UNION { ?e <pred:name> \"Dallas\" . ?e <distributor> ?e_2 . ?e_2 <pred:name> \"Lorimar Television\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2704",
    "input_seq": "Of ceremonial English counties in West Midlands (population 5602000), which possesses the greatest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"West Midlands\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5602000\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2705",
    "input_seq": "When did the Pennsylvania county that has the capital Allentown have a population of 353255?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Allentown\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"353255\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2706",
    "input_seq": "How many plays have the title Richard III or the first performance date that is after 1962?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" .  { ?e <title> ?pv . ?pv <pred:value> \"Richard III\" .  } UNION { ?e <date_of_first_performance> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1962 ) .  } }"
  },
  {
    "qid": "train_2707",
    "input_seq": "The person who became Orson Welles' wife in 1943 died of which disease?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e_1 <cause_of_death> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_2 <spouse> ?e_1 . ?e_2 <pred:name> \"Orson Welles\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1943 .   }"
  },
  {
    "qid": "train_2708",
    "input_seq": "What sovereign state's country is the sovereign state that has Maldives–Pakistan diplomatic relations with Pakistan?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <diplomatic_relation> ?e_2 . ?e_2 <pred:name> \"Pakistan\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Maldives–Pakistan relations\" .   }"
  },
  {
    "qid": "train_2709",
    "input_seq": "Which movie is longer, Anchorman: The Legend of Ron Burgundy or The Ten Commandments (the one that received National Film Registry)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Anchorman: The Legend of Ron Burgundy\" .  } UNION { ?e <pred:name> \"The Ten Commandments\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"National Film Registry\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2710",
    "input_seq": "What number of positions in the sport of U.S. football are associated with an IAB code of 484?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football position\" . ?e <sport> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"type of sport\" . ?e_1 <IAB_code> ?pv . ?pv <pred:value> \"484\" .   }"
  },
  {
    "qid": "train_2711",
    "input_seq": "How is Hartford related to Freetown?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hartford\" . ?e_2 <pred:name> \"Freetown\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2712",
    "input_seq": "What does (which has cast member Kevin Corrigan) have to do with Maura Tierney?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Scotland\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Kevin Corrigan\" . ?e_2 <pred:name> \"Maura Tierney\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2713",
    "input_seq": "Is the local telephone code of Sialkot 01738?",
    "target_seq": "ASK { ?e <pred:name> \"Sialkot\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"01738\" .  }"
  },
  {
    "qid": "train_2714",
    "input_seq": "What is the duration of the film titled Oliver! ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Oliver!\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_2715",
    "input_seq": "Who has fewer children, James Newton Howard or Rosanna Arquette?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"James Newton Howard\" .  } UNION { ?e <pred:name> \"Rosanna Arquette\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2716",
    "input_seq": "Is the larger area occupied by Jefferson County, of the official website www.jeffersoncountywv.org, or West Bank?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jefferson County\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.jeffersoncountywv.org\" . } UNION { ?e <pred:name> \"West Bank\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2717",
    "input_seq": "What is the elevation above sea level of the capital of Saudi Arabia?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <capital_of> ?e_1 . ?e_1 <pred:name> \"Saudi Arabia\" .  ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_2718",
    "input_seq": "How much area is occupied by the Illinois county with the English-language website www.tazewell.com?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tazewell.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_2719",
    "input_seq": "Which place is smaller in size, Wuhan or Portsmouth (the one whose country is Kingdom of Great Britain)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wuhan\" .  } UNION { ?e <pred:name> \"Portsmouth\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Kingdom of Great Britain\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2720",
    "input_seq": "Which US city is designated by Dewey Decimal code 2--78966?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--78966\" .  }"
  },
  {
    "qid": "train_2721",
    "input_seq": "Is Bill Wyman the native language name of the person whose parent is Dario Argento?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <child> ?e . ?e_1 <pred:name> \"Dario Argento\" .  ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Bill Wyman\" .  }"
  },
  {
    "qid": "train_2722",
    "input_seq": "Was Wagga Wagga founded after1567?",
    "target_seq": "ASK { ?e <pred:name> \"Wagga Wagga\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1567 ) .  }"
  },
  {
    "qid": "train_2723",
    "input_seq": "Which area has higher elevation above sea level, Los Angeles or Tacoma (the one whose country is United States of America)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Los Angeles\" .  } UNION { ?e <pred:name> \"Tacoma\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2724",
    "input_seq": "What is the Libris-URI of the person whose IBA is 00000020638?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv_1 . ?pv_1 <pred:value> \"00000020638\" . ?e <Libris-URI> ?pv .  }"
  },
  {
    "qid": "train_2725",
    "input_seq": "What work titled Silkwood was nominated for an Academy Award for Best Film Editing?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Silkwood\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Film Editing\" .  }"
  },
  {
    "qid": "train_2726",
    "input_seq": "What is the connection between Slaughterhouse-Five (shot in the Czech Republic) and drama film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Slaughterhouse-Five\" . ?e_1 <filming_location> ?e_3 . ?e_3 <pred:name> \"Czech Republic\" . ?e_2 <pred:name> \"drama film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2727",
    "input_seq": "How many private not-for-profit educational institutions are registered with the organization that is the registry of College of the Holy Cross?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private not-for-profit educational institution\" . ?e <registered_with> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"organization\" . ?e_2 <registered_with> ?e_1 . ?e_2 <pred:name> \"College of the Holy Cross\" .   }"
  },
  {
    "qid": "train_2728",
    "input_seq": "How many genres has the person with the CANTIC-ID of a12356335 worked on as an executive producer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <executive_producer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <CANTIC-ID> ?pv . ?pv <pred:value> \"a12356335\" .   }"
  },
  {
    "qid": "train_2729",
    "input_seq": "Ayr United F.C. includes how many association football clubs?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"Ayr United F.C.\" .   }"
  },
  {
    "qid": "train_2730",
    "input_seq": "How does the profession of lawyer have a relation to Henry King, born 1790-07-06?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Henry King\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1790-07-06\"^^xsd:date . ?e_2 <pred:name> \"lawyer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2731",
    "input_seq": "What is the relationship between Christopher Lloyd (the one whose date of birth is 1960-06-18) and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Christopher Lloyd\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1960-06-18\"^^xsd:date . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2732",
    "input_seq": "What is the area of Myrtle Beach ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Myrtle Beach\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_2733",
    "input_seq": "Which area has more people, Ontario (the one whose elevation (above sea level) is 306 metre) or Honolulu (the one whose native label is Honolulu)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ontario\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"306\"^^xsd:double . } UNION { ?e <pred:name> \"Honolulu\" . ?e <native_label> ?pv_2 . ?pv_2 <pred:value> \"Honolulu\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2734",
    "input_seq": "How is Beijing related to Santiago, the twinned administrative body of Santo Domingo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Beijing\" . ?e_2 <pred:name> \"Santiago\" . ?e_2 <twinned_administrative_body> ?e_3 . ?e_3 <pred:name> \"Santo Domingo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2735",
    "input_seq": "When did the independent city named after Suffolk where Cradle of Filth was formed have a population of 84879?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Suffolk\" . ?e_2 <location_of_formation> ?e_1 . ?e_2 <pred:name> \"Cradle of Filth\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84879\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2736",
    "input_seq": "Until when did The Rolling Stones include Bill Wyman of swing music?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Rolling Stones\" . ?e_2 <pred:name> \"Bill Wyman\" . ?e_2 <genre> ?e_3 . ?e_3 <pred:name> \"swing music\" . ?e_1 <has_part> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <has_part> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2737",
    "input_seq": "How many 3D movies were Academy Award nominees for Best Animated Feature or preceded Il Postino: The Postman?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"3D film\" .  { ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Animated Feature\" .  } UNION { ?e_1 <follows> ?e . ?e_1 <pred:name> \"Il Postino: The Postman\" .  } }"
  },
  {
    "qid": "train_2738",
    "input_seq": "What is David Letterman's pseudonym?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"David Letterman\" . ?e <pseudonym> ?pv .  }"
  },
  {
    "qid": "train_2739",
    "input_seq": "Which costed less, Shortbus or Dredd?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Shortbus\" .  } UNION { ?e <pred:name> \"Dredd\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2740",
    "input_seq": "What is the publication date for Jack London (the one whose title is Jack London) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jack London\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Jack London\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_2741",
    "input_seq": "Which has a lesser duration, Chicken Run or Mary and Max?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chicken Run\" .  } UNION { ?e <pred:name> \"Mary and Max\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2742",
    "input_seq": "Who is the person who was born after 1957 in Northampton (the one whose TOID is 4000000074570837) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1957 ) . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Northampton\" . ?e_1 <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074570837\" .  }"
  },
  {
    "qid": "train_2743",
    "input_seq": "What is the title of High Anxiety?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"High Anxiety\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2744",
    "input_seq": "what is the number of products that includes orange (which has an OKPD code for the good or service is 01.13.22.110) as a part or that has nutrient L-alanine",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" .  { ?e <has_part> ?e_1 . ?e_1 <pred:name> \"orange\" . ?e_1 <OKPD_code_of_the_good_or_service> ?pv . ?pv <pred:value> \"01.13.22.110\" .  } UNION { ?e <nutrient> ?e_1 . ?e_1 <pred:name> \"L-alanine\" .  } }"
  },
  {
    "qid": "train_2745",
    "input_seq": "What is the connection between All About Eve to black-and-white?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"All About Eve\" . ?e_2 <pred:name> \"black-and-white\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2746",
    "input_seq": "What are the number of dynasties whose country is the sovereign state that is the country of TV Asahi ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <country> ?e_1 . ?e_2 <pred:name> \"TV Asahi\" .   }"
  },
  {
    "qid": "train_2747",
    "input_seq": "Was the University of Victoria founded after 1645?",
    "target_seq": "ASK { ?e <pred:name> \"University of Victoria\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1645 ) .  }"
  },
  {
    "qid": "train_2748",
    "input_seq": "Does the U.S. city, whose postal code is 91711, have a 1907-10-03 establishment?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"91711\" . ?e <inception> ?pv . ?pv <pred:date> \"1907-10-03\"^^xsd:date .  }"
  },
  {
    "qid": "train_2749",
    "input_seq": "Of mountain ranges shorter than 680 KMs, which is the longest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e <length> ?pv_1 . ?pv_1 <pred:unit> \"kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"680\"^^xsd:double ) . ?e <length> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2750",
    "input_seq": "When was the estate, located on Hollywood's land known as the place of Joseph Kish's death, founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"estate in land\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Hollywood\" . ?e_2 <place_of_death> ?e_1 . ?e_2 <pred:name> \"Joseph Kish\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2751",
    "input_seq": "Is the FIPS 6-4 (US counties) of a Floridan county, that contains Daytona Beach, 12127 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Florida\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Daytona Beach\" .  ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"12127\" .  }"
  },
  {
    "qid": "train_2752",
    "input_seq": "Which government structure that shares a boundary with Indonesia has the lowest nominal GDP per capita?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Indonesia\" .  ?e <nominal_GDP_per_capita> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2753",
    "input_seq": "Did the director of The Third Man not start work in 1991?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"The Third Man\" .  ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1991 ) .  }"
  },
  {
    "qid": "train_2754",
    "input_seq": "The composer of the score of which animated feature film is designated by ISNI code 0000 0001 1030 4321?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <composer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1030 4321\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <composer> ; <pred:fact_t> ?e_1 ] <object_has_role> ?qpv . ?qpv <pred:value> \"film score composer\" .  }"
  },
  {
    "qid": "train_2755",
    "input_seq": "When did the sovereign state whose life expectancy is 76.786 years have a population of 2602573?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <life_expectancy> ?pv_1 . ?pv_1 <pred:unit> \"year\" . ?pv_1 <pred:value> \"76.786\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2602573\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2756",
    "input_seq": "How many MTV Video Music Awards was the pop rock artist John Mayer nominated for?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"John Mayer\" . ?e_1 <genre> ?e_2 . ?e_2 <pred:name> \"pop rock\" .   }"
  },
  {
    "qid": "train_2757",
    "input_seq": "How are Joseph M. Schenck and 20th Century Fox retlated?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"20th Century Fox\" . ?e_2 <pred:name> \"Joseph M. Schenck\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2758",
    "input_seq": "What is the ending date that Erwin Rommel is in the military branch of the German Army (whose establishment is 1935-05-21)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Erwin Rommel\" . ?e_2 <pred:name> \"German Army\" . ?e_2 <inception> ?pv . ?pv <pred:date> \"1935-05-21\"^^xsd:date . ?e_1 <military_branch> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <military_branch> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2759",
    "input_seq": "Which persons are represented by the BMLO designation w1835?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <BMLO> ?pv . ?pv <pred:value> \"w1835\" .  }"
  },
  {
    "qid": "train_2760",
    "input_seq": "When was the city founded whose area is 211.82 square kilometres?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"211.82\"^^xsd:double . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2761",
    "input_seq": "Which show has more episodes, The Temptations (the one whose publication date is 1998-01-01) or The Shield?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Temptations\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"The Shield\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2762",
    "input_seq": "How many music genres began before 1995?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music genre\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1995 ) .  }"
  },
  {
    "qid": "train_2763",
    "input_seq": "How was it determined that the population of Bernalillo County was 676685?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bernalillo County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"676685\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_2764",
    "input_seq": "Which French movie is titled L'Appartement?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"French\" .  ?e <title> ?pv . ?pv <pred:value> \"L'Appartement\" .  }"
  },
  {
    "qid": "train_2765",
    "input_seq": "What is the postal code for Springfield (the one whose official website is http://www.springfieldmo.gov)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Springfield\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.springfieldmo.gov\" . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_2766",
    "input_seq": "Regarding the association football club with the official website  http://www.fcschaffhausen.ch/, tell me the inception time",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.fcschaffhausen.ch/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2767",
    "input_seq": "Does Decatur (whose start date is in the year 1823) or Fairfield (whose postal codes are 94533–94535) have the larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Decatur\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1823 . } UNION { ?e <pred:name> \"Fairfield\" . ?e <postal_code> ?pv_2 . ?pv_2 <pred:value> \"94533–94535\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2768",
    "input_seq": "What is the connection between Richard Thompson (the one that has the occupation of politician) to Democratic Party?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Thompson\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"politician\" . ?e_2 <pred:name> \"Democratic Party\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2769",
    "input_seq": "What is the official website of the higher education institution that is the education place of Bill Mantlo?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Bill Mantlo\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2770",
    "input_seq": "What is the connection between Lincoln (the one whose release region is Sweden) to Reliance Entertainment?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lincoln\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Sweden\" . ?e_2 <pred:name> \"Reliance Entertainment\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2771",
    "input_seq": "Regarding the person who has the Libris-URI of 42gjjgnn1tg4tsc is the ISNI equal to 0000 0003 6856 1093 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"42gjjgnn1tg4tsc\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 6856 1093\" .  }"
  },
  {
    "qid": "train_2772",
    "input_seq": "Tell me the nickname for Miles \"Tails\" Prower.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Miles \\\"Tails\\\" Prower\" . ?e <nickname> ?pv .  }"
  },
  {
    "qid": "train_2773",
    "input_seq": "How is the John Ford who died of natural causes linked to the 25th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Ford\" . ?e_1 <manner_of_death> ?e_3 . ?e_3 <pred:name> \"natural causes\" . ?e_2 <pred:name> \"25th Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2774",
    "input_seq": "What is the relationship between Lincoln (the one that is headed by mayor) and Abraham Lincoln (the one whose Regensburg Classification identifier is HT 5960)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lincoln\" . ?e_1 <office_held_by_head_of_government> ?e_3 . ?e_3 <pred:name> \"mayor\" . ?e_2 <pred:name> \"Abraham Lincoln\" . ?e_2 <Regensburg_Classification> ?pv . ?pv <pred:value> \"HT 5960\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2775",
    "input_seq": "Which one of cities in the United States, located in or next to Lake Erie, is the largest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:name> \"Lake Erie\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2776",
    "input_seq": "On which Academy Awards ceremony did James Steward (ISNI 0000 0001 2103 9797) receive a prize?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"James Stewart\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2103 9797\" .   }"
  },
  {
    "qid": "train_2777",
    "input_seq": "I'd like to know the person who produced the film that is a derivative work of Along Came a Spider (which is in English).",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <producer> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_3 <derivative_work> ?e_1 . ?e_3 <pred:name> \"Along Came a Spider\" . ?e_3 <language_of_work_or_name> ?e_4 . ?e_4 <pred:name> \"English\" .   }"
  },
  {
    "qid": "train_2778",
    "input_seq": "What occupation, related to the sport ice hockey, that is the position of John Adams (the one that is a member of Washington Capitals)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <sport> ?e_1 . ?e_1 <pred:name> \"ice hockey\" .  ?e_2 <position_played_on_team_/_speciality> ?e . ?e_2 <pred:name> \"John Adams\" . ?e_2 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Washington Capitals\" .  }"
  },
  {
    "qid": "train_2779",
    "input_seq": "What person wins an Academy Award for Best Costume Design involving the award-winning work Topsy-Turvy)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Academy Award for Best Costume Design\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"Topsy-Turvy\" .  }"
  },
  {
    "qid": "train_2780",
    "input_seq": "About the college of the University of Cambridge with the ARCHON code 272, does it have an official website of http://www.fcuniversitatea.ro/ ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Cambridge\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"272\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.fcuniversitatea.ro/\" .  }"
  },
  {
    "qid": "train_2781",
    "input_seq": "When did  Yerevan start becoming located in Armenia?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Yerevan\" . ?e_2 <pred:name> \"Armenia\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2782",
    "input_seq": "Utah, where Superman III was filmed, has what link to snowboarding?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Utah\" . ?e_3 <filming_location> ?e_1 . ?e_3 <pred:name> \"Superman III\" . ?e_2 <pred:name> \"snowboarding\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2783",
    "input_seq": "Does Hagerstown or Costa Mesa have the lower elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hagerstown\" .  } UNION { ?e <pred:name> \"Costa Mesa\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2785",
    "input_seq": "What is the connection between Sherlock Holmes that has Christopher Plummer as a performer and Roger Moore who is educated at the University of Durham?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sherlock Holmes\" . ?e_1 <performer> ?e_3 . ?e_3 <pred:name> \"Christopher Plummer\" . ?e_2 <pred:name> \"Roger Moore\" . ?e_2 <educated_at> ?e_4 . ?e_4 <pred:name> \"University of Durham\" . ?e_1 ?p ?e_2 .  }"
  }
]