[
  {
    "qid": "train_4930",
    "input_seq": "How is U-571 related to the genre of war film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"U-571\" . ?e_2 <pred:name> \"war film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4931",
    "input_seq": "Does University of Dhaka or NATO have lower elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Dhaka\" .  } UNION { ?e <pred:name> \"NATO\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4932",
    "input_seq": "Guitarist Rob Thomas was the Grammy Song of the Year winner for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rob Thomas\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"guitar\" . ?e_2 <pred:name> \"Grammy Award for Song of the Year\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4933",
    "input_seq": "When did Amazon, with a net profit of 9304000000 USD, earn 107006000000 USD in total revenue?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Amazon\" . ?e <net_profit> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"9304000000\"^^xsd:double . ?e <total_revenue> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"107006000000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <total_revenue> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4934",
    "input_seq": "Which movie is shorter, Jesus of Nazareth or Community?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jesus of Nazareth\" .  } UNION { ?e <pred:name> \"Community\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4935",
    "input_seq": "What is the Munzinger IBA of Emily Watson?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Emily Watson\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_4936",
    "input_seq": "Does Washington County with population of 238136 or State College have larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Washington County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"238136\"^^xsd:double . } UNION { ?e <pred:name> \"State College\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4937",
    "input_seq": "Who has fewer children, Miguel Ferrer or Tom Selleck?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Miguel Ferrer\" .  } UNION { ?e <pred:name> \"Tom Selleck\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4938",
    "input_seq": "How many unitary states report their total reserves amounting a sum not equal to 43,000,000,000 USD and also report military conflicts with Slovakia ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"unitary state\" . ?e <total_reserves> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> ?v . FILTER ( ?v != \"43000000000\"^^xsd:double ) . ?e_1 <military_conflicts> ?e . ?e_1 <pred:name> \"Slovakia\" .  }"
  },
  {
    "qid": "train_4939",
    "input_seq": "Which one is of shorter duration, Whip It or The A-Team (the one whose narrative location is Mexico) ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Whip It\" .  } UNION { ?e <pred:name> \"The A-Team\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Mexico\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4940",
    "input_seq": "Did Jefferson County (whose population is 116605) begin outside of 1785?",
    "target_seq": "ASK { ?e <pred:name> \"Jefferson County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"116605\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1785 ) .  }"
  },
  {
    "qid": "train_4941",
    "input_seq": "When did Elliot Gold divorce Barbra Streisand?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Elliott Gould\" . ?e_2 <pred:name> \"Barbra Streisand\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4942",
    "input_seq": "What work had the script written by Jon Favreau (the actor)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Jon Favreau\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"actor\" .   }"
  },
  {
    "qid": "train_4943",
    "input_seq": "How many diseases caused the death of James A. Garfield or have the MeSH Code of C23.888.821.214?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" .  { ?e_1 <cause_of_death> ?e . ?e_1 <pred:name> \"James A. Garfield\" .  } UNION { ?e <MeSH_Code> ?pv . ?pv <pred:value> \"C23.888.821.214\" .  } }"
  },
  {
    "qid": "train_4944",
    "input_seq": "The pseudonym Tilda applies to what part for the person with ISNI # 0000 0001 1700 5893?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1700 5893\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Tilda\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pseudonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_4945",
    "input_seq": "What is the connection between Paris Hilton to Irish Americans>",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paris Hilton\" . ?e_2 <pred:name> \"Irish Americans\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4946",
    "input_seq": "What is the relation between Bryan Adams (the famous guitarist) and Polydor Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bryan Adams\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"guitar\" . ?e_2 <pred:name> \"Polydor Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4947",
    "input_seq": "Which movie is shorter, Bad Teacher (the one whose release region is Malaysia) or The Merry Widow (the one whose title is Die lustige Witwe)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bad Teacher\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Malaysia\" . } UNION { ?e <pred:name> \"The Merry Widow\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Die lustige Witwe\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4948",
    "input_seq": "What is the time period that 63.019 is the life expectancy of the democracy that is exported to South Korea?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <exported_to> ?e_1 . ?e_1 <pred:name> \"South Korea\" .  ?e <life_expectancy> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> \"63.019\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <life_expectancy> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4949",
    "input_seq": "Which has less attendance, Iron Man starring Paul Bettany or Beirut published on 2018-04-11?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Iron Man\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Paul Bettany\" . } UNION { ?e <pred:name> \"Beirut\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2018-04-11\"^^xsd:date . } ?e <attendance> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4951",
    "input_seq": "What is the connection between The 40-Year-Old Virgin to Museum of Modern Art?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The 40-Year-Old Virgin\" . ?e_2 <pred:name> \"Museum of Modern Art\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4952",
    "input_seq": "How is Volusia County related to Lake County, which measures 2995 square kilometers in size?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Volusia County\" . ?e_2 <pred:name> \"Lake County\" . ?e_2 <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"2995\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4953",
    "input_seq": "What football club has the official website of http://www.spartak-nalchik.ru and is located in Russia?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.spartak-nalchik.ru\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Russia\" .  }"
  },
  {
    "qid": "train_4954",
    "input_seq": "Among Cobb County and Kanawha County,which one has lesser area ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cobb County\" .  } UNION { ?e <pred:name> \"Kanawha County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4955",
    "input_seq": "What is the connection between Columbia County (the one whose population is 56891) to Dane County?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Columbia County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56891\"^^xsd:double . ?e_2 <pred:name> \"Dane County\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4956",
    "input_seq": "Which film has the shorter runtime, Spider-Man (released in the Philippines) or The Runaways?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Spider-Man\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Philippines\" .   } UNION { ?e <pred:name> \"The Runaways\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4957",
    "input_seq": "How is Days of Thunder, released for PlayStation 3, related to multiplayer video gaming?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Days of Thunder\" . ?e_1 <platform> ?e_3 . ?e_3 <pred:name> \"PlayStation 3\" . ?e_2 <pred:name> \"multiplayer video game\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4958",
    "input_seq": "Is the run-time of The Grudge or Seeking a Friend for the End of the World shorter, of the two?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Grudge\" .  } UNION { ?e <pred:name> \"Seeking a Friend for the End of the World\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4959",
    "input_seq": "What is the connection between The Aviator (the one that has Rufus Wainwright as a cast member) to Broadcast Film Critics Association Award for Best Composer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Aviator\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Rufus Wainwright\" . ?e_2 <pred:name> \"Broadcast Film Critics Association Award for Best Composer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4960",
    "input_seq": "How much did the animated feature film The Hunchback of Notre Dame, produced by Alan Menken, make at the box office?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e_1 <published_in> ?e . ?e_1 <pred:name> \"The Hunchback of Notre Dame\" . ?e_1 <producer> ?e_2 . ?e_2 <pred:name> \"Alan Menken\" .  ?e <box_office> ?pv .  }"
  },
  {
    "qid": "train_4961",
    "input_seq": "What short movie was published prior to 2010 and was made in Japan ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"short film\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2010 ) . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Japan\" .  }"
  },
  {
    "qid": "train_4962",
    "input_seq": "How many products are said to be the same as sucrose or are Kevin Costner's last meal?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" .  { ?e_1 <said_to_be_the_same_as> ?e . ?e_1 <pred:name> \"sucrose\" .  } UNION { ?e_1 <had_as_last_meal> ?e . ?e_1 <pred:name> \"Kevin Costner\" .  } }"
  },
  {
    "qid": "train_4963",
    "input_seq": "Who is taller, Mahatma Gandhi or Richard Harris (the one whose height is 196 centimetre)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mahatma Gandhi\" . } UNION { ?e <pred:name> \"Richard Harris\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"196\"^^xsd:double . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4964",
    "input_seq": "Which movie is longer, Machete (the one whose producer is Robert Rodriguez) or The Matrix?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Machete\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Robert Rodriguez\" .   } UNION { ?e <pred:name> \"The Matrix\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4965",
    "input_seq": "how many subscribers does Kirstie Alley, whose username is kirstiealley, have",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kirstie Alley\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"kirstiealley\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4966",
    "input_seq": "Is 003 the M.49 designation of the geographic region that is a part of Europe?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"Europe\" .  ?e <M.49_code> ?pv . ?pv <pred:value> \"003\" .  }"
  },
  {
    "qid": "train_4967",
    "input_seq": "Was The Firm whose duration is 87 minutes published before 2014?",
    "target_seq": "ASK { ?e <pred:name> \"The Firm\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"87\"^^xsd:double . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2014 ) .  }"
  },
  {
    "qid": "train_4969",
    "input_seq": "What is the connection between Xerox to Norwalk (the one that is the death place of Dave Brubeck)>?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Xerox\" . ?e_2 <pred:name> \"Norwalk\" . ?e_3 <place_of_death> ?e_2 . ?e_3 <pred:name> \"Dave Brubeck\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4970",
    "input_seq": "How many TV genres have 2800 episodes?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television genre\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2800\"^^xsd:double .  }"
  },
  {
    "qid": "train_4971",
    "input_seq": "Tell me the relationship between The Town (which was directed by Ben Affleck) and Museum of Modern Art.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Town\" . ?e_1 <director> ?e_3 . ?e_3 <pred:name> \"Ben Affleck\" . ?e_2 <pred:name> \"Museum of Modern Art\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4972",
    "input_seq": "What's the connection between It Happened One Night and Claudette Colbert?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"It Happened One Night\" . ?e_2 <pred:name> \"Claudette Colbert\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4973",
    "input_seq": "When did Monroe County (the one whose FIPS 6-4 (US counties) is 18105) have a population of 140305?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Monroe County\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"18105\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"140305\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4974",
    "input_seq": "What is the connection between Gladiator (the one that was nominated for Academy Award for Best Cinematography) to Pietro Scalia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gladiator\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Cinematography\" . ?e_2 <pred:name> \"Pietro Scalia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4975",
    "input_seq": "Does FromSoftware or Gameloft employ a smaller workforce?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"FromSoftware\" .  } UNION { ?e <pred:name> \"Gameloft\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4976",
    "input_seq": "What is the ISNI of the person whose official website is http://robinthicke.com?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://robinthicke.com\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4977",
    "input_seq": "Which television series has, as a cast member, the human whose name in native language is Tim Roth?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Tim Roth\" .   }"
  },
  {
    "qid": "train_4978",
    "input_seq": "What is the connection between United National Party to Sri Lanka?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"United National Party\" . ?e_2 <pred:name> \"Sri Lanka\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4979",
    "input_seq": "Which written work is titled The Sum of All Fears?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <title> ?pv . ?pv <pred:value> \"The Sum of All Fears\" .  }"
  },
  {
    "qid": "train_4980",
    "input_seq": "Was the movie titled The Fabulous Baker Boys not published in 1997?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Fabulous Baker Boys\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1997 ) .  }"
  },
  {
    "qid": "train_4981",
    "input_seq": "How is the 251-lb. Tony Curtis connected to the Dallas Cowboys?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tony Curtis\" . ?e_1 <mass> ?pv . ?pv <pred:unit> \"pound\" . ?pv <pred:value> \"251\"^^xsd:double . ?e_2 <pred:name> \"Dallas Cowboys\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4982",
    "input_seq": "Is 0000 0001 2105 6511 the ISNI of the person whose Twitter username is jeffbeckmusic which has 130289 subscribers?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"jeffbeckmusic\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"130289\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2105 6511\" .  }"
  },
  {
    "qid": "train_4983",
    "input_seq": "Which New York county that is an administrative division of New York (that contains Tompkins County) has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"New York\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"Tompkins County\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4984",
    "input_seq": "How is hard rock band Toto related to Sony BMG Music Entertainment?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Toto\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"hard rock\" . ?e_2 <pred:name> \"Sony BMG Music Entertainment\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4985",
    "input_seq": "What is the connection between Night at the Museum: Battle of the Smithsonian (the one whose publication date is 2009-05-05) to Majesco Entertainment?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Night at the Museum: Battle of the Smithsonian\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2009-05-05\"^^xsd:date . ?e_2 <pred:name> \"Majesco Entertainment\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4986",
    "input_seq": "Apocalypto was published on 2006-12-14 in which location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Apocalypto\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-12-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4987",
    "input_seq": "Elaine May was the BAFTA winner for her work on which Best Adapted Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"BAFTA Award for Best Adapted Screenplay\" . ?e_2 <pred:name> \"Elaine May\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4988",
    "input_seq": "Is the runtime of Big Miracle 480 minutes?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Big Miracle\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"480\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4989",
    "input_seq": "When was the school with Instagram username harvardmed established?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"harvardmed\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4990",
    "input_seq": "How many industries either have the Stack Exchange tag of https://stackoverflow.com/tags/solaris or is a series spin off of The Daily Show?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" .  { ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/solaris\" .  } UNION { ?e_1 <series_spin-off> ?e . ?e_1 <pred:name> \"The Daily Show\" .  } }"
  },
  {
    "qid": "train_4991",
    "input_seq": "What is the title of a visual artwork whose narrative location is Madagascar (the one whose population is 14,790,245)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Madagascar\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"14790245\"^^xsd:double . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_4992",
    "input_seq": "Which area is smaller, Merrimack County or American Samoa?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Merrimack County\" .  } UNION { ?e <pred:name> \"American Samoa\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4993",
    "input_seq": "Whose Snapchat username is jessicamalbe?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Snapchat_username> ?pv . ?pv <pred:value> \"jessicamalbe\" .  }"
  },
  {
    "qid": "train_4994",
    "input_seq": "Does DePaul University or Tufts University have the greater number of students?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"DePaul University\" .  } UNION { ?e <pred:name> \"Tufts University\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4995",
    "input_seq": "Which movie is titled As Good as It Gets and contains the script written by James L. Brooks ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"As Good as It Gets\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"James L. Brooks\" .  }"
  },
  {
    "qid": "train_4996",
    "input_seq": "When was Kevin Kline nominated for a BAFTA Award for Best Actor in a Leading Role?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kevin Kline\" . ?e_2 <pred:name> \"BAFTA Award for Best Actor in a Leading Role\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4997",
    "input_seq": "How many sovereign states have the sound that is equal to the origin of the name mathcore?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <indigenous_to> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sound\" . ?e_2 <named_after> ?e_1 . ?e_2 <pred:name> \"mathcore\" .   }"
  },
  {
    "qid": "train_4998",
    "input_seq": "Is http://waddywachtelinfo.com the official website for Waddy Wachtel?",
    "target_seq": "ASK { ?e <pred:name> \"Waddy Wachtel\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://waddywachtelinfo.com\" .  }"
  },
  {
    "qid": "train_4999",
    "input_seq": "How is Akira Toriyama related to Son Goku?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Son Goku\" . ?e_2 <pred:name> \"Akira Toriyama\" . ?e_1 ?p ?e_2 .  }"
  }
]