[
  {
    "qid": "train_4431",
    "input_seq": "Is the duration less than 1.6 years for the visual artwork titled Morocco?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Morocco\" . ?e <duration> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> ?v . FILTER ( ?v < \"1.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4432",
    "input_seq": "How long is a movie called A Room with a View?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"A Room with a View\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_4433",
    "input_seq": "How is P. G. Wodehouse related to natural causes ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"P. G. Wodehouse\" . ?e_2 <pred:name> \"natural causes\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4434",
    "input_seq": "Is Contae Ros Comáin the native label of County Roscommon?",
    "target_seq": "ASK { ?e <pred:name> \"County Roscommon\" . ?e <native_label> ?pv . ?pv <pred:value> \"Contae Ros Comáin\" .  }"
  },
  {
    "qid": "train_4435",
    "input_seq": "Tell me the start time of Potsdam is the twinned administrative body of Perugia.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Potsdam\" . ?e_2 <pred:name> \"Perugia\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4436",
    "input_seq": "How is the Taj Mahal (the one that has the religion Islam) connected to UNESCO World Heritage Site?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Taj Mahal\" . ?e_1 <religion> ?e_3 . ?e_3 <pred:name> \"Islam\" . ?e_2 <pred:name> \"UNESCO World Heritage Site\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4437",
    "input_seq": "Regarding the person called Helena Bonham Carter in their native language when did his or her work period start?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Helena Bonham Carter\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_4438",
    "input_seq": "How are Jaipur and Lagos related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jaipur\" . ?e_2 <pred:name> \"Lagos\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4439",
    "input_seq": "Does the University of Texas at Arlington or Carnegie Mellon University have the greater number of employees?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Texas at Arlington\" .  } UNION { ?e <pred:name> \"Carnegie Mellon University\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4440",
    "input_seq": "Which has the smallest area among the republics whose out-of-school children number is less than 35000000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"35000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4441",
    "input_seq": "How many Wisconsin counties have as the capital the United States city located in Waukesha County?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Wisconsin\" . ?e_1 <capital_of> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . ?e_2 <pred:name> \"Waukesha County\" .   }"
  },
  {
    "qid": "train_4442",
    "input_seq": "What is the TOID of the town whose WOEID is 21763?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"21763\" . ?e <TOID> ?pv .  }"
  },
  {
    "qid": "train_4443",
    "input_seq": "Which movie is shorter, Grown Ups or Terminator 2: Judgment Day (the one whose subtitle is Tuomion päivä)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Grown Ups\" . } UNION { ?e <pred:name> \"Terminator 2: Judgment Day\" . ?e <subtitle> ?pv_1 . ?pv_1 <pred:value> \"Tuomion päivä\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4444",
    "input_seq": "Which area is larger, Liverpool (the one whose native label is Liverpool) or Hamilton (the one whose population is 536917)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Liverpool\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Liverpool\" . } UNION { ?e <pred:name> \"Hamilton\" . ?e <population> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"536917\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4445",
    "input_seq": "When did Elliott Gould become Barbra Streisand's spouse?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Elliott Gould\" . ?e_2 <pred:name> \"Barbra Streisand\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4446",
    "input_seq": "What metropolitan area is located in the state of the United States having the pronunciation audio En-us-Maryland.ogg?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"state of the United States\" . ?e_1 <pronunciation_audio> ?pv . ?pv <pred:value> \"En-us-Maryland.ogg\" .   }"
  },
  {
    "qid": "train_4447",
    "input_seq": "How are Ukrainians related to Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ukrainians\" . ?e_2 <pred:name> \"Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4448",
    "input_seq": "Which is taller, Doug Flutie or Robert Smith (the one that was drafted by the Denver Nuggets)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Doug Flutie\" .  } UNION { ?e <pred:name> \"Robert Smith\" . ?e <drafted_by> ?e_1 . ?e_1 <pred:name> \"Denver Nuggets\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4449",
    "input_seq": "What is the connection between New Line Cinema to New York City?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Line Cinema\" . ?e_2 <pred:name> \"New York City\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4450",
    "input_seq": "How many Arizona counties are named after the ethnic group that has a member named Jonah Hex (whose occupation is soldier)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <named_after> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"ethnic group\" . ?e_3 <member_of> ?e_1 . ?e_3 <pred:name> \"Jonah Hex\" . ?e_3 <occupation> ?e_4 . ?e_4 <pred:name> \"soldier\" .   }"
  },
  {
    "qid": "train_4451",
    "input_seq": "What is the subject if the statement is that Carey Mulligan was the recipient of a Best Actress Oscar nomination?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Carey Mulligan\" . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4452",
    "input_seq": "How many U.S. cities have a population of 25000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25000\"^^xsd:double .  }"
  },
  {
    "qid": "train_4453",
    "input_seq": "Vinnie Jones scored how many points in matches for his club, Chelsea F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Vinnie Jones\" . ?e_2 <pred:name> \"Chelsea F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_points/goals/set_scored> ?qpv .  }"
  },
  {
    "qid": "train_4454",
    "input_seq": "Is the NUTS code equal to ES511 for the province of Spain with the Dewey Decimal Classification of 2--4672?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Spain\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4672\" . ?e <NUTS_code> ?pv . ?pv <pred:value> \"ES511\" .  }"
  },
  {
    "qid": "train_4455",
    "input_seq": "How many Primetime Emmy annual events were the 64th edition or first aired on ABC?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award annual ceremony\" .  { ?e <edition_number> ?pv . ?pv <pred:value> \"64\" .  } UNION { ?e <original_network> ?e_1 . ?e_1 <pred:name> \"American Broadcasting Company\" .  } }"
  },
  {
    "qid": "train_4456",
    "input_seq": "How many video game console models are made in Japan or whose subreddit is xbox360?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"Japan\" .  } UNION { ?e <subreddit> ?pv . ?pv <pred:value> \"xbox360\" .  } }"
  },
  {
    "qid": "train_4457",
    "input_seq": "What is the connection between Vanessa Hudgens to Indigenous peoples of the United States?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vanessa Hudgens\" . ?e_2 <pred:name> \"Indigenous peoples of the United States\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4458",
    "input_seq": "How many United States states are in the geographic distribution of Lebanese Americans or have populations that are not 450000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" .  { ?e_1 <geographic_distribution> ?e . ?e_1 <pred:name> \"Lebanese American\" .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"450000000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_4459",
    "input_seq": "For what was A Passage to India nominated for an Academy Award for Best Cinematography?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"A Passage to India\" . ?e_2 <pred:name> \"Academy Award for Best Cinematography\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4460",
    "input_seq": "Who received an Oscar nomination for Best Writing, Adapted Screenplay for A Simple Plan?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"A Simple Plan\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_4461",
    "input_seq": "On what date did the person die in Urbana?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_death> ?e_1 . ?e_1 <pred:name> \"Urbana\" .  ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_4462",
    "input_seq": "Which area is, at the very least, Stavanger or Sapporo",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Stavanger\" .  } UNION { ?e <pred:name> \"Sapporo\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4463",
    "input_seq": "What point in time did the El Salvador national football team have a ranking of 75?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"El Salvador national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"75\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4464",
    "input_seq": "How is Downton Abbey (the one that was nominated for Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie) related to Amy Nuttall ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Downton Abbey\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie\" . ?e_2 <pred:name> \"Amy Nuttall\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4465",
    "input_seq": "Does the movie assigned exploitation visa number 95267 in 1998 clock in at other than 580 minutes ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"95267\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:year> 1998 . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"580\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4466",
    "input_seq": "What is the number of legislative terms that follow the legislative term that is followed by 27th United States Congress",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"legislative term\" . ?e <follows> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"legislative term\" . ?e_2 <follows> ?e_1 . ?e_2 <pred:name> \"27th United States Congress\" .   }"
  },
  {
    "qid": "train_4467",
    "input_seq": "What is the connection between The Missing (the one whose publication date is 2015-09-26) to Belgium?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Missing\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2015-09-26\"^^xsd:date . ?e_2 <pred:name> \"Belgium\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4468",
    "input_seq": "Is George H.W. Bush's CANTIC-ID a10808231?",
    "target_seq": "ASK { ?e <pred:name> \"George H. W. Bush\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10808231\" .  }"
  },
  {
    "qid": "train_4469",
    "input_seq": "Does Rensselaer County or Allegany County (whose population is 48964) have the larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rensselaer County\" . } UNION { ?e <pred:name> \"Allegany County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"48964\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4470",
    "input_seq": "What activity does the person with an ISNI of 0000 0000 4445 948X participate in the course of voice acting?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 4445 948X\" .   }"
  },
  {
    "qid": "train_4471",
    "input_seq": "How many TV programs are movie documentaries or debuted in a year other than 1956?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television program\" .  { ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1956 ) .  } UNION { ?e <genre> ?e_1 . ?e_1 <pred:name> \"documentary film\" .  } }"
  },
  {
    "qid": "train_4472",
    "input_seq": "Does Charity Commission no. 1142759 correspond to the University of Oxford college with the official website www.sjc.ox.ac.uk ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sjc.ox.ac.uk/\" . ?e <Charity_Commission_no.> ?pv . ?pv <pred:value> \"1142759\" .  }"
  },
  {
    "qid": "train_4473",
    "input_seq": "For the national-association football team whose official website is http://www.fai.ie/, what is the time point for its ranking of 53?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.fai.ie/\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"53\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4474",
    "input_seq": "How is West Orange identified by PermID?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"West Orange\" . ?e <PermID> ?pv .  }"
  },
  {
    "qid": "train_4475",
    "input_seq": "What is the relationship between Jack White, born March 17, 1924, to Royal Tunbridge Wells?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jack White\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1924-03-17\"^^xsd:date . ?e_2 <pred:name> \"Royal Tunbridge Wells\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4476",
    "input_seq": "How many types of sport have a minimum number of players that is not 6.6 or are practiced by a columnist?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"type of sport\" .  { ?e <minimum_number_of_players> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"6.6\"^^xsd:double ) .  } UNION { ?e <practiced_by> ?e_1 . ?e_1 <pred:name> \"columnist\" .  } }"
  },
  {
    "qid": "train_4477",
    "input_seq": "Which higher education institution has their headquarters located at the city where Imperial Japanese Army is also located?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city\" . ?e_3 <location> ?e_1 . ?e_3 <pred:name> \"Imperial Japanese Army\" .   }"
  },
  {
    "qid": "train_4478",
    "input_seq": "Tell me the one with a smaller population, Vicksburg or Florence (which was incepted in 1826-01-07)",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Vicksburg\" . } UNION { ?e <pred:name> \"Florence\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1826-01-07\"^^xsd:date . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4479",
    "input_seq": "What is the connection between The Police and Primetime Emmy winner Sting?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Police\" . ?e_2 <pred:name> \"Sting\" . ?e_2 <award_received> ?e_3 . ?e_3 <pred:name> \"Primetime Emmy Award\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4480",
    "input_seq": "Is Green Zone or Starter for 10 the longer of the two?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Green Zone\" .  } UNION { ?e <pred:name> \"Starter for 10\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4481",
    "input_seq": "Does Ithaca (whose date is 2015) or Goodfellas have the longer runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ithaca\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> 2015 . } UNION { ?e <pred:name> \"Goodfellas\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4482",
    "input_seq": "When was the publication date of the play which was created in 1608?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1608 . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_4483",
    "input_seq": "What is the FIPS 10-4 (countries and regions) for the Ireland county whose area is 5586.0 square kilometers?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ireland\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"5586.0\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }"
  },
  {
    "qid": "train_4484",
    "input_seq": "What is the connection between 105th United States Congress to John Kerry?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"105th United States Congress\" . ?e_2 <pred:name> \"John Kerry\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4485",
    "input_seq": "Which human has the occupation of film producer and the official website of http://www.zachbraff.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"film producer\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.zachbraff.com\" .  }"
  },
  {
    "qid": "train_4486",
    "input_seq": "Is the postal code of the city which ISO 3166-2 code is MA-SYB the same as 40000?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"MA-SYB\" . ?e <postal_code> ?pv . ?pv <pred:value> \"40000\" .  }"
  },
  {
    "qid": "train_4487",
    "input_seq": "Which has a greater duration, Some Kind of Monster or Mr. Smith Goes to Washington (which was nominated for an Academy Award for Best Director)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Some Kind of Monster\" .  } UNION { ?e <pred:name> \"Mr. Smith Goes to Washington\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Director\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4488",
    "input_seq": "Which has the most area among the Arizona counties whose population is not 220000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"220000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4489",
    "input_seq": "When did the New Jersey city at zip code 07055 have a population numbering 69,781?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"07055\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"69781\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4490",
    "input_seq": "What metro borough is the one whose GSS code (2011) is E08000018 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E08000018\" .  }"
  },
  {
    "qid": "train_4491",
    "input_seq": "What is the association of The Bold and the Beautiful with CBS?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Bold and the Beautiful\" . ?e_2 <pred:name> \"CBS\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4492",
    "input_seq": "How many sports are the main subject of Seabiscuit?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e_1 <main_subject> ?e . ?e_1 <pred:name> \"Seabiscuit\" .   }"
  },
  {
    "qid": "train_4493",
    "input_seq": "How are Marrakesh and Marseille related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Marrakesh\" . ?e_2 <pred:name> \"Marseille\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4494",
    "input_seq": "What is the official wbsite of Lexington (the one whose native label is Lexington)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lexington\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Lexington\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4495",
    "input_seq": "Which Arizona county that is located in Arizona (that is the filming location of Jarhead) has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Arizona\" . ?e_2 <filming_location> ?e_1 . ?e_2 <pred:name> \"Jarhead\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4496",
    "input_seq": "Does Charlie Sheen or Jason Lee (whose ISNI is 0000 0001 2135 9045) have more children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Charlie Sheen\" . } UNION { ?e <pred:name> \"Jason Lee\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2135 9045\" . } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4497",
    "input_seq": "Is the IPv4 routing prefix of Heriot-Watt University tne same as 129.67.168.0/22?",
    "target_seq": "ASK { ?e <pred:name> \"Heriot-Watt University\" . ?e <IPv4_routing_prefix> ?pv . ?pv <pred:value> \"129.67.168.0/22\" .  }"
  },
  {
    "qid": "train_4498",
    "input_seq": "Is 0000 0000 0071 9841 the ISNI of the person with official website http://www.frankvincent.com?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.frankvincent.com\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 0071 9841\" .  }"
  },
  {
    "qid": "train_4499",
    "input_seq": "When was the TV movie featuring Erika Christensen as a cast member published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Erika Christensen\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_4500",
    "input_seq": "Which movie is titled აპრილი?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"აპრილი\" .  }"
  },
  {
    "qid": "train_4501",
    "input_seq": "What is the website for the visual artwork that is centered around the Spanish Civil War?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"Spanish Civil War\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4502",
    "input_seq": "What numbers of Christianity have as their official website http://www.patriarchia.ru/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.patriarchia.ru/\" .  }"
  },
  {
    "qid": "train_4503",
    "input_seq": "The movie with the official website www.rumdiarythemovie.com was released in which location on 2012-08-02?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.rumdiarythemovie.com\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-08-02\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4504",
    "input_seq": "Is 1201 the IAB code for extreme sport?",
    "target_seq": "ASK { ?e <pred:name> \"extreme sport\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"1201\" .  }"
  },
  {
    "qid": "train_4505",
    "input_seq": "What is the official website of the US city where Chris Thile was born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Chris Thile\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4506",
    "input_seq": "How many MTV Movie Awards have the official website http://www.mtv.com/ontv/movieawards/ or were nominated to The Fast and the Furious (whose composer is BT)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Movie Awards\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.mtv.com/ontv/movieawards/\" .  } UNION { ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"The Fast and the Furious\" . ?e_1 <composer> ?e_2 . ?e_2 <pred:name> \"BT\" .  } }"
  },
  {
    "qid": "train_4507",
    "input_seq": "What is the connection between Fair Game (whose producer is Akiva Goldsman) and Tom McCarthy (who is a cast member of Little Fockers)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fair Game\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Akiva Goldsman\" . ?e_2 <pred:name> \"Tom McCarthy\" . ?e_4 <cast_member> ?e_2 . ?e_4 <pred:name> \"Little Fockers\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4508",
    "input_seq": "How many wars came after a war that followed the First Crusade ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e_1 <followed_by> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"war\" . ?e_2 <followed_by> ?e_1 . ?e_2 <pred:name> \"First Crusade\" .   }"
  },
  {
    "qid": "train_4509",
    "input_seq": "Is http://web.archive.org/web/20090811001653/http://www.doctorparnassus.co.uk/ the official website of a visual artwork titled The Imaginarium of Doctor Parnassus?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Imaginarium of Doctor Parnassus\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://web.archive.org/web/20090811001653/http://www.doctorparnassus.co.uk/\" .  }"
  },
  {
    "qid": "train_4511",
    "input_seq": "What number of law schools are headquartered in Texarkana?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"law school\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Texarkana\" .   }"
  },
  {
    "qid": "train_4512",
    "input_seq": "Which one has more running time between Red Road and Sleepers?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Red Road\" .  } UNION { ?e <pred:name> \"Sleepers\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4513",
    "input_seq": "The visual artwork titled Percy Jackson & the Olympians: The Lightning Thief is about which folklore?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e_1 <main_subject> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"visual artwork\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Percy Jackson & the Olympians: The Lightning Thief\" .   }"
  },
  {
    "qid": "train_4514",
    "input_seq": "What is the relation between The Green Hornet (whose producer is Neal H. Moritz) and James Newton Howard?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Green Hornet\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Neal H. Moritz\" . ?e_2 <pred:name> \"James Newton Howard\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4516",
    "input_seq": "Is пуш 550 the GOST 7.75–97 code designating Sinhala?",
    "target_seq": "ASK { ?e <pred:name> \"Sinhala\" . ?e <GOST_7.75–97_code> ?pv . ?pv <pred:value> \"пуш 550\" .  }"
  }
]