[
  {
    "qid": "train_4034",
    "input_seq": "The Best Years of Our Lives earned an Academy Award for which Best Supporting Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Best Years of Our Lives\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4035",
    "input_seq": "What's the language associated with http://www.cityofjackson.org/, the official website of a US city that borders Lansing ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Lansing\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofjackson.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4036",
    "input_seq": "Does the California State Senate or the Ohio Senate have fewer seats?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"California State Senate\" .  } UNION { ?e <pred:name> \"Ohio Senate\" .  } ?e <number_of_seats> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4037",
    "input_seq": "What is the Twitter handle of the band whose Giphy username is panicatthedisco?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"panicatthedisco\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_4038",
    "input_seq": "How many states of India belong to the country of India (that is the nation of Amritsar) and are an administrative division of India (that has a diplomatic relationship with Japan)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"India\" . ?e_2 <country> ?e_1 . ?e_2 <pred:name> \"Amritsar\" .  ?e_3 <contains_administrative_territorial_entity> ?e . ?e_3 <pred:name> \"India\" . ?e_4 <diplomatic_relation> ?e_3 . ?e_4 <pred:name> \"Japan\" .  }"
  },
  {
    "qid": "train_4039",
    "input_seq": "Which area has more people, Perth Amboy or Camden?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Perth Amboy\" .  } UNION { ?e <pred:name> \"Camden\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4040",
    "input_seq": "How many states are in India (the one whose nominal GDP is 84374541630.2062 United States dollar)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"India\" . ?e_1 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"84374541630.2062\"^^xsd:double .   }"
  },
  {
    "qid": "train_4041",
    "input_seq": "What is the association between The Straight Story and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Straight Story\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4042",
    "input_seq": "How many subscribers are there on JennifersWayJE, the Twitter username of the spouse of Bradley Cooper (the one that is the film producer) from 2006 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <spouse> ?e_1 . ?e_1 <pred:name> \"Bradley Cooper\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"film producer\" . [ <pred:fact_h> ?e ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:year> 2006 . ?e <Twitter_username> ?pv . ?pv <pred:value> \"JennifersWayJE\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4043",
    "input_seq": "What is the connection between Adam West (the one whose work period (start) is 1954) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Adam West\" . ?e_1 <work_period_(start)> ?pv . ?pv <pred:year> 1954 . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4044",
    "input_seq": "Which geographic region that shares a border with Eurasia has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Eurasia\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4045",
    "input_seq": "Was the founding date other than 1640 for the band with composer George Clinton as a member?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <has_part> ?e_1 . ?e_1 <pred:name> \"George Clinton\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"composer\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1640 ) .  }"
  },
  {
    "qid": "train_4046",
    "input_seq": "I want to know the relationship between Saw IV and Saw III",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saw IV\" . ?e_2 <pred:name> \"Saw III\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4047",
    "input_seq": "What is the relationship between Maui and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Maui\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4048",
    "input_seq": "When was the Haiti national football team ranked 61?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Haiti national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"61\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4049",
    "input_seq": "Which state of Germany whose establishment date is not in 1945 has the highest elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 1945 ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4050",
    "input_seq": "Does the Tower of London featuring Basil Rathbone as a cast member or Superman II: The Richard Donner Cut have a shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tower of London\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Basil Rathbone\" .   } UNION { ?e <pred:name> \"Superman II: The Richard Donner Cut\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4051",
    "input_seq": "When did Marvin Gaye receive a Grammy Lifetime Achievement Award?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Marvin Gaye\" . ?e_2 <pred:name> \"Grammy Lifetime Achievement Award\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4052",
    "input_seq": "How is Grinnell College related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grinnell College\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4053",
    "input_seq": "What is the connection between Queen's University to Kingston (the one whose local dialing code is 613)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Queen's University\" . ?e_2 <pred:name> \"Kingston\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"613\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4054",
    "input_seq": "Where is the film published that has Mark Knopfler as a performer and a publication date of 1998-03-26 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <performer> ?e_1 . ?e_1 <pred:name> \"Mark Knopfler\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1998-03-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4055",
    "input_seq": "How does Nagano Prefecture relate to Hebei?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nagano Prefecture\" . ?e_2 <pred:name> \"Hebei\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4056",
    "input_seq": "How many political parties are headquartered in the capital with Dewey Decimal Classification 2--71384?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"capital\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--71384\" .   }"
  },
  {
    "qid": "train_4057",
    "input_seq": "What person's name in his native language is Chuck Norris?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Chuck Norris\" .  }"
  },
  {
    "qid": "train_4058",
    "input_seq": "Which ones is longer, Independence Day (the one that was nominated for BAFTA Award for Best Sound) or House of Flying Daggers?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Independence Day\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Sound\" .   } UNION { ?e <pred:name> \"House of Flying Daggers\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4059",
    "input_seq": "What activity makes up a part of the activity matching the publisher of Superman (the one that is authored by Geoff Johns) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <part_of> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"activity\" . ?e_2 <publisher> ?e_1 . ?e_2 <pred:name> \"Superman\" . ?e_2 <author> ?e_3 . ?e_3 <pred:name> \"Geoff Johns\" .   }"
  },
  {
    "qid": "train_4060",
    "input_seq": "How is Insidious with Barbara Hershey as cast member related to Hong Kong (country calling code +852)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Insidious\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Barbara Hershey\" . ?e_2 <pred:name> \"Hong Kong\" . ?e_2 <country_calling_code> ?pv . ?pv <pred:value> \"+852\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4061",
    "input_seq": "Where was the film whose exploitation visa number is 127581 published on 2010-10-21?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"127581\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-10-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4062",
    "input_seq": "What academic degree did the pianist Brian May get at the Imperial College London?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brian May\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"pianist\" . ?e_2 <pred:name> \"Imperial College London\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <academic_degree> ?qpv .  }"
  },
  {
    "qid": "train_4063",
    "input_seq": "Regarding the animated feature film entitled Beauty and the Beast and that was published on 1991-11-22 where did it get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Beauty and the Beast\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1991-11-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4064",
    "input_seq": "Who is the production designer for the version of Little Women directed by George Cukor?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <production_designer> ?e . ?e_1 <pred:name> \"Little Women\" . ?e_1 <director> ?e_2 . ?e_2 <pred:name> \"George Cukor\" .   }"
  },
  {
    "qid": "train_4065",
    "input_seq": "How is Roy Thomas of the Philadelphia Phillies related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roy Thomas\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Philadelphia Phillies\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4066",
    "input_seq": "What is the connection between Spellbound (the one whose distributor is THINKFilm) to documentary film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Spellbound\" . ?e_1 <distributor> ?e_3 . ?e_3 <pred:name> \"THINKFilm\" . ?e_2 <pred:name> \"documentary film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4067",
    "input_seq": "Was the Enid represented online at www.enid.org founded more recently than 1891 ?",
    "target_seq": "ASK { ?e <pred:name> \"Enid\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.enid.org\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1891 ) .  }"
  },
  {
    "qid": "train_4068",
    "input_seq": "Which has more area, Champaign County whose FIPS 6-4 (US counties) is 17019 or Clinton County whose FIPS 6-4 (US counties) is 17027?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Champaign County\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"17019\" . } UNION { ?e <pred:name> \"Clinton County\" . ?e <FIPS_6-4_(US_counties)> ?pv_2 . ?pv_2 <pred:value> \"17027\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4069",
    "input_seq": "At what point in time did Yamhill County have a population of 99193?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Yamhill County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"99193\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4070",
    "input_seq": "Which has fewer students, Brandeis University or University of Calcutta?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brandeis University\" .  } UNION { ?e <pred:name> \"University of Calcutta\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4071",
    "input_seq": "What language is http://www.clubgodoycruz.com.ar, the official website of Godoy Cruz Antonio Tomba ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Godoy Cruz Antonio Tomba\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.clubgodoycruz.com.ar/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4072",
    "input_seq": "The USA's National League includes how many baseball clubs?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"baseball team\" . ?e <league> ?e_1 . ?e_1 <pred:name> \"National League\" . ?e_1 <country> ?e_2 . ?e_2 <pred:name> \"United States of America\" .   }"
  },
  {
    "qid": "train_4073",
    "input_seq": "What is the determination method of 429079, the population of Washoe County?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Washoe County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"429079\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_4074",
    "input_seq": "Which Alabama county that is an administrative division of Alabama (that partially holds the Appalachian Mountains) has the largest land area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Alabama\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Alabama\" . ?e_1 <partially_contains> ?e_2 . ?e_2 <pred:name> \"Appalachian Mountains\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4075",
    "input_seq": "What language is used in http://www.priorityrecords.com, which is the official website of Dr. Dre's record label since 1988 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e_1 <record_label> ?e . ?e_1 <pred:name> \"Dr. Dre\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <record_label> ; <pred:fact_t> ?e ] <start_time> ?qpv_1 . ?qpv_1 <pred:year> 1988 . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.priorityrecords.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4076",
    "input_seq": "Which is the loser at the box office between Hellboy, released in Venezuela, or The Spy Who Loved Me, an Academy Award nominee for Best Original Score?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hellboy\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Venezuela\" .   } UNION { ?e <pred:name> \"The Spy Who Loved Me\" . ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Original Score\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4077",
    "input_seq": "Was the European Film Award for best Composer started in 191?",
    "target_seq": "ASK { ?e <pred:name> \"European Film Award for Best Composer\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1791 ) .  }"
  },
  {
    "qid": "train_4078",
    "input_seq": "Given that Rush Hour 3 is part of the Rush Hour series, which came before it?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rush Hour 3\" . ?e_2 <pred:name> \"Rush Hour\" . ?e_2 <has_part> ?e_3 . ?e_3 <pred:name> \"Rush Hour 3\" . ?e_1 <part_of_the_series> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_2 ] <follows> ?qpv .  }"
  },
  {
    "qid": "train_4079",
    "input_seq": "The movie represented online at www.startrek.com/page/star-trek-nemesis was publicly released in what location on 2002-12-13?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.startrek.com/page/star-trek-nemesis\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-12-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4080",
    "input_seq": "Which is the film titled un prophete released in Denmark?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Un prophète\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Denmark\" .  }"
  },
  {
    "qid": "train_4081",
    "input_seq": "How many subscribers on twitter does the person who is associated with Montpellier Hérault Sport Club have that has the username MontpellierHSC?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Montpellier Hérault Sport Club\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"MontpellierHSC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4082",
    "input_seq": "What is the area of the administrative territorial entity whose official website is http://www.co.madison.tn.us?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.co.madison.tn.us\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_4083",
    "input_seq": "Was Chris Parnell born sometime other than 1971 ?",
    "target_seq": "ASK { ?e <pred:name> \"Chris Parnell\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1971 ) .  }"
  },
  {
    "qid": "train_4084",
    "input_seq": "What is the connection between Austria-Hungary to Romania (the one that replaces Moldavia)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Austria-Hungary\" . ?e_2 <pred:name> \"Romania\" . ?e_3 <replaced_by> ?e_2 . ?e_3 <pred:name> \"Moldavia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4085",
    "input_seq": "Which area is smaller, Jefferson County (the one that contains the administrative division Beaumont) or Bexar County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jefferson County\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Beaumont\" .   } UNION { ?e <pred:name> \"Bexar County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4087",
    "input_seq": "What is the connection between Michael Kahn (the one that was nominated for Tony Award for Best Direction of a Musical) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Kahn\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Tony Award for Best Direction of a Musical\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4088",
    "input_seq": "What is the association of Media Asia Entertainment Group with Hong Kong (that is the release territory of Final Destination 5)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Media Asia Entertainment Group\" . ?e_2 <pred:name> \"Hong Kong\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"Final Destination 5\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4089",
    "input_seq": "What is the connection between Henry King (the one whose ISNI is 0000 0000 7357 1825) to screenwriter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Henry King\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7357 1825\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4090",
    "input_seq": "When did Brittany (the one that is the death place of Geoffrey Unsworth) become the administrative division of France?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"France\" . ?e_2 <pred:name> \"Brittany\" . ?e_3 <place_of_death> ?e_2 . ?e_3 <pred:name> \"Geoffrey Unsworth\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <inception> ?qpv .  }"
  },
  {
    "qid": "train_4091",
    "input_seq": "What non-metropolitan district contains the college of the University of Cambridge whose native name is Christ's College?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan district\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"college of the University of Cambridge\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"Christ's College\" .   }"
  },
  {
    "qid": "train_4092",
    "input_seq": "What is the number of superheroes that are unlike the superhero whose name is Ghost Rider in native language?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <different_from> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"superhero\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Ghost Rider\" .   }"
  },
  {
    "qid": "train_4093",
    "input_seq": "Which area is larger, Durban or Casablanca (the one whose population is 4370000)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Durban\" . } UNION { ?e <pred:name> \"Casablanca\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4370000\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4094",
    "input_seq": "How many miniseries are followed by the miniseries whose official website is http://www.pbs.org/wgbh/masterpiece/janeeyre/index.html?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <followed_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"miniseries\" . ?e_1 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.pbs.org/wgbh/masterpiece/janeeyre/index.html\" .   }"
  },
  {
    "qid": "train_4095",
    "input_seq": "Which city in or along the Indian Ocean had the most inhabitants?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:name> \"Indian Ocean\" .  ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4096",
    "input_seq": "What animated feature film has David Tennant as a voice actor?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"David Tennant\" .   }"
  },
  {
    "qid": "train_4097",
    "input_seq": "How is the 2nd US Congress related to the James Madison who held the office of US President?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2nd United States Congress\" . ?e_2 <pred:name> \"James Madison\" . ?e_2 <position_held> ?e_3 . ?e_3 <pred:name> \"President of the United States\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4098",
    "input_seq": "When did the political party which was founded in 1859 dissolve?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1859 . ?e <dissolved,_abolished_or_demolished> ?pv .  }"
  },
  {
    "qid": "train_4100",
    "input_seq": "What region of Italy has citizens who are the Lucane people and shares a border with Apulia?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of Italy\" . ?e <demonym> ?pv . ?pv <pred:value> \"lucane\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Apulia\" .  }"
  },
  {
    "qid": "train_4101",
    "input_seq": "How many feature films derive Battleship (which was released for Xbox 360) or has Anna Faris as a voice actor?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" .  { ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"Battleship\" . ?e_1 <platform> ?e_2 . ?e_2 <pred:name> \"Xbox 360\" .  } UNION { ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Anna Faris\" .  } }"
  },
  {
    "qid": "train_4102",
    "input_seq": "Is Austin Powers: The Spy Who Shagged Me longer than 40 minutes?",
    "target_seq": "ASK { ?e <pred:name> \"Austin Powers: The Spy Who Shagged Me\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v > \"40\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4103",
    "input_seq": "Does Poole or Worthing occupy a larger territory?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Poole\" .  } UNION { ?e <pred:name> \"Worthing\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4104",
    "input_seq": "Does Merck & Co. or Adobe Inc. have less revenue total?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Merck & Co.\" .  } UNION { ?e <pred:name> \"Adobe Inc.\" .  } ?e <total_revenue> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4105",
    "input_seq": "Who directed the movie based on the Jesus Christ Superstar that had its opening show in 1970?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_1 <based_on> ?e_3 . ?e_3 <pred:name> \"Jesus Christ Superstar\" . ?e_3 <date_of_first_performance> ?pv . ?pv <pred:year> 1970 .   }"
  },
  {
    "qid": "train_4106",
    "input_seq": "Is 0000 0000 9808 5671 the ISNI of the city which is the twinned administrative body of Newport (the one whose country is United States of America)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:name> \"Newport\" . ?e_1 <country> ?e_2 . ?e_2 <pred:name> \"United States of America\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9808 5671\" .  }"
  },
  {
    "qid": "train_4107",
    "input_seq": "William Blake was born on which street in London, headquarters of Channel 4?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"William Blake\" . ?e_2 <pred:name> \"London\" . ?e_3 <headquarters_location> ?e_2 . ?e_3 <pred:name> \"Channel 4\" . ?e_1 <place_of_birth> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_birth> ; <pred:fact_t> ?e_2 ] <located_on_street> ?qpv .  }"
  },
  {
    "qid": "train_4108",
    "input_seq": "At what point in time is 28241 the population of the administrative territorial entity that shares a border with Hamilton County (whose capital is Chattanooga)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Hamilton County\" . ?e_2 <capital_of> ?e_1 . ?e_2 <pred:name> \"Chattanooga\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"28241\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4109",
    "input_seq": "What is the link between Chet Atkins and record producer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chet Atkins\" . ?e_2 <pred:name> \"record producer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4110",
    "input_seq": "Who is taller, Matthew Perry or Omar Sharif?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Matthew Perry\" .  } UNION { ?e <pred:name> \"Omar Sharif\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4111",
    "input_seq": "Is Gwen Stefani's Snapchat username equal to theddlovato ?",
    "target_seq": "ASK { ?e <pred:name> \"Gwen Stefani\" . ?e <Snapchat_username> ?pv . ?pv <pred:value> \"theddlovato\" .  }"
  },
  {
    "qid": "train_4112",
    "input_seq": "Was the association football club whose official website is http://www.aokavalas.gr/ founded after 1888?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.aokavalas.gr/\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1888 ) .  }"
  },
  {
    "qid": "train_4113",
    "input_seq": "Does Oahu or Newfoundland have more area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Oahu\" .  } UNION { ?e <pred:name> \"Newfoundland\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]