[
  {
    "qid": "train_330",
    "input_seq": "Does the sovereign state that has a diplomatic relation with Malaysia (the subject of this statement is East Timor–Malaysia relations), have the CIVICUS Monitor country entry of saint-lucia?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <diplomatic_relation> ?e . ?e_1 <pred:name> \"Malaysia\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"East Timor–Malaysia relations\" . ?e <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"saint-lucia\" .  }"
  },
  {
    "qid": "train_331",
    "input_seq": "What is the name of the person who died in Beverly Hills and has an IPI name number of 00025196099?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_death> ?e_1 . ?e_1 <pred:name> \"Beverly Hills\" .  ?e <IPI_name_number> ?pv . ?pv <pred:value> \"00025196099\" .  }"
  },
  {
    "qid": "train_332",
    "input_seq": "When was the release of the visual artwork clocking in at 231 minutes?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"231\"^^xsd:double . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_333",
    "input_seq": "What occupation has ROME Occupation Code (v3) C1503?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"C1503\" .  }"
  },
  {
    "qid": "train_334",
    "input_seq": "What is the CANTIC-ID of Aidan Quinn?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aidan Quinn\" . ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_335",
    "input_seq": "What is the native label of Helen (the one whose Caverphone is ALN111)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Helen\" . ?e <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"ALN111\" . ?e <native_label> ?pv .  }"
  },
  {
    "qid": "train_336",
    "input_seq": "Does Jackson (official website www.cityofjackson.net) or Quincy (zip codes 02169–02171) have the higher elevation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jackson\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofjackson.net/\" . } UNION { ?e <pred:name> \"Quincy\" . ?e <postal_code> ?pv_2 . ?pv_2 <pred:value> \"02169–02171\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_337",
    "input_seq": "Of Austin Powers: International Man of Mystery and Insidious (official website is http://www.insidious-movie.com/), which is shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Austin Powers: International Man of Mystery\" . } UNION { ?e <pred:name> \"Insidious\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.insidious-movie.com/\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_338",
    "input_seq": "How many secondary schools did the person with ISNI 0000 0000 4398 0513 attend?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"secondary school\" . ?e_1 <educated_at> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 4398 0513\" .   }"
  },
  {
    "qid": "train_339",
    "input_seq": "The person in the cast of Porto, published in 2016, was born with what name?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Porto\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:year> 2016 . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_340",
    "input_seq": "What is the connection between Shania Twain to country music?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shania Twain\" . ?e_2 <pred:name> \"country music\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_341",
    "input_seq": "When did Lars von Trier win the National Society of Film Critics Award for Best Director?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"National Society of Film Critics Award for Best Director\" . ?e_2 <pred:name> \"Lars von Trier\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_342",
    "input_seq": "Among the seas whose vertical depth is not equal to 2700 metres, which has the largest vertical depth?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <vertical_depth> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"2700\"^^xsd:double ) . ?e <vertical_depth> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_343",
    "input_seq": "How many reggae songs have Busta Rhymes in them?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Busta Rhymes\" .   }"
  },
  {
    "qid": "train_344",
    "input_seq": "How many public offices are the head of government of the United States city that shares a border with Arlington County?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public office\" . ?e_1 <office_held_by_head_of_government> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_2 <shares_border_with> ?e_1 . ?e_2 <pred:name> \"Arlington County\" .   }"
  },
  {
    "qid": "train_345",
    "input_seq": "For Harris County, what is the language associated with this creative work for its official website of http://www.co.harris.tx.us?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Harris County\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.harris.tx.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_346",
    "input_seq": "Which movie is shorter, Bram Stoker's Dracula (the one whose genre is drama film) or Bedazzled (the one that has Raquel Welch as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bram Stoker's Dracula\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"drama film\" .   } UNION { ?e <pred:name> \"Bedazzled\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Raquel Welch\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_347",
    "input_seq": "Who has more children, Colleen Clinkenbeard or Karl Malden?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Colleen Clinkenbeard\" .  } UNION { ?e <pred:name> \"Karl Malden\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_348",
    "input_seq": "What person is the winner associated with Crazy Heart that received the Critics' Choice Movie Award for Best Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Crazy Heart\" . ?e_2 <pred:name> \"Critics' Choice Movie Award for Best Actor\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <winner> ?qpv .  }"
  },
  {
    "qid": "train_349",
    "input_seq": "Who was born in the Taunton corresponding to OS grid reference ST228250?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Taunton\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"ST228250\" .   }"
  },
  {
    "qid": "train_350",
    "input_seq": "What is the official website of the record label whose Twitter username is CasablancaRecs?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"CasablancaRecs\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_351",
    "input_seq": "Which movie made less at the box office, Man of Steel or Amistad?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Man of Steel\" .  } UNION { ?e <pred:name> \"Amistad\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_352",
    "input_seq": "What is the largest vertical depth out out of the seas that have a basin in the country of Italy?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <basin_country> ?e_1 . ?e_1 <pred:name> \"Italy\" .  ?e <vertical_depth> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_353",
    "input_seq": "How many land-grant universities use the Persian language or are the school, where the 2006 NFL Draft, is picked?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" .  { ?e <language_used> ?e_1 . ?e_1 <pred:name> \"Persian\" .  } UNION { ?e_1 <draft_pick_from_school> ?e . ?e_1 <pred:name> \"2006 NFL Draft\" .  } }"
  },
  {
    "qid": "train_354",
    "input_seq": "When did the second largest city that is the residence of Alexander Pushkin have a population of 1023000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"second largest city\" . ?e_1 <residence> ?e . ?e_1 <pred:name> \"Alexander Pushkin\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1023000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_355",
    "input_seq": "Johannesburg is the story setting of how many TV episodes?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Johannesburg\" .   }"
  },
  {
    "qid": "train_356",
    "input_seq": "What is the ISNI of John C. McGinley?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John C. McGinley\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_357",
    "input_seq": "What number of computer programming languages are influenced by C?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"computer programming\" . ?e <influenced_by> ?e_1 . ?e_1 <pred:name> \"C\" .   }"
  },
  {
    "qid": "train_358",
    "input_seq": "What is the subject of the statement that The Last Emperor (that received an Academy Award for Best Writing, Adapted Screenplay) received an Academy Award for Best Production Design?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Last Emperor\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_359",
    "input_seq": "When was baroque pop invented?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"baroque pop\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_360",
    "input_seq": "When was the director of Samson and Delilah (designed by Hans Dreier) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"Samson and Delilah\" . ?e_1 <production_designer> ?e_2 . ?e_2 <pred:name> \"Hans Dreier\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_361",
    "input_seq": "How many religions are associated with the official religion of Vanuatu?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e_1 <official_religion> ?e . ?e_1 <pred:name> \"Vanuatu\" .   }"
  },
  {
    "qid": "train_362",
    "input_seq": "What number of Pennsylvania cities have local dialing code 724?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of Pennsylvania\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"724\" .  }"
  },
  {
    "qid": "train_363",
    "input_seq": "Is http://www.montgomeryco.com the offical website of the baseball team named after Rocky Mountains ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"baseball team\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Rocky Mountains\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.montgomeryco.com\" .  }"
  },
  {
    "qid": "train_364",
    "input_seq": "When did Guangzhou become twinned to Frankfurt as an administrative body ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guangzhou\" . ?e_2 <pred:name> \"Frankfurt\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_365",
    "input_seq": "How is John Davis whose ISNI is 0000 0001 0912 821X related to the Tennessee Titans?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Davis\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0912 821X\" . ?e_2 <pred:name> \"Tennessee Titans\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_366",
    "input_seq": "Is 4000000074551100 the TOID of George Fenton's London area birth place?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"area of London\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"George Fenton\" .  ?e <TOID> ?pv . ?pv <pred:value> \"4000000074551100\" .  }"
  },
  {
    "qid": "train_367",
    "input_seq": "When was  Flight of the Conchords (the one whose publication date is 2008-04-21) nominated for Grammy Award for Best Comedy Album (the one whose inception time is 1959)",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Flight of the Conchords\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2008-04-21\"^^xsd:date . ?e_2 <pred:name> \"Grammy Award for Best Comedy Album\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:year> 1959 . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_368",
    "input_seq": "How many of Ohio's counties have inception times, not in 1817?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ohio\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1817 ) .  }"
  },
  {
    "qid": "train_369",
    "input_seq": "Who has less height, Stephen Colbert (who works in the Washington, D.C., location) or Thomas Jefferson (who founded University of Virginia School of Law)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Stephen Colbert\" . ?e <work_location> ?e_1 . ?e_1 <pred:name> \"Washington, D.C.\" .   } UNION { ?e <pred:name> \"Thomas Jefferson\" . ?e <found> ?e_2 . ?e_2 <pred:name> \"University of Virginia School of Law\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_370",
    "input_seq": "What is the number of awards that either have the official website of http://www.grammy.com/en or that started before 1989?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1989 ) .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.grammy.com/en\" .  } }"
  },
  {
    "qid": "train_371",
    "input_seq": "Which animated film whose release date is in 1994 has the longest runtime?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> 1994 . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_372",
    "input_seq": "Is 0000 0000 6304 3244 the ISNI for the person with CANTIC-ID a10145898?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a10145898\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 6304 3244\" .  }"
  },
  {
    "qid": "train_373",
    "input_seq": "Which website represents the activity with the Nintendo GameID R5PE69?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"R5PE69\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_374",
    "input_seq": "Which is shorter, Howards End or Good?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Good\" .  } UNION { ?e <pred:name> \"Howards End\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_375",
    "input_seq": "Are there less than 30000 households on the date 2011-01-01 in the big city that is an administrative division of North Brabant?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"North Brabant\" .  ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"30000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_households> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_376",
    "input_seq": "What is the number of albums whose release date is not in 1979 or origin is the United States of America?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1979 ) .  } UNION { ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } }"
  },
  {
    "qid": "train_377",
    "input_seq": "Does the nickname Βισσινοί refer to the soccer club with the Instagram handle ltfc_official?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"ltfc_official\" . ?e <nickname> ?pv . ?pv <pred:value> \"Βισσινοί\" .  }"
  },
  {
    "qid": "train_378",
    "input_seq": "When was The Scorpion King produced by Sammo Hung published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"The Scorpion King\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Sammo Hung\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_379",
    "input_seq": "Which ISNI designates the person born on 1963-04-10?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1963-04-10\"^^xsd:date . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_380",
    "input_seq": "What is the connection between the Richard Rodgers whose genre is musical and The King and I, with librettist Oscar Hammerstein II?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Rodgers\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"musical\" . ?e_2 <pred:name> \"The King and I\" . ?e_2 <librettist> ?e_4 . ?e_4 <pred:name> \"Oscar Hammerstein II\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_381",
    "input_seq": "Which has higher elevation above sea level, Tokyo (the one whose population is 13513734) or Warsaw?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tokyo\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13513734\"^^xsd:double . } UNION { ?e <pred:name> \"Warsaw\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_382",
    "input_seq": "When Samuel L. Jackson was nominated for Academy Award for Best Supporting Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Samuel L. Jackson\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_383",
    "input_seq": "With its publication date on 2000-11-30, where is the publication of The Mission (the one whose duration is 84 minute)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The Mission\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"84\"^^xsd:double . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_384",
    "input_seq": "Is the run-time under 3100 seconds for the animated feature film preceding Kung Fu Panda 2, released in France?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e_1 <follows> ?e . ?e_1 <pred:name> \"Kung Fu Panda 2\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"France\" .  ?e <duration> ?pv . ?pv <pred:unit> \"second\" . ?pv <pred:value> ?v . FILTER ( ?v < \"3100\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_385",
    "input_seq": "What is the birth name of George Sanders (the one that won the Academy Award for Best Supporting Actor)",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"George Sanders\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Academy Award for Best Supporting Actor\" .  ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_386",
    "input_seq": "How many manifestations have the ACM Classification Code (2012) of 10011466 or are followed by video?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" .  { ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011466\" .  } UNION { ?e_1 <follows> ?e . ?e_1 <pred:name> \"video\" .  } }"
  },
  {
    "qid": "train_387",
    "input_seq": "Where was the English version of Orange County published on 2002-07-25?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Orange County\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2002-07-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_388",
    "input_seq": "What is the largest county in Alabama that has a population of 4779736?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Alabama\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Alabama\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4779736\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_389",
    "input_seq": "What is the India state that borders Sindh and whose FIPS 10-4 (countries and regions) is IN09?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Sindh\" .  ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"IN09\" .  }"
  },
  {
    "qid": "train_390",
    "input_seq": "What province of Canada, with a population less than 32000, is largest by area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Canada\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"32000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_391",
    "input_seq": "Does Babylon 5, ECW or TNN have more episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"ECW on TNN\" .  } UNION { ?e <pred:name> \"Babylon 5\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_392",
    "input_seq": "How is the Rhine related to the canton of Zürich?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rhine\" . ?e_2 <pred:name> \"canton of Zürich\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_393",
    "input_seq": "Which film's box office is 48363516 U.S. dollars?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box_office> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"48363516\"^^xsd:double .  }"
  },
  {
    "qid": "train_394",
    "input_seq": "Is nl the IETF language tag for Filipino?",
    "target_seq": "ASK { ?e <pred:name> \"Filipino\" . ?e <IETF_language_tag> ?pv . ?pv <pred:value> \"nl\" .  }"
  },
  {
    "qid": "train_395",
    "input_seq": "Does the college officially called Εθνικόν Πανεπιστήμιον as of 1862 have an ISNI of 0000 0004 1936 893X?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Εθνικόν Πανεπιστήμιον\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:year> 1862 . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 893X\" .  }"
  },
  {
    "qid": "train_396",
    "input_seq": "Which cost more to make, Chocolat (the one whose cost is 18500000 United States dollar) or W.?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chocolat\" . ?e <cost> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"18500000\"^^xsd:double . } UNION { ?e <pred:name> \"W.\" . } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_397",
    "input_seq": "Which has fewer episodes, Sense and Sensibility that originally aired on BBC One or Chicago Hope?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sense and Sensibility\" . ?e <original_network> ?e_1 . ?e_1 <pred:name> \"BBC One\" .   } UNION { ?e <pred:name> \"Chicago Hope\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_398",
    "input_seq": "Is the motto for the 2012 Summer Olympics Ad utrumque paratus?",
    "target_seq": "ASK { ?e <pred:name> \"2012 Summer Olympics\" . ?e <motto_text> ?pv . ?pv <pred:value> \"Ad utrumque paratus\" .  }"
  },
  {
    "qid": "train_399",
    "input_seq": "How many municipalities of the Netherlands are the headquarters location of the Delft University of Technology or are an administrative division of South Holland?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"municipality of the Netherlands\" .  { ?e_1 <headquarters_location> ?e . ?e_1 <pred:name> \"Delft University of Technology\" .  } UNION { ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"South Holland\" .  } }"
  },
  {
    "qid": "train_400",
    "input_seq": "Which movie is shorter, Tangled (the one whose duration is 86 minute) or Lemony Snicket's A Series of Unfortunate Events (the one that has Jane Lynch as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tangled\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"86\"^^xsd:double . } UNION { ?e <pred:name> \"Lemony Snicket's A Series of Unfortunate Events\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jane Lynch\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_401",
    "input_seq": "Which movie made less at the box office, Big or The Prestige?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Big\" .  } UNION { ?e <pred:name> \"The Prestige\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_402",
    "input_seq": "Does the association-football club, whose official website is http://www.rioave-fc.pt/, have an inception time not in 1932?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.rioave-fc.pt/\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1932 ) .  }"
  },
  {
    "qid": "train_403",
    "input_seq": "What is the number of private not-for-profit learning institutions whose NRHP reference number is 82004590 or official website is https://www.ciachef.edu?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private not-for-profit educational institution\" .  { ?e <NRHP_reference_number> ?pv . ?pv <pred:value> \"82004590\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"https://www.ciachef.edu\" .  } }"
  },
  {
    "qid": "train_404",
    "input_seq": "How is 2005 NFL Draft related to San Francisco 49ers ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2005 NFL Draft\" . ?e_2 <pred:name> \"San Francisco 49ers\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_405",
    "input_seq": "What language is associated with the official website http://www.parkcounty.us for the administrative territorial entity whose population is 29228 (the determination method of this statement is demographic balance)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29228\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <determination_method> ?qpv_1 . ?qpv_1 <pred:value> \"demographic balance\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.parkcounty.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_406",
    "input_seq": "The private university attended by Lisa Kudrow is over how many private schools?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private school\" . ?e_1 <subsidiary> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"private university\" . ?e_2 <educated_at> ?e_1 . ?e_2 <pred:name> \"Lisa Kudrow\" .   }"
  },
  {
    "qid": "train_407",
    "input_seq": "When did Reader (the one whose original language is French) receive Louis Delluc Prize?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Reader\" . ?e_1 <original_language_of_film_or_TV_show> ?e_3 . ?e_3 <pred:name> \"French\" . ?e_2 <pred:name> \"Louis Delluc Prize\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_408",
    "input_seq": "Does Great Expectations (the one whose publication date is 1974-01-01), have its title equal to Phoenix?",
    "target_seq": "ASK { ?e <pred:name> \"Great Expectations\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1974-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Phoenix\" .  }"
  }
]