[
  {
    "qid": "train_2867",
    "input_seq": "When did Charles Durning win Screen Actors Guild Life Achievement Award  ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Life Achievement Award\" . ?e_2 <pred:name> \"Charles Durning\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2868",
    "input_seq": "When did Patti Smith begin recording on the Arista Records label?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Patti Smith\" . ?e_2 <pred:name> \"Arista Records\" . ?e_1 <record_label> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <record_label> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2869",
    "input_seq": "How many Arizona counties have the capital Akron (whose local area code is 330 - 234) or share a border with Jefferson County (whose official website is http://www.louisvilleky.gov)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" .  { ?e <capital> ?e_1 . ?e_1 <pred:name> \"Akron\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"330 - 234\" .  } UNION { ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Jefferson County\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.louisvilleky.gov\" .  } }"
  },
  {
    "qid": "train_2870",
    "input_seq": "What is the end time for the television series whose official website is http://www.transformers.com/ (the language of this statement is English)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.transformers.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <end_time> ?pv .  }"
  },
  {
    "qid": "train_2871",
    "input_seq": "Is the runtime of the visual artwork produced by Quincy Jones longer than 80 minutes?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Quincy Jones\" .  ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v > \"80\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2872",
    "input_seq": "What is the elevation above sea level of the U.S. city where Justin Chambers was born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Justin Chambers\" .  ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_2874",
    "input_seq": "What is the Iconclass notation for the art of sculpture?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"art of sculpture\" . ?e <Iconclass_notation> ?pv .  }"
  },
  {
    "qid": "train_2875",
    "input_seq": "Is the TOID of the non-metropolitan county that is an administrative division of North Yorkshire (which shares a border with Cumbria) 4000000074572911?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan county\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"North Yorkshire\" . ?e_2 <shares_border_with> ?e_1 . ?e_2 <pred:name> \"Cumbria\" .  ?e <TOID> ?pv . ?pv <pred:value> \"4000000074572911\" .  }"
  },
  {
    "qid": "train_2876",
    "input_seq": "How many metropolitan boroughs contain Rochdale (the one whose TOID is 4000000074566708) or have the United Kingdom as a country?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" .  { ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Rochdale\" . ?e_1 <TOID> ?pv . ?pv <pred:value> \"4000000074566708\" .  } UNION { ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  } }"
  },
  {
    "qid": "train_2877",
    "input_seq": "Did Myrna Loy not die in 1968?",
    "target_seq": "ASK { ?e <pred:name> \"Myrna Loy\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1968 ) .  }"
  },
  {
    "qid": "train_2878",
    "input_seq": "Is Robert Carlock's date of birth after 1979?",
    "target_seq": "ASK { ?e <pred:name> \"Robert Carlock\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1979 ) .  }"
  },
  {
    "qid": "train_2879",
    "input_seq": "Does the short film directed by Orson Welles have a publication date before 2015?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"short film\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Orson Welles\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2015 ) .  }"
  },
  {
    "qid": "train_2880",
    "input_seq": "What is the connection between Saturn Award for Best Actress to Angela Bassett?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saturn Award for Best Actress\" . ?e_2 <pred:name> \"Angela Bassett\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2881",
    "input_seq": "What is the start date that Australia (that is the country of Queensland University of Technology) has green as its official symbol?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Australia\" . ?e_3 <country> ?e_1 . ?e_3 <pred:name> \"Queensland University of Technology\" . ?e_2 <pred:name> \"green\" . ?e_1 <official_symbol> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <official_symbol> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2882",
    "input_seq": "How many California counties have a population above but not equal to 330000 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"330000\"^^xsd:double ) . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"330000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2883",
    "input_seq": "Which political party has an official website of http://www.uup.org/ and was founded before 1909?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.uup.org/\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v . FILTER ( ?v < 1909 ) .  }"
  },
  {
    "qid": "train_2884",
    "input_seq": "Between David Healy of Doncaster Rovers F.C. or Claudia Schiffer, who is shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"David Healy\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Doncaster Rovers F.C.\" .   } UNION { ?e <pred:name> \"Claudia Schiffer\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2885",
    "input_seq": "How numerous harbour city that is the capital of lower Austria and whose official website is http://www.izmir.gov.tr/",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"port city\" . ?e_1 <capital> ?e . ?e_1 <pred:name> \"Lower Austria\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.izmir.gov.tr/\" .  }"
  },
  {
    "qid": "train_2887",
    "input_seq": "Does Kozhikode or Chelmsford have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kozhikode\" .  } UNION { ?e <pred:name> \"Chelmsford\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2888",
    "input_seq": "What is the official website for Walt Disney (the one whose distributor is PBS)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Walt Disney\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"PBS\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2889",
    "input_seq": "What is the IPv6 routing prefix of the University of Halle-Wittenberg?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"University of Halle-Wittenberg\" . ?e <IPv6_routing_prefix> ?pv .  }"
  },
  {
    "qid": "train_2890",
    "input_seq": "Is the Staten Island at zip codes 10301–10314 officially called Montgomery County ?",
    "target_seq": "ASK { ?e <pred:name> \"Staten Island\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"10301–10314\" . ?e <official_name> ?pv . ?pv <pred:value> \"Montgomery County\" .  }"
  },
  {
    "qid": "train_2891",
    "input_seq": "Which has more episodes, Ryan's Hope or The Vampire Diaries?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ryan's Hope\" .  } UNION { ?e <pred:name> \"The Vampire Diaries\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2892",
    "input_seq": "Does RuPaul use the Instagram name rupaulofficial ?",
    "target_seq": "ASK { ?e <pred:name> \"RuPaul\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"rupaulofficial\" .  }"
  },
  {
    "qid": "train_2893",
    "input_seq": "Was the person with the official website is http://www.stevenwright.com born after 1988?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.stevenwright.com\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1988 ) .  }"
  },
  {
    "qid": "train_2894",
    "input_seq": "What is the connection between the Liberation Tigers of Tamil Eelam and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Liberation Tigers of Tamil Eelam\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2895",
    "input_seq": "Does Kenneth Mars or musician David Newman have more kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kenneth Mars\" .  } UNION { ?e <pred:name> \"David Newman\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"musician\" .   } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2896",
    "input_seq": "How many historical counties have a population greater than 1500000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historical country\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1500000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2897",
    "input_seq": "Does Mutiny on the Bounty (that has Franchot Tone as a cast member) or Amadeus (that was nominated for an Academy Award for Best Sound Mixing) have the longer runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mutiny on the Bounty\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Franchot Tone\" .   } UNION { ?e <pred:name> \"Amadeus\" . ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Sound Mixing\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2898",
    "input_seq": "How are The Decemberists connected to Kill Rock Stars?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Decemberists\" . ?e_2 <pred:name> \"Kill Rock Stars\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2899",
    "input_seq": "What is the total number of baseball teams that are participants in the 1954 Major League Baseball season or who have an official team color of white?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"baseball team\" .  { ?e <official_color> ?e_1 . ?e_1 <pred:name> \"white\" .  } UNION { ?e_1 <participant> ?e . ?e_1 <pred:name> \"1954 Major League Baseball season\" .  } }"
  },
  {
    "qid": "train_2900",
    "input_seq": "Which one has less students, University of Minnesota or Virginia Tech?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Minnesota\" .  } UNION { ?e <pred:name> \"Virginia Tech\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2901",
    "input_seq": "Who has the Twitter username of crispinfreeman?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"crispinfreeman\" .  }"
  },
  {
    "qid": "train_2902",
    "input_seq": "What is the IPTC Newscode for artistic gymnastics?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"artistic gymnastics\" . ?e <IPTC_Newscode> ?pv .  }"
  },
  {
    "qid": "train_2903",
    "input_seq": "What is the US counties FIPS 6-4 for the Maryland county whose native title is Anne Arundel County?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Anne Arundel County\" . ?e <FIPS_6-4_(US_counties)> ?pv .  }"
  },
  {
    "qid": "train_2905",
    "input_seq": "The Twitter handle newline_cinema belongs to which movie production company?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"newline_cinema\" .  }"
  },
  {
    "qid": "train_2906",
    "input_seq": "What is the language associated with https://www.bankofamerica.com, the official website of an organization whose IPv4 routing prefix is 171.206.0.0/16 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <IPv4_routing_prefix> ?pv_1 . ?pv_1 <pred:value> \"171.206.0.0/16\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.bankofamerica.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2907",
    "input_seq": "What is Demi Lovato's Giphy username?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Demi Lovato\" . ?e <Giphy_username> ?pv .  }"
  },
  {
    "qid": "train_2908",
    "input_seq": "For the ice hockey team that drafts Colin Wilson (the one that is educated at Boston University), what is the language associated with this creative work for its official website of http://predators.nhl.com/?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ice hockey team\" . ?e_1 <drafted_by> ?e . ?e_1 <pred:name> \"Colin Wilson\" . ?e_1 <educated_at> ?e_2 . ?e_2 <pred:name> \"Boston University\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://predators.nhl.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2909",
    "input_seq": "What's the postal code of Addis Ababa, African Union's headquarter?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"African Union\" . ?e_2 <pred:name> \"Addis Ababa\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_2910",
    "input_seq": "Is 698064 the WOEID of Split  (the one whose official name is Split)?",
    "target_seq": "ASK { ?e <pred:name> \"Split\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Split\" . ?e <WOEID> ?pv . ?pv <pred:value> \"698064\" .  }"
  },
  {
    "qid": "train_2911",
    "input_seq": "How is The Shield connected to the 54th Primetime Emmy Awards   ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Shield\" . ?e_2 <pred:name> \"54th Primetime Emmy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2912",
    "input_seq": "Is the birth city of Ken Russell represented by the website www.southampton.gov.uk ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Ken Russell\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.southampton.gov.uk\" .  }"
  },
  {
    "qid": "train_2913",
    "input_seq": "Does Wheaton or Henderon have the greater population?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wheaton\" .  } UNION { ?e <pred:name> \"Henderson\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2914",
    "input_seq": "How many crimes have locations in Serbia?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <location> ?e_1 . ?e_1 <pred:name> \"Serbia\" .   }"
  },
  {
    "qid": "train_2915",
    "input_seq": "Of Washington counties with over 3700 in population, which occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"3700\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2916",
    "input_seq": "What is its Index Herbariorum code for the higher education instuation whose DOI prefix is 10.21825?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <DOI_prefix> ?pv_1 . ?pv_1 <pred:value> \"10.21825\" . ?e <Index_Herbariorum_code> ?pv .  }"
  },
  {
    "qid": "train_2917",
    "input_seq": "Was the Simon Baker who took part in the 1984 Summer Olympics born pre-1966 ?",
    "target_seq": "ASK { ?e <pred:name> \"Simon Baker\" . ?e <participant_of> ?e_1 . ?e_1 <pred:name> \"1984 Summer Olympics\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1966 ) .  }"
  },
  {
    "qid": "train_2919",
    "input_seq": "What is the number of Academy Awards ceremonies that are edition number 13 or follow the 33rd Academy Awards?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" .  { ?e <edition_number> ?pv . ?pv <pred:value> \"13\" .  } UNION { ?e <follows> ?e_1 . ?e_1 <pred:name> \"33rd Academy Awards\" .  } }"
  },
  {
    "qid": "train_2920",
    "input_seq": "How is the SAG Award for Outstanding Performance by a Cast in a Motion Picture related to Dennis Quaid?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture\" . ?e_2 <pred:name> \"Dennis Quaid\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2921",
    "input_seq": "How The Mission, originated from United Kingdom is related to Society of Jesus?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Mission\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"United Kingdom\" . ?e_2 <pred:name> \"Society of Jesus\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2922",
    "input_seq": "Does Antigua and Barbuda or Croatia have greater PPP GDP per capita?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Antigua and Barbuda\" .  } UNION { ?e <pred:name> \"Croatia\" .  } ?e <PPP_GDP_per_capita> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2923",
    "input_seq": "How is Oliver! related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oliver!\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2924",
    "input_seq": "At what point in time did Livorno have a population of 159,431?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Livorno\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"159431\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2925",
    "input_seq": "Among the New York cities with an inception time before 1864, which one has the smallest population?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 < 1864 ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2926",
    "input_seq": "When did  Dehradun become the capital of Uttarakhand (the one whose population is 10086292)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dehradun\" . ?e_2 <pred:name> \"Uttarakhand\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10086292\"^^xsd:double . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2927",
    "input_seq": "Twin Peaks, which had its finale on 2017-09-03, was filmed in which US state?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e_1 <filming_location> ?e . ?e_1 <pred:name> \"Twin Peaks\" . ?e_1 <end_time> ?pv . ?pv <pred:date> \"2017-09-03\"^^xsd:date .   }"
  },
  {
    "qid": "train_2928",
    "input_seq": "When did the national association football team that belongs to People's Republic of China rank 61?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <country_for_sport> ?e_1 . ?e_1 <pred:name> \"People's Republic of China\" .  ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"61\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2929",
    "input_seq": "What is the character role of Melora Hardin in  The Office (the one that has Leslie David Baker as a cast member)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Office\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Leslie David Baker\" . ?e_2 <pred:name> \"Melora Hardin\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2930",
    "input_seq": "Who is the person whose ISNI is 0000 0001 1698 3396?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1698 3396\" .  }"
  },
  {
    "qid": "train_2931",
    "input_seq": "Was Adam Smith (the one that is a member of Peterborough United F.C.) not born in 1953?",
    "target_seq": "ASK { ?e <pred:name> \"Adam Smith\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Peterborough United F.C.\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1953 ) .  }"
  },
  {
    "qid": "train_2932",
    "input_seq": "How is the 193 cm Mark Johnson related to Massachusetts (the one that is an administrative division of United States of America)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mark Johnson\" . ?e_1 <height> ?pv . ?pv <pred:unit> \"centimetre\" . ?pv <pred:value> \"193\"^^xsd:double . ?e_2 <pred:name> \"Massachusetts\" . ?e_3 <contains_administrative_territorial_entity> ?e_2 . ?e_3 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2933",
    "input_seq": "Is 0000 0001 2096 0947 the ISNI of the band that won the MTV Video Music Award for Best Art Direction (the point in time of this statement is 2004)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"MTV Video Music Award for Best Art Direction\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 2004 . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2096 0947\" .  }"
  },
  {
    "qid": "train_2934",
    "input_seq": "Is the ISNI of Rajesh Khanna 0000 0001 3884 3749 ?",
    "target_seq": "ASK { ?e <pred:name> \"Rajesh Khanna\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 3884 3749\" .  }"
  },
  {
    "qid": "train_2935",
    "input_seq": "Even Cowgirls Get the Blues has what connection to the USA?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Even Cowgirls Get the Blues\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2936",
    "input_seq": "Is the elevation relative to sea level lower for Jammu and Kashmir or for Himachal Pradesh (male population 3481873)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jammu and Kashmir\" . } UNION { ?e <pred:name> \"Himachal Pradesh\" . ?e <male_population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3481873\"^^xsd:double . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2937",
    "input_seq": "What number of employees have jobs with a ROME Occupation Code (v3) of E1102 or a birth date later than 1934?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" .  { ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"E1102\" .  } UNION { ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1934 ) .  } }"
  },
  {
    "qid": "train_2938",
    "input_seq": "Who has more children, Lauren Holly or Arthur Rankin Jr.?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lauren Holly\" .  } UNION { ?e <pred:name> \"Arthur Rankin Jr.\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2939",
    "input_seq": "Where can I find photography for the The Chronicles of Narnia: Prince Caspian?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e_1 <followed_by> ?e . ?e_1 <pred:name> \"The Chronicles of Narnia: Prince Caspian\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"140\"^^xsd:double .   }"
  },
  {
    "qid": "train_2940",
    "input_seq": "Which has a greater duration, Earth (which has a duration of 115 minutes) or Atlantic City (which has Louis Malle as its director)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Earth\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"115\"^^xsd:double . } UNION { ?e <pred:name> \"Atlantic City\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Louis Malle\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2941",
    "input_seq": "How is Leo Bertos related to Chester City F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Leo Bertos\" . ?e_2 <pred:name> \"Chester City F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2942",
    "input_seq": "Patton Oswalt is the voice of which character on Ratatouille, a Critics' Choice nominee for Best Animated Feature?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ratatouille\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Critics' Choice Movie Award for Best Animated Feature\" . ?e_2 <pred:name> \"Patton Oswalt\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2943",
    "input_seq": "How many authors have the occupation of poet and a ROME Occupation Code (v3) of E1102?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"poet\" .  ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"E1102\" .  }"
  },
  {
    "qid": "train_2944",
    "input_seq": "How many ceremonial counties of England are in the United Kingdom or are a filming location of War Horse?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  } UNION { ?e_1 <filming_location> ?e . ?e_1 <pred:name> \"War Horse\" .  } }"
  },
  {
    "qid": "train_2945",
    "input_seq": "What language is associated with the official website http://www.co.berks.pa.us for the Pennsylvania county whose population is 411442 on the date 2010-04-01?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"411442\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2010-04-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.berks.pa.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2946",
    "input_seq": "What is the connection between Kathleen Turner to voice actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kathleen Turner\" . ?e_2 <pred:name> \"voice actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2947",
    "input_seq": "What is the language of http://www.sonypictures.com/movies/badteacher/, the official website of Bad Teacher visual artwork, consisting of 13 episodes?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"Bad Teacher\" . ?e_1 <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sonypictures.com/movies/badteacher/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2948",
    "input_seq": "What visual artwork with Helena Bonham Carter playing Les Amours de la reine Elisabeth received Satellite Awards 2010?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Satellite Awards 2010\" .  ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Helena Bonham Carter\" . [ <pred:fact_h> ?e ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv . ?qpv <pred:value> \"Les Amours de la reine Élisabeth\" .  }"
  },
  {
    "qid": "train_2949",
    "input_seq": "Is http://chriswood-lunarmusic.com the official website of Chris Wood (the one whose date of death is 1983-07-12)?",
    "target_seq": "ASK { ?e <pred:name> \"Chris Wood\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1983-07-12\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://chriswood-lunarmusic.com/\" .  }"
  },
  {
    "qid": "train_2950",
    "input_seq": "What is the association of A Mighty Wind with Ed Begley, Jr.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Mighty Wind\" . ?e_2 <pred:name> \"Ed Begley, Jr.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2951",
    "input_seq": "Does Mighty Morphin Power Rangers (that originates in the United States of America) or Star Trek (that includes the famous work Star Trek: The Original Series) have more episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mighty Morphin Power Rangers\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"Star Trek\" . ?e <notable_work> ?e_2 . ?e_2 <pred:name> \"Star Trek: The Original Series\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]