[
  {
    "qid": "train_574",
    "input_seq": "About Hugh Jackman, who has a Twitter username of RealHughJackman, what is the number of subscribers?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hugh Jackman\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"RealHughJackman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_575",
    "input_seq": "How many subscribe to the University of South Florida's Twitter account as USouthFlorida?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"University of South Florida\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"USouthFlorida\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_576",
    "input_seq": "How many fictional professions are in the belief system of Ray Manzarek?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fictional profession\" . ?e <religion> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"belief system\" . ?e_2 <religion> ?e_1 . ?e_2 <pred:name> \"Ray Manzarek\" .   }"
  },
  {
    "qid": "train_577",
    "input_seq": "What Abyssinia's date of dissolution?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Abyssinia\" . ?e <dissolved,_abolished_or_demolished> ?pv .  }"
  },
  {
    "qid": "train_578",
    "input_seq": "Tell me the association football club with the official website http://www.modenafc.net",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.modenafc.net\" .  }"
  },
  {
    "qid": "train_579",
    "input_seq": "What is the date of birth of Colin Wilson who belongs to United States of America?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Colin Wilson\" . ?e <country_for_sport> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_580",
    "input_seq": "How many census-designated places are located in a time zone of the Eastern Time Zone or have an area less than 650 hectares?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"census-designated place\" .  { ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Eastern Time Zone\" .  } UNION { ?e <area> ?pv . ?pv <pred:unit> \"hectare\" . ?pv <pred:value> ?v . FILTER ( ?v < \"650\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_581",
    "input_seq": "How many North Carolina counties have a population that is not 930000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of North Carolina\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"930000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_582",
    "input_seq": "How is the Mark Williams with the Twitter handle mark4ceredigion connected to Aberystwyth University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mark Williams\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"mark4ceredigion\" . ?e_2 <pred:name> \"Aberystwyth University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_583",
    "input_seq": "How many art schools are designated by ISNI 0000 0004 0459 2461 or are in India, release region of Extremely Loud and Incredibly Close?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art school\" .  { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0459 2461\" .  } UNION { ?e <country> ?e_1 . ?e_1 <pred:name> \"India\" . ?e_2 <film_release_region> ?e_1 . ?e_2 <pred:name> \"Extremely Loud and Incredibly Close\" .  } }"
  },
  {
    "qid": "train_584",
    "input_seq": "When did a city, whose postal code is 1402 report the population of 1,863,881 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"1402\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1863881\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_585",
    "input_seq": "What television series with Grey DeLisle as a voice actor (the character role of this statement is Azula) received the Peabody Award?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Grey DeLisle\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_1 ] <character_role> ?qpv . ?qpv <pred:value> \"Azula\" . ?e <award_received> ?e_2 . ?e_2 <pred:name> \"Peabody Award\" .  }"
  },
  {
    "qid": "train_586",
    "input_seq": "Does Birmingham, occupying 12.441939 square km, or Reno, in Washoe County, have the lower elevation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Birmingham\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"12.441939\"^^xsd:double . } UNION { ?e <pred:name> \"Reno\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Washoe County\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_587",
    "input_seq": "Which movie is longer, 3:10 to Yuma (the one whose release region is United States of America) or Antichrist?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"3:10 to Yuma\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"Antichrist\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_588",
    "input_seq": "Is the PermID of Dover (the one whose postal code is 19901–19906) equal to 5035896864?",
    "target_seq": "ASK { ?e <pred:name> \"Dover\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"19901–19906\" . ?e <PermID> ?pv . ?pv <pred:value> \"5035896864\" .  }"
  },
  {
    "qid": "train_589",
    "input_seq": "How is Worcester County related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Worcester County\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_590",
    "input_seq": "What is the connection between New Bedford to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Bedford\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_591",
    "input_seq": "Was the inception time of an association football club, that counts Israel (Spanish citizen) as a member since 1st January 2011, in a year other than 667 B.C. ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Israel\" . ?e_1 <country_of_citizenship> ?e_2 . ?e_2 <pred:name> \"Spain\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != -667 ) .  }"
  },
  {
    "qid": "train_592",
    "input_seq": "Are there less people living in Bloomington located in Hennepin County or in Franklin?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bloomington\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Hennepin County\" .   } UNION { ?e <pred:name> \"Franklin\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_593",
    "input_seq": "Which area is smaller, Cattaraugus County or Onondaga County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cattaraugus County\" .  } UNION { ?e <pred:name> \"Onondaga County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_594",
    "input_seq": "How many academic degrees were given to Charles Darwin (the one that influenced Friedrich Nietzsche) or received by John Hughes (the one that received Doctor of Philosophy) ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic degree\" .  { ?e_1 <academic_degree> ?e . ?e_1 <pred:name> \"Charles Darwin\" . ?e_2 <influenced_by> ?e_1 . ?e_2 <pred:name> \"Friedrich Nietzsche\" .  } UNION { ?e_1 <award_received> ?e . ?e_1 <pred:name> \"John Hughes\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"Doctor of Philosophy\" .  } }"
  },
  {
    "qid": "train_595",
    "input_seq": "Is http://www.landkreishildesheim.de the official website of the association football club headquartered in Duisburg?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Duisburg\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.landkreishildesheim.de\" .  }"
  },
  {
    "qid": "train_596",
    "input_seq": "The employee at the University of Copenhagen has been nominated for what number of science awards?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <employer> ?e_2 . ?e_2 <pred:name> \"University of Copenhagen\" .   }"
  },
  {
    "qid": "train_597",
    "input_seq": "Where is the visual artwork published which has an official website at http://www.300ondvd.com/ and a publication date of 2007-04-04?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.300ondvd.com/\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-04-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_598",
    "input_seq": "What is the official website of the US state which contains the administrative division Washington County (the one whose population is 22247),?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Washington County\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"22247\"^^xsd:double . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_599",
    "input_seq": "What republic has the demonym Lindänan?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <demonym> ?pv . ?pv <pred:value> \"Lindänan\" .  }"
  },
  {
    "qid": "train_600",
    "input_seq": "Was Jesus of Nazareth published on 1962-12-26?",
    "target_seq": "ASK { ?e <pred:name> \"Jesus of Nazareth\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1962-12-26\"^^xsd:date .  }"
  },
  {
    "qid": "train_601",
    "input_seq": "is the date of birth of human whose offical website is http://walshfreedom.com after 1979?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://walshfreedom.com/\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1979 ) .  }"
  },
  {
    "qid": "train_602",
    "input_seq": "Tell me the one with the bigger box office, Fish Tank or Ghost.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fish Tank\" .  } UNION { ?e <pred:name> \"Ghost\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_603",
    "input_seq": "What is the release region of the visual artwork that mainly portrays C. S. Lewis and has the publication date 1994-04-07?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"C. S. Lewis\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1994-04-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_604",
    "input_seq": "What was Kerry Washington's role in Fantastic Four (the one that is distributed at United Kingdom)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Fantastic Four\" . ?e_1 <film_distribute_region> ?e_3 . ?e_3 <pred:name> \"United Kingdom\" . ?e_2 <pred:name> \"Kerry Washington\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_605",
    "input_seq": "What are the number of miniseries whose release region is the form of government that has a citizen Dante Spinotti ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"form of government\" . ?e_2 <country_of_citizenship> ?e_1 . ?e_2 <pred:name> \"Dante Spinotti\" .   }"
  },
  {
    "qid": "train_606",
    "input_seq": "Does Ridgewood have more than -10 metre elevation above sea level?",
    "target_seq": "ASK { ?e <pred:name> \"Ridgewood\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"-10\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_607",
    "input_seq": "What is the relationship between Mohanlal and Hindi?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mohanlal\" . ?e_2 <pred:name> \"Hindi\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_608",
    "input_seq": "Which has the smallest area among independent cities?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_609",
    "input_seq": "What is the episode count of the TV series with the website www.cbs.com/shows/training-day?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cbs.com/shows/training-day/\" . ?e <number_of_episodes> ?pv .  }"
  },
  {
    "qid": "train_610",
    "input_seq": "What is the beginning date of the association football club whose official website is http://www.clubolimpia.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.clubolimpia.com/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_611",
    "input_seq": "Which movie is shorter, Carrie (the one that has Julianne Moore as a cast member) or The Weather Man?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Carrie\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Julianne Moore\" .   } UNION { ?e <pred:name> \"The Weather Man\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_612",
    "input_seq": "How many alternative rock forms were established earlier than 1990?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"alternative rock\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1990 ) .  }"
  },
  {
    "qid": "train_613",
    "input_seq": "What is the connection between The Amazing Spider-Man (the one that is developed by Rare Ltd.) to New York City?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Amazing Spider-Man\" . ?e_1 <developer> ?e_3 . ?e_3 <pred:name> \"Rare Ltd.\" . ?e_2 <pred:name> \"New York City\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_614",
    "input_seq": "What is the connection between Being John Malkovich to Michael Stipe?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Being John Malkovich\" . ?e_2 <pred:name> \"Michael Stipe\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_615",
    "input_seq": "What is the connection between Rush (whose narrative location is the Netherlands) and the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rush\" . ?e_1 <narrative_location> ?e_3 . ?e_3 <pred:name> \"Netherlands\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_616",
    "input_seq": "What is the start time of Hewlett-Packard had IPv4 routing prefix 204.104.0.0/15?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hewlett-Packard\" . ?e <IPv4_routing_prefix> ?pv . ?pv <pred:value> \"204.104.0.0/15\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4_routing_prefix> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_617",
    "input_seq": "How many softwares either have an official website at http://www.apple.com/at/ios/ or has a Windows Vista edition?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"https://www.apple.com/at/ios/\" .  } UNION { ?e_1 <edition_or_translation_of> ?e . ?e_1 <pred:name> \"Windows Vista\" .  } }"
  },
  {
    "qid": "train_618",
    "input_seq": "For Fairfield County where Jessica Tandy died, and which has a population of 933733, tell me the determination method of this value.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Fairfield County\" . ?e_1 <place_of_death> ?e . ?e_1 <pred:name> \"Jessica Tandy\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"933733\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_619",
    "input_seq": "What does Legally BLonde have in common with Selma Blair?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Legally Blonde\" . ?e_2 <pred:name> \"Selma Blair\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_620",
    "input_seq": "Regarding the animated feature film that is entitled Ratatouille and was published on 2007-06-29 where did it get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Ratatouille\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-06-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_621",
    "input_seq": "What is the longest 3D film that was released in Lithuania?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"3D film\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Lithuania\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_622",
    "input_seq": "When was Douglas Fairbanks' marital partnership with Mary Pickford over?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Douglas Fairbanks\" . ?e_2 <pred:name> \"Mary Pickford\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_623",
    "input_seq": "How many Italian regions are located on a terrain feature called Ireland (the one whose ITU letter code is IRL) and have http://www.regione.toscana.it/ as their official website?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of Italy\" . ?e <located_on_terrain_feature> ?e_1 . ?e_1 <pred:name> \"Ireland\" . ?e_1 <ITU_letter_code> ?pv . ?pv <pred:value> \"IRL\" .  ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.regione.toscana.it/\" .  }"
  },
  {
    "qid": "train_624",
    "input_seq": "Does the Ohio county whose FIPS 6-4 (US counties) is 39153, have a population of less than 14000 (the point in time of this statement is 2010-07-01)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ohio\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"39153\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"14000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_625",
    "input_seq": "How many songs do not have a beats per minute rate of 90 or were not published in 1991?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" .  { ?e <beats_per_minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"90\"^^xsd:double ) .  } UNION { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1991 ) .  } }"
  },
  {
    "qid": "train_626",
    "input_seq": "Where was the Wonder Woman that features Robin Wright and was published June 15th, 2017 published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Wonder Woman\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Robin Wright\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2017-06-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_627",
    "input_seq": "Is ISBN-10 of a written work, whose title is I, Robot, equal to 84-350-3482-8 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"I, Robot\" . ?e <ISBN-10> ?pv . ?pv <pred:value> \"84-350-3482-8\" .  }"
  },
  {
    "qid": "train_628",
    "input_seq": "Was the release year not 2008 for Terminator Salvation, affiliated with the website www.terminatorsalvationthegame.com ?",
    "target_seq": "ASK { ?e <pred:name> \"Terminator Salvation\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.terminatorsalvationthegame.com\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2008 ) .  }"
  },
  {
    "qid": "train_629",
    "input_seq": "Who weighs more, β-carotene or L-Leucine?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"β-carotene\" .  } UNION { ?e <pred:name> \"L-Leucine\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_630",
    "input_seq": "What is the number of geographic territories that have under 36000 out-of-school children or partially contain Armenia?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" .  { ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"36000\"^^xsd:double ) .  } UNION { ?e <partially_contains> ?e_1 . ?e_1 <pred:name> \"Armenia\" .  } }"
  },
  {
    "qid": "train_631",
    "input_seq": "Which person is identified by ISNI numeric code 0000 0000 6302 4991?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 6302 4991\" .  }"
  },
  {
    "qid": "train_632",
    "input_seq": "What is the connection between Dermot Mulroney to film producer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dermot Mulroney\" . ?e_2 <pred:name> \"film producer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_633",
    "input_seq": "In what country is Rome (where died Michelangelo in 1564-02-18 and that has a population of 273952)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Michelangelo\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"1564-02-18\"^^xsd:date . ?e_2 <pred:name> \"Rome\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"273952\"^^xsd:double . ?e_1 <place_of_death> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_death> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_634",
    "input_seq": "How much is the running time of the film whose official website is http://www.longestyard.com/longestyard.php/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.longestyard.com/longestyard.php/\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_635",
    "input_seq": "How many soundtrack albums have been released before 2007 or that uses the language English?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack album\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2007 ) .  } UNION { ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" .  } }"
  },
  {
    "qid": "train_636",
    "input_seq": "What is the official website of the United States city with the postal code 44900–44999?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"44900–44999\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_637",
    "input_seq": "When did Bill Clinton get the medical condition angina pectoris?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bill Clinton\" . ?e_2 <pred:name> \"angina pectoris\" . ?e_1 <medical_condition> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <medical_condition> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_638",
    "input_seq": "How many visual artworks are titled J. Edgar and take place in DC Universe ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"J. Edgar\" . ?e <takes_place_in_fictional_universe> ?e_1 . ?e_1 <pred:name> \"DC Universe\" .  }"
  },
  {
    "qid": "train_639",
    "input_seq": "Does Serpico (the one whose release region is Spain) have a duration not equal to 550 minutes?",
    "target_seq": "ASK { ?e <pred:name> \"Serpico\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Spain\" .  ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"550\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_640",
    "input_seq": "How many forms of pop music do not trace back to 1920?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pop music\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1920 ) .  }"
  },
  {
    "qid": "train_641",
    "input_seq": "How is Galway to related to Ireland, where Sherlock Holmes: A Game of Shadows was released?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Galway\" . ?e_2 <pred:name> \"Ireland\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"Sherlock Holmes: A Game of Shadows\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_642",
    "input_seq": "Which movie is longer, The Gift (the one that has Keanu Reeves as a cast member) or Manhattan (the one that was nominated for National Society of Film Critics Award for Best Film)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Gift\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Keanu Reeves\" .   } UNION { ?e <pred:name> \"Manhattan\" . ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"National Society of Film Critics Award for Best Film\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_643",
    "input_seq": "What is the connection between Atonement (the one that was nominated for Golden Globe Award for Best Screenplay) to drama film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Atonement\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Golden Globe Award for Best Screenplay\" . ?e_2 <pred:name> \"drama film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_644",
    "input_seq": "What is the OCLC control number of the literary work whose narrative location is the Appalachian Mountains?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Appalachian Mountains\" .  ?e <OCLC_control_number> ?pv .  }"
  },
  {
    "qid": "train_645",
    "input_seq": "How many public educational institutions of the United States are in the USA or use http://www.westpoint.edu/  as the official website ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public educational institution of the United States\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.westpoint.edu/\" .  } }"
  },
  {
    "qid": "train_646",
    "input_seq": "Is the area of a government, whose subreddit is dubai (English language), over 50,000 square km ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"dubai\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"50000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_647",
    "input_seq": "What is the connection between Vittorio De Sica to Golden Bear?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vittorio De Sica\" . ?e_2 <pred:name> \"Golden Bear\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_648",
    "input_seq": "Does Pompano Beach or Lewiston has greater population ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pompano Beach\" .  } UNION { ?e <pred:name> \"Lewiston\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_649",
    "input_seq": "Does Kensington of the Kingdom of Great Britain have an OS grid reference of SE5702?",
    "target_seq": "ASK { ?e <pred:name> \"Kensington\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Kingdom of Great Britain\" .  ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"SE5702\" .  }"
  },
  {
    "qid": "train_650",
    "input_seq": "What character did William Petersen play in CSI: Crime Scene Investigation?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"CSI: Crime Scene Investigation\" . ?e_2 <pred:name> \"William Petersen\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_651",
    "input_seq": "Lexington, Dnipro's twinned administrative body, is the place of death of which person?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_death> ?e_1 . ?e_1 <pred:name> \"Lexington\" . ?e_2 <twinned_administrative_body> ?e_1 . ?e_2 <pred:name> \"Dnipro\" .   }"
  },
  {
    "qid": "train_652",
    "input_seq": "How is Annette Bening related to actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Annette Bening\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  }
]