[
  {
    "qid": "train_2213",
    "input_seq": "At what point in time did the u.s. city whose postal code is 76000–76099 have a population of 365438?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"76000–76099\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"365438\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2214",
    "input_seq": "What is Gillian Anderson's native language name?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gillian Anderson\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_2215",
    "input_seq": "Does the native name अमिताभ बच्चन match to the person assigned ISNI code 0000 0001 0936 8571?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0936 8571\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"अमिताभ बच्चन\" .  }"
  },
  {
    "qid": "train_2216",
    "input_seq": "When did St. Louis and Stuttgart enter into an agreement for a twinned administrative body?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"St. Louis\" . ?e_2 <pred:name> \"Stuttgart\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2217",
    "input_seq": "What is the connection between I Love You, Man to Rashida Jones?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"I Love You, Man\" . ?e_2 <pred:name> \"Rashida Jones\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2218",
    "input_seq": "Was the movie titled February published prior to 2009 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"February\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2009 ) .  }"
  },
  {
    "qid": "train_2219",
    "input_seq": "Does Cleveland or Colorado Springs have the lower elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cleveland\" .  } UNION { ?e <pred:name> \"Colorado Springs\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2220",
    "input_seq": "Which has a greater market capitalization, Microsoft (whose PermID is 4295907168) or Walmart?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Microsoft\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"4295907168\" . } UNION { ?e <pred:name> \"Walmart\" . } ?e <market_capitalization> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2222",
    "input_seq": "Who is the person born before 1979 and who has won a BAFTA Award for Best Film Music in 2003?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1979 ) . ?e_1 <winner> ?e . ?e_1 <pred:name> \"BAFTA Award for Best Film Music\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 2003 .  }"
  },
  {
    "qid": "train_2223",
    "input_seq": "What is the connection between Howie Mandel to actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Howie Mandel\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2224",
    "input_seq": "What part of Myanmar has the demonym of birmana?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Myanmar\" . ?e <demonym> ?pv . ?pv <pred:value> \"birmana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_2225",
    "input_seq": "Michael Hordern was cast as what character on Cleopatra, which had a Japan release?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cleopatra\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Japan\" . ?e_2 <pred:name> \"Michael Hordern\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2226",
    "input_seq": "How many colors' short name is W, and are the origin of St. Louis Cardinals name?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" . ?e <short_name> ?pv . ?pv <pred:value> \"W\" . ?e_1 <named_after> ?e . ?e_1 <pred:name> \"St. Louis Cardinals\" .  }"
  },
  {
    "qid": "train_2227",
    "input_seq": "Atlanta, where leukemia victim Scott Wilson was born and which has a 770 dialing code, belongs to which nation?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Scott Wilson\" . ?e_1 <cause_of_death> ?e_3 . ?e_3 <pred:name> \"leukemia\" . ?e_2 <pred:name> \"Atlanta\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"770\" . ?e_1 <place_of_birth> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_birth> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_2228",
    "input_seq": "Who is the person with Instagram username katieholmes212 and was married to Tom Cruise until 2012?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"katieholmes212\" . ?e <spouse> ?e_1 . ?e_1 <pred:name> \"Tom Cruise\" . [ <pred:fact_h> ?e ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_1 ] <end_time> ?qpv . ?qpv <pred:year> 2012 .  }"
  },
  {
    "qid": "train_2229",
    "input_seq": "Who plays defender and was born in Reading whose WOEID is 32997?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <position_played_on_team_/_speciality> ?e_1 . ?e_1 <pred:name> \"defender\" .  ?e <place_of_birth> ?e_2 . ?e_2 <pred:name> \"Reading\" . ?e_2 <WOEID> ?pv . ?pv <pred:value> \"32997\" .  }"
  },
  {
    "qid": "train_2230",
    "input_seq": "What number of US towns have the pronunciation audioFramingham.ogg?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Framingham.ogg\" .  }"
  },
  {
    "qid": "train_2231",
    "input_seq": "The visual artwork featuring the voice of Sean Hayes was publicly released in what region on 2004-04-08?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Sean Hayes\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2004-04-08\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2232",
    "input_seq": "Which person's ISNI is 0000 0001 1603 2451?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1603 2451\" .  }"
  },
  {
    "qid": "train_2233",
    "input_seq": "Between Star Wars: The Clone Wars with the voice of Christopher Lee or The Blind Side, which is longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Wars: The Clone Wars\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Christopher Lee\" .   } UNION { ?e <pred:name> \"The Blind Side\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2234",
    "input_seq": "How many groups of organisms have one specific common name that is pronounced Ta-பசு.ogg or have the taxon common name Goat?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group of organisms known by one particular common name\" .  { ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Ta-பசு.ogg\" .  } UNION { ?e <taxon_common_name> ?pv . ?pv <pred:value> \"Goat\" .  } }"
  },
  {
    "qid": "train_2235",
    "input_seq": "Which language is associated with http://www.umaine.edu/, the official website of the land-grant university whose NRHP reference number is 10000228?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" . ?e <NRHP_reference_number> ?pv_1 . ?pv_1 <pred:value> \"10000228\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.umaine.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2236",
    "input_seq": "Was John Mills, who is in the Continental Army, born before 1948?",
    "target_seq": "ASK { ?e <pred:name> \"John Mills\" . ?e <military_branch> ?e_1 . ?e_1 <pred:name> \"Continental Army\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1948 ) .  }"
  },
  {
    "qid": "train_2237",
    "input_seq": "How many TV series did not launch in 2004 or do go by username communitytv on Instagram?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" .  { ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2004 ) .  } UNION { ?e <Instagram_username> ?pv . ?pv <pred:value> \"communitytv\" .  } }"
  },
  {
    "qid": "train_2238",
    "input_seq": "What is the nickname of the association football club officially named Newcastle United Football Club?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Newcastle United Football Club\" . ?e <nickname> ?pv .  }"
  },
  {
    "qid": "train_2239",
    "input_seq": "How is Anne of the Thousand Days related to West Germany?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Anne of the Thousand Days\" . ?e_2 <pred:name> \"West Germany\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2240",
    "input_seq": "How many electronic dance music origins from India which has a diplomatic relation with Paraguay or that origins from the Netherlands?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"electronic dance music\" .  { ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"India\" . ?e_2 <diplomatic_relation> ?e_1 . ?e_2 <pred:name> \"Paraguay\" .  } UNION { ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Netherlands\" .  } }"
  },
  {
    "qid": "train_2241",
    "input_seq": "Which one is longer, Brotherhood of the Wolf or The Sand Pebbles ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brotherhood of the Wolf\" .  } UNION { ?e <pred:name> \"The Sand Pebbles\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2242",
    "input_seq": "How is the 61st Primetime Emmy winner Grey Gardens related to HBO?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grey Gardens\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"61st Primetime Emmy Awards\" . ?e_2 <pred:name> \"HBO\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2243",
    "input_seq": "How many states of Germany are where the person known by the pseudonym of Franz Walsch live?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e_1 <residence> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <pseudonym> ?pv . ?pv <pred:value> \"Franz Walsch\" .   }"
  },
  {
    "qid": "train_2244",
    "input_seq": "How is the screenwriter of Prometheus designated by CANTIC-ID?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"Prometheus\" .  ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_2245",
    "input_seq": "What ISNI belongs to the individual who is Jeremy Piven's sibling?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <sibling> ?e_1 . ?e_1 <pred:name> \"Jeremy Piven\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2246",
    "input_seq": "Does reality TV's The Challenge or does Cranford have more seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Challenge\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"reality television\" .   } UNION { ?e <pred:name> \"Cranford\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2247",
    "input_seq": "Which movie character was born on 1960-10-29?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film character\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1960-10-29\"^^xsd:date .  }"
  },
  {
    "qid": "train_2248",
    "input_seq": "Which has a lesser duration, Om Shanti Om or Fame (whose publication date is 2009-10-09)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Om Shanti Om\" . } UNION { ?e <pred:name> \"Fame\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-10-09\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2249",
    "input_seq": "Is kana the name of the person with Instagram username wongyiuminganthony ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"wongyiuminganthony\" . ?e <name_in_kana> ?pv .  }"
  },
  {
    "qid": "train_2250",
    "input_seq": "Tell me the one that is shorter in duration, Gattaca or Mr. Deeds.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mr. Deeds\" .  } UNION { ?e <pred:name> \"Gattaca\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2251",
    "input_seq": "How many reggae acts have the inception time of 1985 and not 1970?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1970 ) . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1985 .  }"
  },
  {
    "qid": "train_2252",
    "input_seq": "Whic film has the lower attendance, Iron Man 3 or Titanic (that was nominated for a Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Iron Man 3\" .  } UNION { ?e <pred:name> \"Titanic\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role\" .   } ?e <attendance> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2253",
    "input_seq": "When did the US city whose postal code is 91766_91768 have a population of 149058?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7839 7088\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1972 ) .  }"
  },
  {
    "qid": "train_2254",
    "input_seq": "How many political ideologies are classified by the Library of Congress as HX833 and have the subreddit of Feminisme?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political ideology\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"HX833\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Feminisme\" .  }"
  },
  {
    "qid": "train_2255",
    "input_seq": "Of all the chemical compounds with a pKa less than 20, which has the largest mass?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <pKa> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"20\"^^xsd:double ) . ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2256",
    "input_seq": "What is the tie-in between The City of Lost Children and Poland?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The City of Lost Children\" . ?e_2 <pred:name> \"Poland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2257",
    "input_seq": "How many guitars have a Hornbostel-Sachs classification of 321.322 or are the instrument of Billy Ray Cyrus?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" .  { ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322\" .  } UNION { ?e_1 <instrument> ?e . ?e_1 <pred:name> \"Billy Ray Cyrus\" .  } }"
  },
  {
    "qid": "train_2258",
    "input_seq": "How many United States cities have a postal code of 90058 or are located in the United States of America?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" .  { ?e <postal_code> ?pv . ?pv <pred:value> \"90058\" .  } UNION { ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } }"
  },
  {
    "qid": "train_2259",
    "input_seq": "Which movie is longer, L.A. Confidential or Mars Attacks!?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"L.A. Confidential\" .  } UNION { ?e <pred:name> \"Mars Attacks!\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2260",
    "input_seq": "For the person whose Twitter username is aliciakeys (the subscription number of this statement is 30994262), how many animated series have her as an executive producer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <executive_producer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"aliciakeys\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"30994262\"^^xsd:double .   }"
  },
  {
    "qid": "train_2261",
    "input_seq": "What is the ISNI of the person nominated for the Academy Award for Best Supporting Actress for their work in Mudbound?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actress\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Mudbound\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2262",
    "input_seq": "Which first-level administrative country subdivision that shares a border with Carinthia has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Carinthia\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2263",
    "input_seq": "What big city has the official name of Екацярынаслаў?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <official_name> ?pv . ?pv <pred:value> \"Екацярынаслаў\" .  }"
  },
  {
    "qid": "train_2264",
    "input_seq": "The 1986 Primetime Emmy winning individual for Outstanding Lead Actress in a Comedy Series also earned how many SAG awards?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Screen Actors Guild Award\" . ?e <winner> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv . ?qpv <pred:year> 1986 .   }"
  },
  {
    "qid": "train_2265",
    "input_seq": "What number of geographic regions was Paul Frees born?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e_1 <place_of_burial> ?e . ?e_1 <pred:name> \"Paul Frees\" .   }"
  },
  {
    "qid": "train_2266",
    "input_seq": "How many electronic music renditions are there whose famous person has the official website is http://mobyandthevoidpacificchoir.com?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"electronic music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://mobyandthevoidpacificchoir.com\" .   }"
  },
  {
    "qid": "train_2267",
    "input_seq": "How many people are identified by CANTIC-ID a11695997 or are known for contemporary folk music?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" .  { ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11695997\" .  } UNION { ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"contemporary folk music\" .  } }"
  },
  {
    "qid": "train_2268",
    "input_seq": "How many different rock bands are associated with the ISNI number 0000 0001 1523 0122?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1523 0122\" .  }"
  },
  {
    "qid": "train_2269",
    "input_seq": "Which movie cost less to make, The Shining (the one whose publication date is 1980-10-16) or Four Rooms?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Shining\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1980-10-16\"^^xsd:date . } UNION { ?e <pred:name> \"Four Rooms\" . } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2270",
    "input_seq": "Which place has more weddings, Somme or Dordogne?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Somme\" .  } UNION { ?e <pred:name> \"Dordogne\" .  } ?e <annual_number_of_weddings> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2271",
    "input_seq": "Is Sherlock Holmes: A Game of Shadows or Full Metal Jacket shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sherlock Holmes: A Game of Shadows\" .  } UNION { ?e <pred:name> \"Full Metal Jacket\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2272",
    "input_seq": "Which province of China has the official website of http://www.yn.gov.cn and has the ISO 3166-2 code of CN-YN (the start time of this statement is 2017-11-23)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.yn.gov.cn\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"CN-YN\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:date> \"2017-11-23\"^^xsd:date .  }"
  },
  {
    "qid": "train_2273",
    "input_seq": "What disease's incidence is more than 2.8 cases per 100000 person-years (the location of this statement is Earth) and DiseasesDB identifier is 9510?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <incidence> ?pv . ?pv <pred:unit> \"cases per 100000 person-years\" . ?pv <pred:value> ?v . FILTER ( ?v > \"2.8\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <incidence> ; <pred:fact_t> ?pv ] <location> ?qpv . ?qpv <pred:value> \"Earth\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"9510\" .  }"
  },
  {
    "qid": "train_2274",
    "input_seq": "How is Halloween starring Daniel Roebuck related to Danny Trejo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Halloween\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Daniel Roebuck\" . ?e_2 <pred:name> \"Danny Trejo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2275",
    "input_seq": "Does Tim Armstrong (who is a member of the Toronto Maple Leafs) or Ben Johnson (whose date of birth is 1980-04-07) weigh more?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tim Armstrong\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Toronto Maple Leafs\" . } UNION { ?e <pred:name> \"Ben Johnson\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1980-04-07\"^^xsd:date . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2276",
    "input_seq": "Which cemetry is in New Haven?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"New Haven\" .   }"
  },
  {
    "qid": "train_2277",
    "input_seq": "What is the connection between Marley and Sweden?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Marley\" . ?e_2 <pred:name> \"Sweden\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2278",
    "input_seq": "What is the connection between Joan Allen to Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Joan Allen\" . ?e_2 <pred:name> \"Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2279",
    "input_seq": "What is the Twitter username for the person with an ISNI of 0000 0003 8429 8379?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0003 8429 8379\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_2280",
    "input_seq": "What person wins the Nebula Award for Best Novel involving the award-winning work A Time of Changes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Nebula Award for Best Novel\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"A Time of Changes\" .  }"
  },
  {
    "qid": "train_2281",
    "input_seq": "Which person's Twitter username is juanmata8, and Instagram username is juanmatagarcia?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"juanmata8\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"juanmatagarcia\" .  }"
  },
  {
    "qid": "train_2282",
    "input_seq": "What is the dedicated website of the association football club where Boaz Myhill belonged until 2012?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Boaz Myhill\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <end_time> ?qpv . ?qpv <pred:year> 2012 . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2283",
    "input_seq": "Which movie is shorter, ParaNorman or Frankenweenie (the one whose box office is 81491068 United States dollar)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"ParaNorman\" . } UNION { ?e <pred:name> \"Frankenweenie\" . ?e <box_office> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"81491068\"^^xsd:double . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2284",
    "input_seq": "How is Graz related to the UNESCO World Heritage Site?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Graz\" . ?e_2 <pred:name> \"UNESCO World Heritage Site\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2285",
    "input_seq": "Is the official website of the person with ISNI 0000 0001 1445 0107 the same as http://www.nickcannon.com?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1445 0107\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nickcannon.com\" .  }"
  },
  {
    "qid": "train_2286",
    "input_seq": "Of New York counties with under 16000000 inhabitants, which occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"16000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2287",
    "input_seq": "How is Tony Thomas of Tranmere Rovers F.C. linked to Everton F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tony Thomas\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Tranmere Rovers F.C.\" . ?e_2 <pred:name> \"Everton F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2288",
    "input_seq": "Which television series has 13367 episodes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13367\"^^xsd:double .  }"
  },
  {
    "qid": "train_2289",
    "input_seq": "Is the official website of the movie titled Charlie Wilson's War http://www.charliewilsonswar.net/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Charlie Wilson's War\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.charliewilsonswar.net/\" .  }"
  },
  {
    "qid": "train_2290",
    "input_seq": "Of video game console models with under 300000000 units sold, which sold the most?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <units_sold> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"300000000\"^^xsd:double ) . ?e <units_sold> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2291",
    "input_seq": "Which of the departments of France whose number of weddings is more than 490 annually has the largest land area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"departments of France\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"490\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2292",
    "input_seq": "Regarding the visual art work that got the Academy Award for best costume design (this statement subject is 84th Academy Awards), and publication date is 2011-10-12, where did he get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Costume Design\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"84th Academy Awards\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-10-12\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  }
]