[
  {
    "qid": "train_4847",
    "input_seq": "What is the television series that stars Gillian Anderson and whose Twitter username is TheFallTV which has 79112 subscribers?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Gillian Anderson\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"TheFallTV\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"79112\"^^xsd:double .  }"
  },
  {
    "qid": "train_4848",
    "input_seq": "When did the army located in Berlin disband?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <location> ?e_1 . ?e_1 <pred:name> \"Berlin\" .  ?e <end_time> ?pv .  }"
  },
  {
    "qid": "train_4849",
    "input_seq": "How is Nico related to Beggars Banquet Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nico\" . ?e_2 <pred:name> \"Beggars Banquet Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4850",
    "input_seq": "How many organizations have the official name Nintendo Co., Ltd. or are owned by Sony?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" .  { ?e <official_name> ?pv . ?pv <pred:value> \"Nintendo Co., Ltd.\" .  } UNION { ?e <owned_by> ?e_1 . ?e_1 <pred:name> \"Sony\" .  } }"
  },
  {
    "qid": "train_4851",
    "input_seq": "Is 1933 the birth date of the individual whose website is http://www.matthewlillard.com/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.matthewlillard.com/\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1933 ) .  }"
  },
  {
    "qid": "train_4852",
    "input_seq": "At what point in time did the population of New castle county reach 546,140?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"New Castle County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"546140\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4853",
    "input_seq": "Which one, University of Texas at Arlington or Leiden University, has the greater number of employees?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Texas at Arlington\" .  } UNION { ?e <pred:name> \"Leiden University\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4854",
    "input_seq": "Is the area less for Fairfield County (the one whose population is 919365) or Salt Lake County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fairfield County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"919365\"^^xsd:double . } UNION { ?e <pred:name> \"Salt Lake County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4855",
    "input_seq": "What is the connection between Mary Shelley (the one whose date of birth is 1797-08-30) to Frankenstein (the one whose inception time is 1815)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mary Shelley\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1797-08-30\"^^xsd:date . ?e_2 <pred:name> \"Frankenstein\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:year> 1815 . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4856",
    "input_seq": "What is the sovereign state with a diplomatic relation with Mexico (the subject of this statement is Honduras–Mexico relations) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <diplomatic_relation> ?e . ?e_1 <pred:name> \"Mexico\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Honduras–Mexico relations\" .  }"
  },
  {
    "qid": "train_4857",
    "input_seq": "When did  Steve Earle (the one that is related to sport association football) become a member of Peterborough United F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Steve Earle\" . ?e_1 <sport> ?e_3 . ?e_3 <pred:name> \"association football\" . ?e_2 <pred:name> \"Peterborough United F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4858",
    "input_seq": "Which area is smaller, Sandoval County or Jefferson County (the one that has the capital Louisville)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sandoval County\" .  } UNION { ?e <pred:name> \"Jefferson County\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Louisville\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4859",
    "input_seq": "What is Vince Gill's connection to Universal Music Group Nashville?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vince Gill\" . ?e_2 <pred:name> \"Universal Music Group Nashville\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4860",
    "input_seq": "Which one's area is smaller,  Putnam County (the one whose FIPS 6-4 (US counties) is 36079)' s or Broome County's ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Broome County\" . } UNION { ?e <pred:name> \"Putnam County\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"36079\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4861",
    "input_seq": "When did the republic with the native label دولة إرتري have a population totaling 3407812?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"دولة إرتري\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3407812\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4862",
    "input_seq": "Tell me the relationship between screenwriter and Louis C.K.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Louis C.K.\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4863",
    "input_seq": "How many scientists are the main subject of a visual artwork narrated by Levon Helm?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e_1 <main_subject> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"visual artwork\" . ?e_1 <narrator> ?e_3 . ?e_3 <pred:name> \"Levon Helm\" .   }"
  },
  {
    "qid": "train_4864",
    "input_seq": "Does the census-designated place whose postal code is 20824 have an area of less than 900000 square kilometers?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"census-designated place\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"20824\" . ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"900000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4865",
    "input_seq": "Which CANTIC-ID corresponds to the person who won a Golden Globe for Best Foreign Language Film?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Golden Globe Award for Best Foreign Language Film\" .  ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_4866",
    "input_seq": "How many styles of architecture ended prior to 1713 or began prior to 1666?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"architectural style\" .  { ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1713 ) .  } UNION { ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1666 ) .  } }"
  },
  {
    "qid": "train_4867",
    "input_seq": "Which has the smallest mains voltage among the states whose total fertility rate is less than 2.5?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <total_fertility_rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"2.5\"^^xsd:double ) . ?e <mains_voltage> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4868",
    "input_seq": "What is the relationship between Serpico (the one whose genre is film based on literature) to action film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Serpico\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"film based on literature\" . ?e_2 <pred:name> \"action film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4869",
    "input_seq": "Which movie is shorter, The Expendables 2 or Maid in Manhattan?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Expendables 2\" .  } UNION { ?e <pred:name> \"Maid in Manhattan\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4870",
    "input_seq": "How many big cities are a part of Decatur (whose population is 55816)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"Decatur\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"55816\"^^xsd:double .   }"
  },
  {
    "qid": "train_4871",
    "input_seq": "The Canada province natively labeled l'Île-du-Prince-Édouard is in which time zone?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"time zone\" . ?e_1 <located_in_time_zone> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"province of Canada\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"l'Île-du-Prince-Édouard\" .   }"
  },
  {
    "qid": "train_4872",
    "input_seq": "What is the relationship between The Maltese Falcon, which started in 1930, and San Francisco, where Fat Wreck Chords is headquartered?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Maltese Falcon\" . ?e_1 <inception> ?pv . ?pv <pred:year> 1930 . ?e_2 <pred:name> \"San Francisco\" . ?e_3 <headquarters_location> ?e_2 . ?e_3 <pred:name> \"Fat Wreck Chords\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4873",
    "input_seq": "Dino De Laurentiis was a recipient at which Academy Awards event?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Dino De Laurentiis\" .  ?e <point_in_time> ?pv .  }"
  },
  {
    "qid": "train_4874",
    "input_seq": "Which place has less area, Marseille or Boulogne-Billancourt?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Marseille\" .  } UNION { ?e <pred:name> \"Boulogne-Billancourt\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4875",
    "input_seq": "Which movie is longer, Star Trek: Insurrection or A Prairie Home Companion?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Trek: Insurrection\" .  } UNION { ?e <pred:name> \"A Prairie Home Companion\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4876",
    "input_seq": "What number of animated feature films were published after 1953?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1953 ) .  }"
  },
  {
    "qid": "train_4877",
    "input_seq": "Does Honduras or does Mexico have a lower mains voltage?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Honduras\" .  } UNION { ?e <pred:name> \"Mexico\" .  } ?e <mains_voltage> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4878",
    "input_seq": "Who has fewer children, Dario Argento or Anurag Kashyap?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dario Argento\" .  } UNION { ?e <pred:name> \"Anurag Kashyap\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4879",
    "input_seq": "For which work was Sophie Thompson awarded the Broadcast Film Critics Association Award for Best Cast?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Broadcast Film Critics Association Award for Best Cast\" . ?e_2 <pred:name> \"Sophie Thompson\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4880",
    "input_seq": "Which show has fewer episodes, Big Love or The Edge of Night?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Big Love\" .  } UNION { ?e <pred:name> \"The Edge of Night\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4881",
    "input_seq": "When did Bo Derek marry the actor John Corbett?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bo Derek\" . ?e_2 <pred:name> \"John Corbett\" . ?e_2 <occupation> ?e_3 . ?e_3 <pred:name> \"actor\" . ?e_1 <partner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <partner> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4882",
    "input_seq": "What has Albert Einstein, born on 14th March 1879, in common with Nobel Prize in Physics?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nobel Prize in Physics\" . ?e_2 <pred:name> \"Albert Einstein\" . ?e_2 <date_of_birth> ?pv . ?pv <pred:date> \"1879-03-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4883",
    "input_seq": "What is the official name of the association football club whose nickname is Les Lions?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Les Lions\" . ?e <official_name> ?pv .  }"
  },
  {
    "qid": "train_4884",
    "input_seq": "What is the relationship between The Shining (the one that has Elliott Gould as a cast member) and Pat Hingle?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Shining\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Elliott Gould\" . ?e_2 <pred:name> \"Pat Hingle\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4885",
    "input_seq": "Does Dallas (the one whose number of seasons is 3) or Starsky & Hutch (the one whose genre is television comedy) have the greater number of seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dallas\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3\"^^xsd:double . } UNION { ?e <pred:name> \"Starsky & Hutch\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"television comedy\" . } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4886",
    "input_seq": "Does Maurice LaMarche speak English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Maurice LaMarche\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4887",
    "input_seq": "How many historical countries are a facet of Brazil which has a diplomatic relation with Paraguay?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historical country\" . ?e <facet_of> ?e_1 . ?e_1 <pred:name> \"Brazil\" . ?e_1 <diplomatic_relation> ?e_2 . ?e_2 <pred:name> \"Paraguay\" .   }"
  },
  {
    "qid": "train_4888",
    "input_seq": "Which one has more episodes, Days of our Lives or Sesame Street ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Days of our Lives\" .  } UNION { ?e <pred:name> \"Sesame Street\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4889",
    "input_seq": "What is the relationship between Cinderella (the one that has Cate Blanchett as a cast member) and Kenneth Branagh?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cinderella\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Cate Blanchett\" . ?e_2 <pred:name> \"Kenneth Branagh\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4890",
    "input_seq": "What number of novels with the official website http://www.dccomics.com/watchmen dervied from Cruel Intentions?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"Cruel Intentions\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" .  }"
  },
  {
    "qid": "train_4891",
    "input_seq": "Was the U.S. city with WOEID 2442818 founded before 1851?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2442818\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1851 ) .  }"
  },
  {
    "qid": "train_4892",
    "input_seq": "Which of the feature films, with Kathleen Kennedy as an executive producer, has the longest running time?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <executive_producer> ?e_1 . ?e_1 <pred:name> \"Kathleen Kennedy\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4893",
    "input_seq": "Is exploitative visa number of a visual artwork,  produced by History, equal to 18289 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"History\" .  ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"18289\" .  }"
  },
  {
    "qid": "train_4894",
    "input_seq": "What is the connection between hotel to V for Vendetta (the one whose duration is 132 minute)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"hotel\" . ?e_2 <pred:name> \"V for Vendetta\" . ?e_2 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"132\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4895",
    "input_seq": "What's the relationship between the video game industry and Nintendo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nintendo\" . ?e_2 <pred:name> \"video game industry\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4896",
    "input_seq": "tell me the time points of the Departments of France that have a nuts code FR 103 and the annual number of weddings 4669",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"departments of France\" . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"FR103\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4669\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual_number_of_weddings> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4897",
    "input_seq": "Is Kamal Haasan's ISNI 0000 0001 2191 3894?",
    "target_seq": "ASK { ?e <pred:name> \"Kamal Haasan\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2191 3894\" .  }"
  },
  {
    "qid": "train_4898",
    "input_seq": "What is the duration of the feature film titled National Treasure ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"National Treasure\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_4899",
    "input_seq": "How many subscribers does the user have for the Twitter username of landondonovan, the human that is a member of San Jose Earthquakes (the number of points of this statement is 32)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"San Jose Earthquakes\" . [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <number_of_points/goals/set_scored> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"32\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"landondonovan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4900",
    "input_seq": "what number of fictional profession in the derivative work of Superman (the one that derives Smallville)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fictional profession\" . ?e_1 <derivative_work> ?e . ?e_1 <pred:name> \"Superman\" . ?e_2 <based_on> ?e_1 . ?e_2 <pred:name> \"Smallville\" .   }"
  },
  {
    "qid": "train_4901",
    "input_seq": "Was the person whose ISNI is 0000 0000 8163 4937, born after 1932?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8163 4937\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1932 ) .  }"
  },
  {
    "qid": "train_4902",
    "input_seq": "Did Psycho, directed by Alfred Hitchcock, or He's Just Not That into You earn lower ticket revenue?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Psycho\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Alfred Hitchcock\" .   } UNION { ?e <pred:name> \"He's Just Not That into You\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4903",
    "input_seq": "Of German states in the German Empire that warred with Austria-Hungary, which is lowest in elevation?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"German Empire\" . ?e_1 <military_conflicts> ?e_2 . ?e_2 <pred:name> \"Austria-Hungary\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4904",
    "input_seq": "Which unitary state with a life expectancy other than 12.6 years has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"unitary state\" . ?e <life_expectancy> ?pv_1 . ?pv_1 <pred:unit> \"year\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"12.6\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4905",
    "input_seq": "What movie is titled A Great Day in Harlem ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"A Great Day in Harlem\" .  }"
  },
  {
    "qid": "train_4906",
    "input_seq": "Is http://www.turingarchive.org/ the official website for the Grammy Award for Best Male Pop Vocal Performance?",
    "target_seq": "ASK { ?e <pred:name> \"Grammy Award for Best Male Pop Vocal Performance\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.turingarchive.org/\" .  }"
  },
  {
    "qid": "train_4907",
    "input_seq": "Which area is smaller, Truro or Hanoi?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Truro\" .  } UNION { ?e <pred:name> \"Hanoi\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4908",
    "input_seq": "What is the connection between Margaret Atwood to Doris Lessing?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Margaret Atwood\" . ?e_2 <pred:name> \"Doris Lessing\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4909",
    "input_seq": "Does the priest Jerry Lewis or Mary Pickford have more kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jerry Lewis\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"priest\" .   } UNION { ?e <pred:name> \"Mary Pickford\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4910",
    "input_seq": "Tell me the time point of Rhinestone got nominated for Golden Raspberry Award for Worst Picture.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rhinestone\" . ?e_2 <pred:name> \"Golden Raspberry Award for Worst Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4911",
    "input_seq": "Is Chelsea's OS grid reference TQ175805 ?",
    "target_seq": "ASK { ?e <pred:name> \"Chelsea\" . ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"TQ175805\" .  }"
  },
  {
    "qid": "train_4912",
    "input_seq": "Which film has the title Bones?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Bones\" .  }"
  },
  {
    "qid": "train_4913",
    "input_seq": "Did the person whose ISNI is 0000 0001 2138 9703 not die in 2009?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2138 9703\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2009 ) .  }"
  },
  {
    "qid": "train_4914",
    "input_seq": "Is the soccer team with the Twitter name ServetteFC represented by the website adodenhaag.nl?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"ServetteFC\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://adodenhaag.nl/\" .  }"
  },
  {
    "qid": "train_4915",
    "input_seq": "Is the population of the county of California that contains Redding not equal to 8200000 in 2013-07-01 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Redding\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"8200000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2013-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_4916",
    "input_seq": "I would like to know the visual artwork that is entitled The Living Daylights and that comes from the UK.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"The Living Daylights\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  }"
  },
  {
    "qid": "train_4917",
    "input_seq": "Is 0000 0001 0893 552X the ISNI of the video game publisher that is the parent organization of SCE Studio Liverpool?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game publisher\" . ?e_1 <parent_organization> ?e . ?e_1 <pred:name> \"SCE Studio Liverpool\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0893 552X\" .  }"
  },
  {
    "qid": "train_4918",
    "input_seq": "What is S.K. Sturm Graz's twitter username?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"S.K. Sturm Graz\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_4919",
    "input_seq": "Is the episode count smaller for The Young and the Restless or for Friends, the Primetime Emmy Award nominee for Outstanding Comedy Series?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Young and the Restless\" .  } UNION { ?e <pred:name> \"Friends\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Comedy Series\" .   } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4920",
    "input_seq": "The sovereign state corresponding to the pronunciation audio En-us-Malaysia.ogg is the source of how many natural languages?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"natural language\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <pronunciation_audio> ?pv . ?pv <pred:value> \"En-us-Malaysia.ogg\" .   }"
  },
  {
    "qid": "train_4921",
    "input_seq": "Shakespeare in Love was nominated for the Academy Award for Best Cinematography, who was the nominee?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Shakespeare in Love\" . ?e_2 <pred:name> \"Academy Award for Best Cinematography\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_4922",
    "input_seq": "When did Dorset (the one whose official website is https://www.dorsetforyou.gov.uk/) stop being located in (the one whose demonym is Engelse)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dorset\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"https://www.dorsetforyou.gov.uk/\" . ?e_2 <pred:name> \"England\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"Engelse\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4923",
    "input_seq": "How is Howl's Moving Castle related to John Lasseter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Howl's Moving Castle\" . ?e_2 <pred:name> \"John Lasseter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4924",
    "input_seq": "Is Chinatown the title of Chinatown?",
    "target_seq": "ASK { ?e <pred:name> \"Chinatown\" . ?e <title> ?pv . ?pv <pred:value> \"Chinatown\" .  }"
  },
  {
    "qid": "train_4925",
    "input_seq": "Which has less area, Falkirk whose area is 297.4 square kilometres or Bristol County whose population is 48959?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Falkirk\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"297.4\"^^xsd:double . } UNION { ?e <pred:name> \"Bristol County\" . ?e <population> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"48959\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4926",
    "input_seq": "What is James Earl Jones' role in Star Wars Episode V: The Empire Strikes Back starring Frank Oz?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Star Wars Episode V: The Empire Strikes Back\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Frank Oz\" . ?e_2 <pred:name> \"James Earl Jones\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4927",
    "input_seq": "Which area has higher elevation above sea level, Rancho Mirage or Butte?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rancho Mirage\" .  } UNION { ?e <pred:name> \"Butte\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4928",
    "input_seq": "Which Pennsylvania county with more than 580000 people has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"580000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4929",
    "input_seq": "What is the connection between cool jazz to Dave Brubeck?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"cool jazz\" . ?e_2 <pred:name> \"Dave Brubeck\" . ?e_1 ?p ?e_2 .  }"
  }
]