[
  {
    "qid": "train_1552",
    "input_seq": "When did the Michigan county whose FIPS 6-4 (US counties) is 26145 have a population of 193307?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"26145\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"193307\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1553",
    "input_seq": "Where is the film that is based on Elektra (the one whose birth name is Elektra Natchios), whose publication date is 2005-03-10 published ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"Elektra\" . ?e_1 <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Elektra Natchios\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-03-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1554",
    "input_seq": "Who composed the TV series Robot Chicken?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <composer> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"television series\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"Robot Chicken\" .   }"
  },
  {
    "qid": "train_1555",
    "input_seq": "Does L-Tyrosine or arachidonic acid have a greater pKa?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"L-Tyrosine\" .  } UNION { ?e <pred:name> \"arachidonic acid\" .  } ?e <pKa> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1556",
    "input_seq": "What number of airlines have ISNI 0000 0001 0262 0877?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0262 0877\" .  }"
  },
  {
    "qid": "train_1557",
    "input_seq": "What is the number of industries that have Instagram username thedailyshow or official website https://www.apple.com/co/ios/",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" .  { ?e <Instagram_username> ?pv . ?pv <pred:value> \"thedailyshow\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"https://www.apple.com/co/ios/\" .  } }"
  },
  {
    "qid": "train_1558",
    "input_seq": "Is 0000 0001 0860 3576 the ISNI of the person who lives in Stamford?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <residence> ?e_1 . ?e_1 <pred:name> \"Stamford\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0860 3576\" .  }"
  },
  {
    "qid": "train_1559",
    "input_seq": "What is the connection between Harry Potter and the Chamber of Secrets (the one that has John Cleese as a cast member) to film based on literature?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Chamber of Secrets\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"John Cleese\" . ?e_2 <pred:name> \"film based on literature\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1560",
    "input_seq": "What does Versailles (the one whose INSEE municipality code is 78646) have in common with Versailles (the one whose official website is http://versailles.syncl.jp/)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Versailles\" . ?e_1 <INSEE_municipality_code> ?pv . ?pv <pred:value> \"78646\" . ?e_2 <pred:name> \"Versailles\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://versailles.syncl.jp/\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1561",
    "input_seq": "What is the subject of the statement that Nick Park was nominated for an Academy Award for Best Animated Feature?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nick Park\" . ?e_2 <pred:name> \"Academy Award for Best Animated Feature\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1562",
    "input_seq": "Which movie with the official website edge-movie.com is originally in Russian?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://edge-movie.com/\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"Russian\" .  }"
  },
  {
    "qid": "train_1563",
    "input_seq": "Which is shorter, Being There or Savages (the one whose publication date is 2012-10-11)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Being There\" . } UNION { ?e <pred:name> \"Savages\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2012-10-11\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1564",
    "input_seq": "Who was the \"Best Director\" nominee at the Academy Awards for A Beautiful Mind?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"A Beautiful Mind\" . ?e_2 <pred:name> \"Academy Award for Best Director\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1565",
    "input_seq": "The person with the pseudonym Nas has how many subscribers of his Twitter username, Nas?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <pseudonym> ?pv_1 . ?pv_1 <pred:value> \"Nas\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Nas\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1566",
    "input_seq": "Is the population of the New York county whose inception time is on 1817-03-28 greater than 5.3 (in 2012-07-01)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1817-03-28\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"5.3\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2012-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_1567",
    "input_seq": "Is 0000 0003 7596 208X the ISNI of Terence Stamp?",
    "target_seq": "ASK { ?e <pred:name> \"Terence Stamp\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 7596 208X\" .  }"
  },
  {
    "qid": "train_1568",
    "input_seq": "Does the person identified by ISNI 0000 0001 2247 8177 go by the Twitter username travisbarker ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2247 8177\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"travisbarker\" .  }"
  },
  {
    "qid": "train_1569",
    "input_seq": "Count the natural languages that have the country of Iran and that use the language that is used in Australia (which has a gs1 country code of 931)",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"natural language\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Iran\" .  ?e_2 <language_used> ?e . ?e_2 <pred:name> \"Australia\" . ?e_2 <GS1_country_code> ?pv . ?pv <pred:value> \"931\" .  }"
  },
  {
    "qid": "train_1570",
    "input_seq": "How many points did John Spencer (the one whose date of death is 2007-08-22) who is a member of Sheffield United F. C. make in the match?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"John Spencer\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"2007-08-22\"^^xsd:date . ?e_2 <pred:name> \"Sheffield United F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_points/goals/set_scored> ?qpv .  }"
  },
  {
    "qid": "train_1571",
    "input_seq": "What is the date of birth for the human whose native language name is Lon Chaney, Sr.?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Lon Chaney, Sr.\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1572",
    "input_seq": "When was the Austria national football team ranked 78?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Austria national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"78\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1573",
    "input_seq": "Which area is smaller, St. Charles County or Franklin County (the one whose population is 25740)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"St. Charles County\" . } UNION { ?e <pred:name> \"Franklin County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"25740\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1574",
    "input_seq": "Which is longer, Kentucky (96 minutes long) or Good Will Hunting",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kentucky\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"96\"^^xsd:double . } UNION { ?e <pred:name> \"Good Will Hunting\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1575",
    "input_seq": "When did Saint Kitts and Nevis have an inflation rate of 6 percentage?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Saint Kitts and Nevis\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"6\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1576",
    "input_seq": "How many sounds are represented by the subreddit labeled electro or were created in a year other than 2002?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2002 ) .  } UNION { ?e <subreddit> ?pv . ?pv <pred:value> \"electro\" .  } }"
  },
  {
    "qid": "train_1577",
    "input_seq": "How is Abhishek Bachchan related to Boston University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Abhishek Bachchan\" . ?e_2 <pred:name> \"Boston University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1578",
    "input_seq": "Does Nunavut or Northwest Territories occupy a smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nunavut\" .  } UNION { ?e <pred:name> \"Northwest Territories\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1579",
    "input_seq": "How many animated films have an official website at http://www.tv-tokyo.co.jp/anime/naruto/movie08/index.html and a publication date not in 2005?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tv-tokyo.co.jp/anime/naruto/movie08/index.html\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v . FILTER ( ?v != 2005 ) .  }"
  },
  {
    "qid": "train_1581",
    "input_seq": "What city with an area of 179 square kilometers is part of the Santa Fe Province?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"Santa Fe Province\" .  ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"179\"^^xsd:double .  }"
  },
  {
    "qid": "train_1582",
    "input_seq": "Does West Yorkshire or Tyne and Wear cover a smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"West Yorkshire\" .  } UNION { ?e <pred:name> \"Tyne and Wear\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1583",
    "input_seq": "How many armies have headquarter locations in New Delhi (the one that is the death place of Mahatma Gandhi) and the location of Tokyo (the one that is the residence of Cary-Hiroyuki Tagawa)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"New Delhi\" . ?e_2 <place_of_death> ?e_1 . ?e_2 <pred:name> \"Mahatma Gandhi\" .  ?e <location> ?e_3 . ?e_3 <pred:name> \"Tokyo\" . ?e_4 <residence> ?e_3 . ?e_4 <pred:name> \"Cary-Hiroyuki Tagawa\" .  }"
  },
  {
    "qid": "train_1584",
    "input_seq": "How many Illinois counties have a population count other than 43000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"43000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1585",
    "input_seq": "Which one of mountain ranges, whose width is below 510 kilometres, have the smallest elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e <width> ?pv_1 . ?pv_1 <pred:unit> \"kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"510\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1586",
    "input_seq": "Are there more employees at Barnard College or Ohio Wesleyan University?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Barnard College\" .  } UNION { ?e <pred:name> \"Ohio Wesleyan University\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1587",
    "input_seq": "Which has the lower elevation relative to sea level: Norman, founded in 1891, or Louisville?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Norman\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1891 . } UNION { ?e <pred:name> \"Louisville\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1588",
    "input_seq": "Was the entertainment whose distributor is Konami published on 1975-09-05?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"Konami\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1975-09-05\"^^xsd:date .  }"
  },
  {
    "qid": "train_1589",
    "input_seq": "What is the number of film genres with original language the language with the Linguasphere code 45-AAA-a.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film genre\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"language\" . ?e_1 <Linguasphere_code> ?pv . ?pv <pred:value> \"45-AAA-a\" .   }"
  },
  {
    "qid": "train_1590",
    "input_seq": "Which industry has its end time  in 2003 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <end_time> ?pv . ?pv <pred:year> 2003 .  }"
  },
  {
    "qid": "train_1591",
    "input_seq": "When was Natasha Richardson nominated for Tony Award for Best Actress in a Play?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Natasha Richardson\" . ?e_2 <pred:name> \"Tony Award for Best Actress in a Play\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1592",
    "input_seq": "Comparison with Bulawayo to Kozhikode whose area is less?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bulawayo\" .  } UNION { ?e <pred:name> \"Kozhikode\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1593",
    "input_seq": "Was a movie, derived from The Witches of Eastwick (the one whose ISBN-10 is 0-394-53760-2), published before 2001 in Germany?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e_1 <derivative_work> ?e . ?e_1 <pred:name> \"The Witches of Eastwick\" . ?e_1 <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"0-394-53760-2\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2001 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_1594",
    "input_seq": "What is Magdalen College's ISNI?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Magdalen College\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1595",
    "input_seq": "What is Diana Krall's relation to a pianist?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Diana Krall\" . ?e_2 <pred:name> \"pianist\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1596",
    "input_seq": "What film has the official website http://www.sonypictures.com/movies/thehousebunny?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sonypictures.com/movies/thehousebunny\" .  }"
  },
  {
    "qid": "train_1597",
    "input_seq": "Which one of the ethnic groups related to Germans have the largest population?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic group\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"Germans\" .  ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1598",
    "input_seq": "What is the relationship between classic rock and Led Zeppelin (the one whose genre is rock music)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"classic rock\" . ?e_2 <pred:name> \"Led Zeppelin\" . ?e_2 <genre> ?e_3 . ?e_3 <pred:name> \"rock music\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1599",
    "input_seq": "When did The English Patient receive the Academy Award for Best Production Design?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The English Patient\" . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1600",
    "input_seq": "How many Washington counties border Douglas County whose official website is http://www.douglascountywa.net?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Douglas County\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.douglascountywa.net\" .   }"
  },
  {
    "qid": "train_1601",
    "input_seq": "How many port cities whose demonym is برشلونية‎ and that is the filming location of House that origins from Poland?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"port city\" . ?e <demonym> ?pv . ?pv <pred:value> \"برشلونية‎\" . ?e_1 <filming_location> ?e . ?e_1 <pred:name> \"House\" . ?e_1 <country_of_origin> ?e_2 . ?e_2 <pred:name> \"Poland\" .  }"
  },
  {
    "qid": "train_1602",
    "input_seq": "How is the United States Military Academy related to the United States Army?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"United States Military Academy\" . ?e_2 <pred:name> \"United States Army\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1603",
    "input_seq": "When did Charleston County, have a population of 350209?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Charleston County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"350209\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1604",
    "input_seq": "Which city has the largest elevation above sea level that is located in or next to Pacific Ocean?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:name> \"Pacific Ocean\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1605",
    "input_seq": "What country that is home to Moscow (population of 8880124) was established 1917-11-09?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <country> ?e . ?e_1 <pred:name> \"Moscow\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8880124\"^^xsd:double .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:date> \"1917-11-09\"^^xsd:date .  }"
  },
  {
    "qid": "train_1606",
    "input_seq": "Which person is the believer in Judaism and reports carole_King as the Twitter username ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <religion> ?e_1 . ?e_1 <pred:name> \"Judaism\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"carole_King\" .  }"
  },
  {
    "qid": "train_1607",
    "input_seq": "Is the postal code of the private not-for-profit educational institution in Georgia (which partially contains Appalachian Mountains) 30314-4399?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"private not-for-profit educational institution\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Georgia\" . ?e_1 <partially_contains> ?e_2 . ?e_2 <pred:name> \"Appalachian Mountains\" .  ?e <postal_code> ?pv . ?pv <pred:value> \"30314-4399\" .  }"
  },
  {
    "qid": "train_1608",
    "input_seq": "What is the connection between the Legion of Merit to the United States Department of Defense?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Legion of Merit\" . ?e_2 <pred:name> \"United States Department of Defense\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1609",
    "input_seq": "What is the connection between A.C. Ajaccio to France?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A.C. Ajaccio\" . ?e_2 <pred:name> \"France\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1610",
    "input_seq": "Is 265 the ARCHON code of the university whose British Museum person-institution is 121863?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"121863\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"265\" .  }"
  },
  {
    "qid": "train_1611",
    "input_seq": "How many religions do we know that differ from agnosticism or are belonging to Christian (also the name given to Pitbull) religion ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" .  { ?e_1 <different_from> ?e . ?e_1 <pred:name> \"agnosticism\" .  } UNION { ?e <religion> ?e_1 . ?e_1 <pred:name> \"Christian\" . ?e_2 <given_name> ?e_1 . ?e_2 <pred:name> \"Pitbull\" .  } }"
  },
  {
    "qid": "train_1612",
    "input_seq": "Tell me the city which is where Rajesh Khanna is born.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Rajesh Khanna\" .   }"
  },
  {
    "qid": "train_1613",
    "input_seq": "What has Abe Burrows in common with James Burrows?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Abe Burrows\" . ?e_2 <pred:name> \"James Burrows\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1614",
    "input_seq": "What date was the Orson Welles short film published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"short film\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Orson Welles\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_1615",
    "input_seq": "How many communication media are a component of the organization that mainly depicts economics?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"communication medium\" . ?e_1 <has_part> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"organization\" . ?e_1 <main_subject> ?e_2 . ?e_2 <pred:name> \"economics\" .   }"
  },
  {
    "qid": "train_1616",
    "input_seq": "What is the title of Logan (the one that is inspired by Little Miss Sunshine)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Logan\" . ?e <inspired_by> ?e_1 . ?e_1 <pred:name> \"Little Miss Sunshine\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_1617",
    "input_seq": "What is the abbreviated name of SC Heerenveen?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"SC Heerenveen\" . ?e <short_name> ?pv .  }"
  },
  {
    "qid": "train_1618",
    "input_seq": "When did the city with WOEID 30079 have a population of 282442?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"30079\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"282442\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1619",
    "input_seq": "Which TV film was composed by Michel Legrand?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Michel Legrand\" .   }"
  },
  {
    "qid": "train_1620",
    "input_seq": "How does The Holiday relate to the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Holiday\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1621",
    "input_seq": "How is bossa nova related to Diana Krall?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"bossa nova\" . ?e_2 <pred:name> \"Diana Krall\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1622",
    "input_seq": "When was the parter of Gary Oldman born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <partner> ?e . ?e_1 <pred:name> \"Gary Oldman\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1623",
    "input_seq": "The mountain range that Herkimer County partly encloses is the story setting of how many written works?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"mountain range\" . ?e_2 <partially_contains> ?e_1 . ?e_2 <pred:name> \"Herkimer County\" .   }"
  },
  {
    "qid": "train_1624",
    "input_seq": "How many languages have the IETF language tag of gu or are indigenous to Norwegians?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" .  { ?e <IETF_language_tag> ?pv . ?pv <pred:value> \"gu\" .  } UNION { ?e <indigenous_to> ?e_1 . ?e_1 <pred:name> \"Norwegians\" .  } }"
  },
  {
    "qid": "train_1625",
    "input_seq": "How many bands include Jim O'Rourke, who was educated at DePaul University, or is famous for folk rock?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" .  { ?e <has_part> ?e_1 . ?e_1 <pred:name> \"Jim O'Rourke\" . ?e_1 <educated_at> ?e_2 . ?e_2 <pred:name> \"DePaul University\" .  } UNION { ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"folk rock\" .  } }"
  },
  {
    "qid": "train_1626",
    "input_seq": "How many subscribers are there for the Twitter username officialDannyT belonging to the person whose Deutsche Synchronkartei actor-ID is 3853?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv_1 . ?pv_1 <pred:value> \"3853\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"officialDannyT\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1627",
    "input_seq": "What is the release region for Shanghai Noon whose release date is 2000-10-19?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Shanghai Noon\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-10-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1628",
    "input_seq": "What film's official website is http://www.miramax.com/movie/hamlet?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.miramax.com/movie/hamlet\" .  }"
  },
  {
    "qid": "train_1629",
    "input_seq": "Who was influenced by someone with 00000015911 as their Munzinger IBA?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <influenced_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000015911\" .   }"
  },
  {
    "qid": "train_1630",
    "input_seq": "What is the connection between Sin City to Sicilian Mafia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sin City\" . ?e_2 <pred:name> \"Sicilian Mafia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1631",
    "input_seq": "What is the Instagram username for the Twitter username MelissaJoanHart (719136 subscribers)",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"MelissaJoanHart\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"719136\"^^xsd:double . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_1632",
    "input_seq": "Who is shorter, Adam Smith (whose date of birth is 1991-04-29) or January Jones?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Adam Smith\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1991-04-29\"^^xsd:date . } UNION { ?e <pred:name> \"January Jones\" . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1633",
    "input_seq": "Which area has higher elevation above sea level, Toledo (the one whose country is United States of America) or Beaumont?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Toledo\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"Beaumont\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1634",
    "input_seq": "What Academy Awards ceremony has the edition number of 56?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <edition_number> ?pv . ?pv <pred:value> \"56\" .  }"
  }
]