[
  {
    "qid": "train_3204",
    "input_seq": "Which is shorter, The Doors starring Debi Mazar or The Phantom of the Opera whose end time is 1990-03-19?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Doors\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Debi Mazar\" . } UNION { ?e <pred:name> \"The Phantom of the Opera\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1990-03-19\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3205",
    "input_seq": "What is the official website for the actor that played Harry Potter in Harry Potter and the Philosopher's Stone written by J.K. Rowling?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Harry Potter and the Philosopher's Stone\" . ?e_1 <after_a_work_by> ?e_2 . ?e_2 <pred:name> \"J. K. Rowling\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Harry Potter\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3206",
    "input_seq": "What is the number of administrative territorial Canadian entities that have country Canada or that is replaced by Manitoba",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity of Canada\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"Canada\" .  } UNION { ?e_1 <replaces> ?e . ?e_1 <pred:name> \"Manitoba\" .  } }"
  },
  {
    "qid": "train_3208",
    "input_seq": "Which has the most episodes among the television series produced by HBO?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"HBO\" .  ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3209",
    "input_seq": "How many Japan prefectures whose percent of water area is not 5 percent or whose ISNI is 0000 0001 0728 9853?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"prefecture of Japan\" .  { ?e <water_as_percent_of_area> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> ?v . FILTER ( ?v != \"5\"^^xsd:double ) .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0728 9853\" .  } }"
  },
  {
    "qid": "train_3210",
    "input_seq": "When did New Mexico whose ISO 3166-2 code is US-NM have a population of 423317?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"New Mexico\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"US-NM\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"423317\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3211",
    "input_seq": "What is the beginning date that 128266 is the exploitation visa number of The Three Musketeers whose release region is the United States of America?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The Three Musketeers\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"128266\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3212",
    "input_seq": "Which area is larger, Hamilton County (the one that has the capital Cincinnati) or Clinton County (the one whose licence plate code is 14)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hamilton County\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Cincinnati\" . } UNION { ?e <pred:name> \"Clinton County\" . ?e <licence_plate_code> ?pv_1 . ?pv_1 <pred:value> \"14\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3213",
    "input_seq": "What is the relation between Arizona (the one whose duration is 121 minute) with the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Arizona\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"121\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3214",
    "input_seq": "Is http://www.thenationalleague.org.uk/ the official website of the television series that stars Jared Harris?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jared Harris\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.thenationalleague.org.uk/\" .  }"
  },
  {
    "qid": "train_3215",
    "input_seq": "What is the ISNI of Gordon Douglas?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gordon Douglas\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3216",
    "input_seq": "Is the ISNI for the Copley Medal winning Charles Darwin equal to 0000 0004 1937 0546?",
    "target_seq": "ASK { ?e <pred:name> \"Charles Darwin\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Copley Medal\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1937 0546\" .  }"
  },
  {
    "qid": "train_3217",
    "input_seq": "Which movie is shorter, Tower of London (the one whose director is Roger Corman) or Sailor Moon Super S: The Movie?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tower of London\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Roger Corman\" .   } UNION { ?e <pred:name> \"Sailor Moon Super S: The Movie\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3218",
    "input_seq": "National Gallery, published on 2015-01-09, has what connection to the UK?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"National Gallery\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2015-01-09\"^^xsd:date . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3219",
    "input_seq": "Did Fritz Lang's (the one who speaks German) work start before 1993?",
    "target_seq": "ASK { ?e <pred:name> \"Fritz Lang\" . ?e <languages_spoken,_written_or_signed> ?e_1 . ?e_1 <pred:name> \"German\" .  ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1993 ) .  }"
  },
  {
    "qid": "train_3220",
    "input_seq": "Of all the animes that have less than 10 seasons, which has the highest number of episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"10\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3221",
    "input_seq": "What is the connection between Sault Ste. Marie to Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sault Ste. Marie\" . ?e_2 <pred:name> \"Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3222",
    "input_seq": "Does Joplin or Chicago, elevation 176 meters, occupy the smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Joplin\" . } UNION { ?e <pred:name> \"Chicago\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"176\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3223",
    "input_seq": "What is Huelva's inception time?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Huelva\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3224",
    "input_seq": "What does Pinocchio (which has David Suchet as a cast member) have to do with Italy?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pinocchio\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"David Suchet\" . ?e_2 <pred:name> \"Italy\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3226",
    "input_seq": "What person is a member of the association football club whose headquarters is located in Ayr (this statement's start date is 1990-01-01)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"association football club\" . ?e_1 <headquarters_location> ?e_2 . ?e_2 <pred:name> \"Ayr\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:date> \"1990-01-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_3227",
    "input_seq": "What is the most graves found in a cemetery that has more than 62000 graves?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <number_of_graves> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"62000\"^^xsd:double ) . ?e <number_of_graves> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3228",
    "input_seq": "Which movie is shorter, Freakazoid! or Dynasty (the one whose start time is 2017-10-11)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Freakazoid!\" . } UNION { ?e <pred:name> \"Dynasty\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2017-10-11\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3229",
    "input_seq": "What is the playing-length of the album performed by Brian Wilson of The Beach Boys?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <performer> ?e_1 . ?e_1 <pred:name> \"Brian Wilson\" . ?e_1 <member_of> ?e_2 . ?e_2 <pred:name> \"The Beach Boys\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_3230",
    "input_seq": "How many empires have the capital Constantinople?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Constantinople\" .   }"
  },
  {
    "qid": "train_3231",
    "input_seq": "What is the smallest discharge in a river that runs less than 530 km?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <length> ?pv_1 . ?pv_1 <pred:unit> \"kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"530\"^^xsd:double ) . ?e <discharge> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3232",
    "input_seq": "What number of military branches have the abbreviated name of RCAF?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"military branch\" . ?e <short_name> ?pv . ?pv <pred:value> \"RCAF\" .  }"
  },
  {
    "qid": "train_3233",
    "input_seq": "What is the demonym for the city that is Angel's birthplace (the one whose name in native language is Angel)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Angel\" . ?e_1 <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Angel\" . ?e <demonym> ?pv .  }"
  },
  {
    "qid": "train_3234",
    "input_seq": "How is Star Wars Episode IV: A New Hope (the one whose release region is Soviet Union) related with Australia (the one whose ISO 3166-1 numeric code is 036)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Star Wars Episode IV: A New Hope\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Soviet Union\" . ?e_2 <pred:name> \"Australia\" . ?e_2 <ISO_3166-1_numeric_code> ?pv . ?pv <pred:value> \"036\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3235",
    "input_seq": "Which movie is longer, War and Peace (the one that has Henry Fonda as a cast member) or Life as We Know It?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"War and Peace\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Henry Fonda\" .   } UNION { ?e <pred:name> \"Life as We Know It\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3236",
    "input_seq": "Is the length of the film titled Tarzan not 1 academic term?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Tarzan\" . ?e <duration> ?pv . ?pv <pred:unit> \"academic term\" . ?pv <pred:value> ?v . FILTER ( ?v != \"1\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3237",
    "input_seq": "Which movie is longer, The Diary of Anne Frank (the one that has Maximilian Schell as a cast member) or Coronado (the one that has John Rhys-Davies as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Diary of Anne Frank\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Maximilian Schell\" .   } UNION { ?e <pred:name> \"Coronado\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"John Rhys-Davies\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3238",
    "input_seq": "What is the beginning date of Laval University?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Laval University\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3239",
    "input_seq": "What is the start time for France as Metz's country?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Metz\" . ?e_2 <pred:name> \"France\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3240",
    "input_seq": "Was the Kung Fu Panda 2 released for PlayStation 3 published prior to 2016 ?",
    "target_seq": "ASK { ?e <pred:name> \"Kung Fu Panda 2\" . ?e <platform> ?e_1 . ?e_1 <pred:name> \"PlayStation 3\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2016 ) .  }"
  },
  {
    "qid": "train_3241",
    "input_seq": "Where was The Bodyguard (the one whose distributor is Warner Bros.) published on 25th November 1992 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The Bodyguard\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"Warner Bros.\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1992-11-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3242",
    "input_seq": "Is 0000 0001 2126 1742 the ISNI of the person who influenced William James (the one whose date of death is 1910-08-26)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <influenced_by> ?e . ?e_1 <pred:name> \"William James\" . ?e_1 <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1910-08-26\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2126 1742\" .  }"
  },
  {
    "qid": "train_3243",
    "input_seq": "For what work did Alicia Silverstone win the MTV Movie Award for Most Desirable Female?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Movie Award for Most Desirable Female\" . ?e_2 <pred:name> \"Alicia Silverstone\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3244",
    "input_seq": "Does the Robin Hood originating in Germany have a run-time under 5 weeks?",
    "target_seq": "ASK { ?e <pred:name> \"Robin Hood\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Germany\" .  ?e <duration> ?pv . ?pv <pred:unit> \"week\" . ?pv <pred:value> ?v . FILTER ( ?v < \"5\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3245",
    "input_seq": "How many subscribers can be found for the Twitter username yagitootoko, which belongs to avisual artwork whose director is Grant Heslov,?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Grant Heslov\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"yagitootoko\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3246",
    "input_seq": "How many followers has the association football club whose Instagram username is sgdynamodresden (with 58498 followers) in its Twitter username DynamoDresden?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"sgdynamodresden\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"58498\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"DynamoDresden\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3247",
    "input_seq": "How are Benjamin Bratt and English related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Benjamin Bratt\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3248",
    "input_seq": "What proprietary software uses the Croatian language?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"proprietary software\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"Croatian\" .   }"
  },
  {
    "qid": "train_3249",
    "input_seq": "How is Robert Wagner (who worked in Graz) related to Graz?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Wagner\" . ?e_1 <work_location> ?e_3 . ?e_3 <pred:name> \"Graz\" . ?e_2 <pred:name> \"Graz\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3250",
    "input_seq": "Is the film with publication date as 2019-12-20, titled The Rules of Attraction ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2019-12-20\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"The Rules of Attraction\" .  }"
  },
  {
    "qid": "train_3251",
    "input_seq": "Which area is larger, Fredericksburg or Norfolk (the one whose motto text is Crescas)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fredericksburg\" . } UNION { ?e <pred:name> \"Norfolk\" . ?e <motto_text> ?pv_1 . ?pv_1 <pred:value> \"Crescas\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3252",
    "input_seq": "How are Secret of the Wings and Turkey related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Secret of the Wings\" . ?e_2 <pred:name> \"Turkey\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3253",
    "input_seq": "What is the start date that 121697 is the exploitation visa number for the film that received an Academy Award for Best Costume Design at the 81st Academy Awards?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Costume Design\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"81st Academy Awards\" . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"121697\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3254",
    "input_seq": "What is the connection between Anna Karenina (the one whose original language is Hungarian) to Leo Tolstoy?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Anna Karenina\" . ?e_1 <original_language_of_film_or_TV_show> ?e_3 . ?e_3 <pred:name> \"Hungarian\" . ?e_2 <pred:name> \"Leo Tolstoy\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3255",
    "input_seq": "Which person's Instagram username is ceelogreen?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"ceelogreen\" .  }"
  },
  {
    "qid": "train_3256",
    "input_seq": "Which Twitter account name belongs to someone with the dedicated website www.elizabethhurley.com?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.elizabethhurley.com/\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_3257",
    "input_seq": "What is the relationship between reggaeton to Fat Joe?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"reggaeton\" . ?e_2 <pred:name> \"Fat Joe\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3258",
    "input_seq": "Among the unitary states whose real gross domestic product growth rate is greater than -5 percentage, which has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"unitary state\" . ?e <real_gross_domestic_product_growth_rate> ?pv_1 . ?pv_1 <pred:unit> \"percentage\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"-5\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3259",
    "input_seq": "What is the number of theatre award whose country is United States of America or whose official website is http://www.tonyawards.com/en_US/index.html ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tonyawards.com/en_US/index.html\" .  } }"
  },
  {
    "qid": "train_3260",
    "input_seq": "How many academic degrees are an aspect of law?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic degree\" . ?e <facet_of> ?e_1 . ?e_1 <pred:name> \"law\" .   }"
  },
  {
    "qid": "train_3261",
    "input_seq": "Does the Normandy with the Twitter name RegionNormandie or the Brittany of ISO 3166-2 code FR-BRE occupy a smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Normandy\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"RegionNormandie\" . } UNION { ?e <pred:name> \"Brittany\" . ?e <ISO_3166-2_code> ?pv_2 . ?pv_2 <pred:value> \"FR-BRE\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3262",
    "input_seq": "Which movie featuring Michael Kahn (the one that is a film editor of Amistad) as a film editor has the longest runtime?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <film_editor> ?e_1 . ?e_1 <pred:name> \"Michael Kahn\" . ?e_2 <film_editor> ?e_1 . ?e_2 <pred:name> \"Amistad\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3263",
    "input_seq": "Is Dany Heatley or Heather Mitts the taller of the two?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dany Heatley\" .  } UNION { ?e <pred:name> \"Heather Mitts\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3264",
    "input_seq": "What is the connection between John Logan (the one that is a member of Barnsley F.C.) to Barnsley F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Logan\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Barnsley F.C.\" . ?e_2 <pred:name> \"Barnsley F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3265",
    "input_seq": "What character did Joan Allen play in The Bourne Legacy?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Bourne Legacy\" . ?e_2 <pred:name> \"Joan Allen\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3266",
    "input_seq": "What language is associated with the official website http://leecoms.com/ for the administrative territorial entity whose FIPS 6-4 for US counties is 28081?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"28081\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://leecoms.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3267",
    "input_seq": "What is the association football club with native label FC Sion?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <native_label> ?pv . ?pv <pred:value> \"FC Sion\" .  }"
  },
  {
    "qid": "train_3268",
    "input_seq": "When was a sovereign state, whose territory was claimed by Kiev since 7th May 1920, established ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <territory_claimed_by> ?e . ?e_1 <pred:name> \"Kiev\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <territory_claimed_by> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:date> \"1920-05-07\"^^xsd:date . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3270",
    "input_seq": "For the asteroid belt's parent-astronomical body, how many are astronomical-object types?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"astronomical object type\" . ?e_1 <parent_astronomical_body> ?e . ?e_1 <pred:name> \"asteroid belt\" .   }"
  },
  {
    "qid": "train_3271",
    "input_seq": "Where was the visual artwork titled Mar adentro published on 2005-03-10?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Mar adentro\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-03-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3272",
    "input_seq": "Did Charlotte (the one that contains University of North Carolina at Charlotte) not have a population of 2700000 (the point in time of this statement is 1960)?",
    "target_seq": "ASK { ?e <pred:name> \"Charlotte\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"University of North Carolina at Charlotte\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"2700000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 1960 .  }"
  },
  {
    "qid": "train_3273",
    "input_seq": "When was born the person that in The West Wing, did the character, Donna Moss?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"The West Wing\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Donna Moss\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3274",
    "input_seq": "When was Ottawa made the capital of Canada?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Canada\" . ?e_2 <pred:name> \"Ottawa\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3275",
    "input_seq": "Is 718 the correct local dialing code for Eau Claire?",
    "target_seq": "ASK { ?e <pred:name> \"Eau Claire\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"718\" .  }"
  },
  {
    "qid": "train_3276",
    "input_seq": "The feminist movement's subreddit labeled feminism is published in which language?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"feminism\" . ?e <subreddit> ?pv . ?pv <pred:value> \"feminism\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3277",
    "input_seq": "Was Albert Nobbs published in Germany before 2007?",
    "target_seq": "ASK { ?e <pred:name> \"Albert Nobbs\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2007 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_3278",
    "input_seq": "Which human is a cast member of King of the Hill (which mainly depicts coming of age) and won the Grammy Award for Best New Artist (followed by Christina Aguilera)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Grammy Award for Best New Artist\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <followed_by> ?qpv . ?qpv <pred:value> \"Christina Aguilera\" . ?e_2 <cast_member> ?e . ?e_2 <pred:name> \"King of the Hill\" . ?e_2 <main_subject> ?e_3 . ?e_3 <pred:name> \"coming of age\" .  }"
  },
  {
    "qid": "train_3279",
    "input_seq": "How many comedies received a Primetime Emmy Award for Outstanding Directing for a Comedy Series?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Directing for a Comedy Series\" .   }"
  },
  {
    "qid": "train_3280",
    "input_seq": "Which film has the shortest duration among the feature film whose publication date is before 2010.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 < 2010 ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3281",
    "input_seq": "Which person(s) studied at the university whose official website is http://www.uwindsor.ca/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <educated_at> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"university\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.uwindsor.ca/\" .   }"
  },
  {
    "qid": "train_3282",
    "input_seq": "How is J. G. Ballard related to London where Sandy Powell was born?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"J. G. Ballard\" . ?e_2 <pred:name> \"London\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Sandy Powell\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3283",
    "input_seq": "Tell me the relationship between Dave Foley (the one that got educated at Ohio State University) and Cincinnati.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dave Foley\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"Ohio State University\" . ?e_2 <pred:name> \"Cincinnati\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3284",
    "input_seq": "How many television series episodes either were published after 1990 or originated from the United States of America?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1990 ) .  } UNION { ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } }"
  }
]