[
  {
    "qid": "train_3039",
    "input_seq": "When was the launch of Toy Story, scripted by Joss Whedon?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Toy Story\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Joss Whedon\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3040",
    "input_seq": "Which island has the largest population located in New Zealand",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"New Zealand\" .  ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3041",
    "input_seq": "How tall is Benito Mussolini?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Benito Mussolini\" . ?e <height> ?pv .  }"
  },
  {
    "qid": "train_3042",
    "input_seq": "How is the 74th Academy Awards related to the 75th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"74th Academy Awards\" . ?e_2 <pred:name> \"75th Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3043",
    "input_seq": "What US town is the residence of George Hamilton of Bulworth?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e_2 <residence> ?e . ?e_2 <pred:name> \"George Hamilton\" . ?e_3 <cast_member> ?e_2 . ?e_3 <pred:name> \"Bulworth\" .  }"
  },
  {
    "qid": "train_3044",
    "input_seq": "Does the person with the Instagram handle vincegillmusic go by the name sonic-the-hedgehog on Giphy?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"vincegillmusic\" . ?e <Giphy_username> ?pv . ?pv <pred:value> \"sonic-the-hedgehog\" .  }"
  },
  {
    "qid": "train_3045",
    "input_seq": "For which work was Michael Mann (who has the occupation of screenwriter) nominated for an Academy Award for Best Writing, Adapted Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Michael Mann\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"screenwriter\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3046",
    "input_seq": "Does Billy Bob Thornton or Salma Hayek have more kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Billy Bob Thornton\" .  } UNION { ?e <pred:name> \"Salma Hayek\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3047",
    "input_seq": "Which has fewer seasons, It (the one that mainly depicts supernatural) or Star Trek: The Original Series?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"It\" . ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"supernatural\" .   } UNION { ?e <pred:name> \"Star Trek: The Original Series\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3048",
    "input_seq": "What is the official website of the film production company whose PermID is 4296139425?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"4296139425\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3049",
    "input_seq": "Which area is larger, Barrie or Cork?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Barrie\" .  } UNION { ?e <pred:name> \"Cork\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3050",
    "input_seq": "How many states in the United States have a population not equal to 280000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"280000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3051",
    "input_seq": "How is Santa Fe Province related to Buenos Aires Province?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Santa Fe Province\" . ?e_2 <pred:name> \"Buenos Aires Province\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3052",
    "input_seq": "Does Total Recall, released in Hungary, or Gallipoli have the shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Total Recall\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Hungary\" .   } UNION { ?e <pred:name> \"Gallipoli\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3053",
    "input_seq": "What is the connection between Ice Age: Continental Drift to Pakistan?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ice Age: Continental Drift\" . ?e_2 <pred:name> \"Pakistan\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3054",
    "input_seq": "Tell me the one with a smaller population, Florence (who has a population of 39319) or Memphis.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Florence\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"39319\"^^xsd:double . } UNION { ?e <pred:name> \"Memphis\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3055",
    "input_seq": "Tell me the one with the least net profit within the public company that has net profit not equal to -11000000000 United States dollar",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public company\" . ?e <net_profit> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"-11000000000\"^^xsd:double ) . ?e <net_profit> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3056",
    "input_seq": "How is the Clash of the Titans with Jason Flemyng as a cast member related to the action film genre?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Clash of the Titans\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Jason Flemyng\" . ?e_2 <pred:name> \"action film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3057",
    "input_seq": "Which measures more above sea level, Baltimore or Wichita Falls?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Baltimore\" .  } UNION { ?e <pred:name> \"Wichita Falls\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3058",
    "input_seq": "Is 2008-10-16 the publication date in Sweden of the animated feature with http://polarexpressmovie.warnerbros.com as its website?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://polarexpressmovie.warnerbros.com/\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-10-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }"
  },
  {
    "qid": "train_3059",
    "input_seq": "With the publication date 1997-07-10, where is the visual artwork published that follows Speed, (the one whose production company is 20th Century Fox)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <follows> ?e_1 . ?e_1 <pred:name> \"Speed\" . ?e_1 <production_company> ?e_2 . ?e_2 <pred:name> \"20th Century Fox\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1997-07-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3060",
    "input_seq": "What is the WOEID for the city with local dialing code 1224?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"1224\" . ?e <WOEID> ?pv .  }"
  },
  {
    "qid": "train_3061",
    "input_seq": "What was Correspondent (which was nominated for the Academy Award for Best Supporting Actor) about?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Foreign Correspondent\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3062",
    "input_seq": "What is the quote supporting the statement that the ISSN for The New York Times is 0362-4331?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The New York Times\" . ?e <ISSN> ?pv . ?pv <pred:value> \"0362-4331\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISSN> ; <pred:fact_t> ?pv ] <quote> ?qpv .  }"
  },
  {
    "qid": "train_3063",
    "input_seq": "Gordon Brown of Scunthorpe United F.C. had how many match appearances as a member of Southampton F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gordon Brown\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Scunthorpe United F.C.\" . ?e_2 <pred:name> \"Southampton F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_3064",
    "input_seq": "Which area is larger, Stavanger or Dakar (the one that is the twinned administrative body of Taipei)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Stavanger\" .  } UNION { ?e <pred:name> \"Dakar\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Taipei\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3065",
    "input_seq": "What is the street address of the HQ of Politecnico di Milano in Milan, zip code 20133?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Politecnico di Milano\" . ?e_2 <pred:name> \"Milan\" . ?e_2 <postal_code> ?pv . ?pv <pred:value> \"20133\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <located_at_street_address_(DEPRECATED)> ?qpv .  }"
  },
  {
    "qid": "train_3067",
    "input_seq": "How many string instruments are the instruments used by the human whose audio recording of the subject's spoken voice is titled \"Paul McCartney BBC Radio4 Front Row 26 Dec 2012 b01pg54v.flac\"?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"string instrument\" . ?e_1 <instrument> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <audio_recording_of_the_subject's_spoken_voice> ?pv . ?pv <pred:value> \"Paul McCartney BBC Radio4 Front Row 26 Dec 2012 b01pg54v.flac\" .   }"
  },
  {
    "qid": "train_3068",
    "input_seq": "Which language is associated with unix, the subreddit of the software whose official website is http://opengroup.org/unix?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://opengroup.org/unix\" . ?e <subreddit> ?pv . ?pv <pred:value> \"unix\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3069",
    "input_seq": "What public company uses the Filipino language?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public company\" . ?e <language_used> ?e_1 . ?e_1 <pred:name> \"Filipino\" .   }"
  },
  {
    "qid": "train_3070",
    "input_seq": "At what time point did electronic dance music performer Phoenix earn a Best Alternative Music Album award at the Grammys?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Phoenix\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"electronic dance music\" . ?e_2 <pred:name> \"Grammy Award for Best Alternative Music Album\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3071",
    "input_seq": "Until when was Evangeline Lilly the partner of Dominic Monaghan?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Evangeline Lilly\" . ?e_2 <pred:name> \"Dominic Monaghan\" . ?e_1 <partner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <partner> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3072",
    "input_seq": "What is the county in Maine with the official website of http://www.co.hancock.me.us?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maine\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.hancock.me.us\" .  }"
  },
  {
    "qid": "train_3073",
    "input_seq": "When did Nino Rota receive the Grammy Award for Best Score Soundtrack for Visual Media?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nino Rota\" . ?e_2 <pred:name> \"Grammy Award for Best Score Soundtrack for Visual Media\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3074",
    "input_seq": "Does M*A*S*H go by the title Seeking a Friend for the End of the World ?",
    "target_seq": "ASK { ?e <pred:name> \"M*A*S*H\" . ?e <title> ?pv . ?pv <pred:value> \"Seeking a Friend for the End of the World\" .  }"
  },
  {
    "qid": "train_3075",
    "input_seq": "Does Conspiracy Theory or The Black Dahlia have the longer running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Conspiracy Theory\" .  } UNION { ?e <pred:name> \"The Black Dahlia\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3076",
    "input_seq": "What is the connection between Purple Heart (the one that has Jerry Orbach as a cast member) to Jerry Orbach?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Purple Heart\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Jerry Orbach\" . ?e_2 <pred:name> \"Jerry Orbach\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3077",
    "input_seq": "When did Imperial County reach its population of 174,750 people?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Imperial County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"174750\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3078",
    "input_seq": "What is the connection between Alps to Slovenia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alps\" . ?e_2 <pred:name> \"Slovenia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3079",
    "input_seq": "Which Winter Olympic Games was number 17?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Winter Olympic Games\" . ?e <edition_number> ?pv . ?pv <pred:value> \"17\" .  }"
  },
  {
    "qid": "train_3080",
    "input_seq": "When did Northumberland stop being located in England (the narrative location of Howards End)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Northumberland\" . ?e_2 <pred:name> \"England\" . ?e_3 <narrative_location> ?e_2 . ?e_3 <pred:name> \"Howards End\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3081",
    "input_seq": "How many computer programmings include a famous person whose official website is http://www.radiohead.com/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"computer programming\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.radiohead.com/\" .   }"
  },
  {
    "qid": "train_3083",
    "input_seq": "Does the U.S. city whose postal code is 48640–48686, have the subreddit of architecture?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"48640–48686\" . ?e <subreddit> ?pv . ?pv <pred:value> \"architecture\" .  }"
  },
  {
    "qid": "train_3084",
    "input_seq": "Did someone with the native name Sid James begin working sometime other than 1961 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Sid James\" . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1961 ) .  }"
  },
  {
    "qid": "train_3085",
    "input_seq": "Which has a smaller area, Yuma with the local dialing code of 928, or Butte?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Yuma\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"928\" . } UNION { ?e <pred:name> \"Butte\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3086",
    "input_seq": "Is the US-released The Wicker Man represented by the website http://www.htc.com ?",
    "target_seq": "ASK { ?e <pred:name> \"The Wicker Man\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.htc.com\" .  }"
  },
  {
    "qid": "train_3087",
    "input_seq": "What is the connection between Bohemian F.C. to Ireland (the one whose population is 3754786)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bohemian F.C.\" . ?e_2 <pred:name> \"Ireland\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3754786\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3088",
    "input_seq": "Which soccer club goes by the Instagram handle stpatsfc?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"stpatsfc\" .  }"
  },
  {
    "qid": "train_3089",
    "input_seq": "What is the relation of Peter Morgan to Satellite Awards 2008?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peter Morgan\" . ?e_2 <pred:name> \"Satellite Awards 2008\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3090",
    "input_seq": "What is the connection between A Bridge Too Far to Anthony Hopkins?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Bridge Too Far\" . ?e_2 <pred:name> \"Anthony Hopkins\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3091",
    "input_seq": "What is Bob Bryan's connection to tennis?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bob Bryan\" . ?e_2 <pred:name> \"tennis\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3092",
    "input_seq": "Whose work on Lady Sings the Blues earned an Academy Award nomination for Best Production Design?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lady Sings the Blues\" . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3093",
    "input_seq": "Of Massachusetts counties founded more recently than 1685, which takes up the most area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1685 ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3094",
    "input_seq": "Does the local dialing code 095 belong to the city of the official website www.comune.catania.it ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.comune.catania.it/\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"095\" .  }"
  },
  {
    "qid": "train_3095",
    "input_seq": "Which film production company's official website is http://www.hbo.com/films/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hbo.com/films/\" .  }"
  },
  {
    "qid": "train_3096",
    "input_seq": "Which ice hockey team drafted Chris Brown (the one whose height is 191 centimetre)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ice hockey team\" . ?e_1 <drafted_by> ?e . ?e_1 <pred:name> \"Chris Brown\" . ?e_1 <height> ?pv . ?pv <pred:unit> \"centimetre\" . ?pv <pred:value> \"191\"^^xsd:double .   }"
  },
  {
    "qid": "train_3097",
    "input_seq": "Is 김윤진 the native name of Yunjin Kim ?",
    "target_seq": "ASK { ?e <pred:name> \"Yunjin Kim\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"김윤진\" .  }"
  },
  {
    "qid": "train_3098",
    "input_seq": "What is the connection between coconut milk to alpha-tocopherol?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"coconut milk\" . ?e_2 <pred:name> \"alpha-tocopherol\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3099",
    "input_seq": "What video game is an adaptive work from the film whose release date is 2006-07-28 in Sweden?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e_1 <derivative_work> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-07-28\"^^xsd:date . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .   }"
  },
  {
    "qid": "train_3101",
    "input_seq": "Between Sailor Moon S: The Movie or Renaissance, released on 2006-01-01, which is shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sailor Moon S: The Movie\" . } UNION { ?e <pred:name> \"Renaissance\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3102",
    "input_seq": "How is Spyglass Entertainment related to Gary Barber?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Spyglass Entertainment\" . ?e_2 <pred:name> \"Gary Barber\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3103",
    "input_seq": "Is the origination date of the music genre whose famous person is Tom Waits after the year 1939?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"music genre\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Tom Waits\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1939 ) .  }"
  },
  {
    "qid": "train_3104",
    "input_seq": "Which one of the chemical elements discovered in a year other than 1755 is the lightest ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical element\" . ?e <time_of_discovery_or_invention> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 1755 ) . ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3105",
    "input_seq": "What's the official website of the MTV Video Music Award that Lil' Kim won?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e <winner> ?e_1 . ?e_1 <pred:name> \"Lil' Kim\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3106",
    "input_seq": "Which Latin American Democracy has the largest nominal GDP per capita.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"Latin America\" .  ?e <nominal_GDP_per_capita> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3107",
    "input_seq": "what is the number of universities that are a part of higher education institution that has the official website http://www.london.ac.uk",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <part_of> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"higher education institution\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.london.ac.uk\" .   }"
  },
  {
    "qid": "train_3108",
    "input_seq": "How is noise pop related to Pixies?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"noise pop\" . ?e_2 <pred:name> \"Pixies\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3109",
    "input_seq": "Is the date of birth not in 1948 for the person with ISNI 0000 0001 1499 3961?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1499 3961\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1948 ) .  }"
  },
  {
    "qid": "train_3110",
    "input_seq": "Does the person with a NLC authorities code of 000185499 have a CANTIC-ID equal of a10433399?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <NLC_authorities> ?pv_1 . ?pv_1 <pred:value> \"000185499\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10433399\" .  }"
  },
  {
    "qid": "train_3111",
    "input_seq": "Of all the comedies in the situation comedy genre, which was the most episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"situation comedy\" .  ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3112",
    "input_seq": "Which area is larger, Champagne-Ardenne or Poitou-Charentes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Champagne-Ardenne\" .  } UNION { ?e <pred:name> \"Poitou-Charentes\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3113",
    "input_seq": "Does The King's Speech or In America have the greater duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The King's Speech\" .  } UNION { ?e <pred:name> \"In America\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3114",
    "input_seq": "How are Cliffhanger and terrorism related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cliffhanger\" . ?e_2 <pred:name> \"terrorism\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3115",
    "input_seq": "Which work by Lee Garmes earned an Academy Award for Best Cinematography?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lee Garmes\" . ?e_2 <pred:name> \"Academy Award for Best Cinematography\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3116",
    "input_seq": "Does the website www.alleniverson3.net represent the person with the Twitter handle alleniverson?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"alleniverson\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.alleniverson3.net/\" .  }"
  },
  {
    "qid": "train_3117",
    "input_seq": "When was 225221 the population of the city of the United States that is the headquarter location of University of Nevada, Reno (the postal code of this statement is 89557) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <headquarters_location> ?e . ?e_1 <pred:name> \"University of Nevada, Reno\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e ] <postal_code> ?qpv_1 . ?qpv_1 <pred:value> \"89557\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"225221\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3118",
    "input_seq": "Is the OCLC control number of the literary work that derives Harry Potter and the Order of the Phoenix (which has origins from United States of America) 2714770?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e_1 <based_on> ?e . ?e_1 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_1 <country_of_origin> ?e_2 . ?e_2 <pred:name> \"United States of America\" .  ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"2714770\" .  }"
  },
  {
    "qid": "train_3119",
    "input_seq": "Is  Corporate Number (Japan) of Shueisha equal to 9000020281000 ?",
    "target_seq": "ASK { ?e <pred:name> \"Shueisha\" . ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"9000020281000\" .  }"
  },
  {
    "qid": "train_3120",
    "input_seq": "How is the movie New Year's Eve, which had Hilary Swank as a cast member, related to the romantic comedy genre?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Year's Eve\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Hilary Swank\" . ?e_2 <pred:name> \"romantic comedy\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3121",
    "input_seq": "Which has a greater above sea level elevation, Richmond (whose above sea level elevation is 28 metres) or Savannah (the birthplace of Stacy Keach)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Richmond\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"28\"^^xsd:double . } UNION { ?e <pred:name> \"Savannah\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Stacy Keach\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3122",
    "input_seq": "How much area is occupied by the US city bordering Highland Park, founded in 1869?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Highland Park\" . ?e_1 <inception> ?pv_1 . ?pv_1 <pred:year> 1869 . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_3123",
    "input_seq": "Is C0007806 the UMLS CUI for the bodily fluid whose TA98 Latin term is liquor cerebrospinalis?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"body fluid\" . ?e <TA98_Latin_term> ?pv_1 . ?pv_1 <pred:value> \"liquor cerebrospinalis\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0007806\" .  }"
  },
  {
    "qid": "train_3124",
    "input_seq": "How many regions of Italy share a border with the region of Italy whose capital is Genoa?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of Italy\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"region of Italy\" . ?e_2 <capital_of> ?e_1 . ?e_2 <pred:name> \"Genoa\" .   }"
  },
  {
    "qid": "train_3125",
    "input_seq": "Of New York cities with under 47000 in population, which is lowest in elevation?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"47000\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  }
]