[
  {
    "qid": "train_0",
    "input_seq": "Which town has a TOID of 4000000074573917 and has an OS grid reference of SP8778?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074573917\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SP8778\" .  }"
  },
  {
    "qid": "train_1",
    "input_seq": "Who is the reviewer of the Georgia national football team, which is ranked 78th?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Georgia national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"78\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <review_score_by> ?qpv .  }"
  },
  {
    "qid": "train_2",
    "input_seq": "Is the name of the person that was educated at high school Laura Linney?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"high school\" .  ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Laura Linney\" .  }"
  },
  {
    "qid": "train_3",
    "input_seq": "Which area has higher elevation (above sea level), Baghdad or Jerusalem (the one whose population is 75200)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Baghdad\" . } UNION { ?e <pred:name> \"Jerusalem\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"75200\"^^xsd:double . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4",
    "input_seq": "When was the person with ISNI 0000 0001 2136 4821 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2136 4821\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_5",
    "input_seq": "For what was John Houseman (who is in the Jewish ethnic group) nominated for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"John Houseman\" . ?e_1 <ethnic_group> ?e_3 . ?e_3 <pred:name> \"Jewish people\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_6",
    "input_seq": "When did the big city whose postal code is 54000 have a population of 104072?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"54000\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"104072\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_7",
    "input_seq": "Is http://www.cheechandchong.com Eve Myles's official website?",
    "target_seq": "ASK { ?e <pred:name> \"Eve Myles\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cheechandchong.com\" .  }"
  },
  {
    "qid": "train_8",
    "input_seq": "What has alternative rock in common with Greg Graffin?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"alternative rock\" . ?e_2 <pred:name> \"Greg Graffin\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_9",
    "input_seq": "Is Elias Koteas the name in native language of the person with ISNI 0000 0001 0893 552X?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0893 552X\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Elias Koteas\" .  }"
  },
  {
    "qid": "train_10",
    "input_seq": "When did Gregg Allman stop being the spouse of Cher (the one whose birth name is Cherilyn Sarkisian)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gregg Allman\" . ?e_2 <pred:name> \"Cher\" . ?e_2 <birth_name> ?pv . ?pv <pred:value> \"Cherilyn Sarkisian\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_11",
    "input_seq": "How many towns' postal code is VLT and area is less than 530 square miles?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <postal_code> ?pv . ?pv <pred:value> \"VLT\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square mile\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"530\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_12",
    "input_seq": "What number of sovereign states have a population not equal to 7600000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"7600000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_13",
    "input_seq": "How many neighborhoods have a population not 500000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"500000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_14",
    "input_seq": "What is the academic degree Vladimir Nabokov achieved at Trinity College (the one that is the education place of George V) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Vladimir Nabokov\" . ?e_2 <pred:name> \"Trinity College\" . ?e_3 <educated_at> ?e_2 . ?e_3 <pred:name> \"George V\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <academic_degree> ?qpv .  }"
  },
  {
    "qid": "train_15",
    "input_seq": "What is the Twitter username of the US city whose Dewey Decimal Classification is 2--797772 ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--797772\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_16",
    "input_seq": "What is the edition number of the 63rd Golden Globe Awards?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"63rd Golden Globe Awards\" . ?e <edition_number> ?pv .  }"
  },
  {
    "qid": "train_17",
    "input_seq": "tell me the relationship between Speed which has the original language Hindi, and Hindi",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Speed\" . ?e_1 <original_language_of_film_or_TV_show> ?e_3 . ?e_3 <pred:name> \"Hindi\" . ?e_2 <pred:name> \"Hindi\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_18",
    "input_seq": "Does the film, whose official website is http://www.lovelybones.com, have a duration greater than 60 minutes?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.lovelybones.com\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v > \"60\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_19",
    "input_seq": "When did  Craig Rocastle stop being a member of Dover Athletic F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Craig Rocastle\" . ?e_2 <pred:name> \"Dover Athletic F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_20",
    "input_seq": "Regarding Paul (who influenced Thomas Aquinas), does he or she have the name John Kander in native language?",
    "target_seq": "ASK { ?e <pred:name> \"Paul\" . ?e_1 <influenced_by> ?e . ?e_1 <pred:name> \"Thomas Aquinas\" .  ?e <name_in_native_language> ?pv . ?pv <pred:value> \"John Kander\" .  }"
  },
  {
    "qid": "train_21",
    "input_seq": "How many keyboard instruments are used by Jim Jonsin",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"keyboard instrument\" . ?e_1 <instrument> ?e . ?e_1 <pred:name> \"Jim Jonsin\" .   }"
  },
  {
    "qid": "train_22",
    "input_seq": "Is the inception time not in 1895 for the basketball team that has member Jack Thompson (whose height is 185 centimetres)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Jack Thompson\" . ?e_1 <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"185\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1895 ) .  }"
  },
  {
    "qid": "train_23",
    "input_seq": "How many industry computer languages are related to UNIX?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e_1 <language_of_work_or_name> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"industry\" . ?e_1 <relative> ?e_2 . ?e_2 <pred:name> \"Unix\" .   }"
  },
  {
    "qid": "train_24",
    "input_seq": "Does X-Men: The Last Stand or I Love You Phillip Morris have the shorter runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"X-Men: The Last Stand\" .  } UNION { ?e <pred:name> \"I Love You Phillip Morris\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_25",
    "input_seq": "What language pertains to the http://www.gene.com website regarding the agent with a 0000 0004 0465 1775 ISNI?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0465 1775\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.gene.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_26",
    "input_seq": "Rosarino is the demonym of which city?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <demonym> ?pv . ?pv <pred:value> \"Rosarino\" .  }"
  },
  {
    "qid": "train_27",
    "input_seq": "Among the feature films with a publication date after 2003, which one has the smallest duration?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 2003 ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_28",
    "input_seq": "What video game genre has the OLAC video game genre vocabulary ID 1065 and the IAB code 689?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game genre\" . ?e <OLAC_video_game_genre_vocabulary> ?pv . ?pv <pred:value> \"1065\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"689\" .  }"
  },
  {
    "qid": "train_29",
    "input_seq": "Which has fewer seasons, Twin Peaks (the one that has Jim Belushi as a cast member) or The Office (the one that has Martin Freeman as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Twin Peaks\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jim Belushi\" .   } UNION { ?e <pred:name> \"The Office\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Martin Freeman\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_30",
    "input_seq": "Tell me the person who is the screenwriter of Pleasantville  (the one that has Don Knotts as a cast member)",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"Pleasantville\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Don Knotts\" .   }"
  },
  {
    "qid": "train_31",
    "input_seq": "What is the ISNI of John Broome (the one born in 1738-01-01)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John Broome\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1738-01-01\"^^xsd:date . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_32",
    "input_seq": "Who was educated at Phillips Exeter Academy and that has the occupation of lawyer ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"Phillips Exeter Academy\" .  ?e <occupation> ?e_2 . ?e_2 <pred:name> \"lawyer\" .  }"
  },
  {
    "qid": "train_33",
    "input_seq": "What language is http://sydneyolympicfc.com.au, the official website of an association football club whose Instagram username is sofc1957?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"sofc1957\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://sydneyolympicfc.com.au/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_34",
    "input_seq": "What number of National Basketball Association Drafts took place after 2006?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"National Basketball Association Draft\" . ?e <point_in_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2006 ) .  }"
  },
  {
    "qid": "train_35",
    "input_seq": "What place has less area, Huntsville or Poughkeepsie?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Huntsville\" .  } UNION { ?e <pred:name> \"Poughkeepsie\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_36",
    "input_seq": "What is the publication date of Medal of Honor (the one whose distribution format is DVD) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Medal of Honor\" . ?e <distribution> ?e_1 . ?e_1 <pred:name> \"DVD\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_37",
    "input_seq": "Did Batman Begins released in Italy or Tootsie cost less?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Batman Begins\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Italy\" .   } UNION { ?e <pred:name> \"Tootsie\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_38",
    "input_seq": "What is LeVar Burton's role in Star Trek: First Contact?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Star Trek: First Contact\" . ?e_2 <pred:name> \"LeVar Burton\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_39",
    "input_seq": "What is the Iconclass notation of treasurer?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"treasurer\" . ?e <Iconclass_notation> ?pv .  }"
  },
  {
    "qid": "train_40",
    "input_seq": "Which is longer, Sherlock Holmes published on 1932-01-01 or Gulliver's Travels produced by Paramount Pictures?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sherlock Holmes\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1932-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"Gulliver's Travels\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Paramount Pictures\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_41",
    "input_seq": "Were the Hamilton Tiger-Cats founded after 1958?",
    "target_seq": "ASK { ?e <pred:name> \"Hamilton Tiger-Cats\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1958 ) .  }"
  },
  {
    "qid": "train_42",
    "input_seq": "What is the series ordinal of Hercules that features Paul Shaffer as a voice actor and whose composer is Alan Menken?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hercules\" . ?e_1 <composer> ?e_3 . ?e_3 <pred:name> \"Alan Menken\" . ?e_2 <pred:name> \"Paul Shaffer\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }"
  },
  {
    "qid": "train_43",
    "input_seq": "When did the California county that has the capital Redding have a population of 177284?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Redding\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"177284\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_44",
    "input_seq": "Which movie made more at the box office, Unstoppable (the one whose release region is United States of America) or You Don't Mess with the Zohan?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Unstoppable\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"You Don't Mess with the Zohan\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_45",
    "input_seq": "September, born as Petra Linnea Paula Marklund, has which birth city?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"September\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Petra Linnea Paula Marklund\" .   }"
  },
  {
    "qid": "train_46",
    "input_seq": "Is the height of Iron Man, which is a significant work from John Romita Jr., higher than 1.7 metres?",
    "target_seq": "ASK { ?e <pred:name> \"Iron Man\" . ?e_1 <notable_work> ?e . ?e_1 <pred:name> \"John Romita Jr.\" .  ?e <height> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1.7\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_47",
    "input_seq": "Does Pierce County that is located in Washington or Grays Harbor County have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pierce County\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Washington\" .   } UNION { ?e <pred:name> \"Grays Harbor County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_48",
    "input_seq": "What is the relationship between Frankenstein (the one whose genre is romance film) and Switzerland?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Frankenstein\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"romance film\" . ?e_2 <pred:name> \"Switzerland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_49",
    "input_seq": "Is the nominal GDP of Guinea-Bissau over 69000000 United States dollars on the date 1996-01-01?",
    "target_seq": "ASK { ?e <pred:name> \"Guinea-Bissau\" . ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> ?v . FILTER ( ?v > \"69000000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"1996-01-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_50",
    "input_seq": "What is the connection between Carlos Ruiz (the one that is a member of Puebla F.C.) to Puebla F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Carlos Ruiz\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Puebla F.C.\" . ?e_2 <pred:name> \"Puebla F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_51",
    "input_seq": "Was the movie titled Red Dragon released later than 2001 in Germany?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Red Dragon\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2001 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_52",
    "input_seq": "What did Kelly Rowland share the Grammy Award for Best Rap/Sung Performance with?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kelly Rowland\" . ?e_2 <pred:name> \"Grammy Award for Best Rap/Sung Performance\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <together_with> ?qpv .  }"
  },
  {
    "qid": "train_53",
    "input_seq": "Is the elevation above sea level for the capital city of Guyana less than 130 meters?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <capital_of> ?e_1 . ?e_1 <pred:name> \"Guyana\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"130\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_54",
    "input_seq": "What is the connection between Touchstone Pictures to Walt Disney Studios Motion Pictures?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Touchstone Pictures\" . ?e_2 <pred:name> \"Walt Disney Studios Motion Pictures\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_55",
    "input_seq": "Which administrative territorial entity occupying over 270 square km has Davenport as its capital?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"270\"^^xsd:double ) . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Davenport\" .  }"
  },
  {
    "qid": "train_56",
    "input_seq": "What is the publication region of the film whose official website is http://constantinemovie.warnerbros.com/ and release date is 2005-02-17?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://constantinemovie.warnerbros.com/\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-02-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_58",
    "input_seq": "How many public educational institutions of the United States are located in Lexington (whose establishment date is in 1777) and are the educational site of Michael Collins whose occupation is military officer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public educational institution of the United States\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Lexington\" . ?e_1 <inception> ?pv . ?pv <pred:year> 1777 .  ?e_2 <educated_at> ?e . ?e_2 <pred:name> \"Michael Collins\" . ?e_2 <occupation> ?e_3 . ?e_3 <pred:name> \"military officer\" .  }"
  },
  {
    "qid": "train_59",
    "input_seq": "How many scientists have the same occupation as the person who has an official website found at http://www.rogerdmoore.ca?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e_1 <occupation> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.rogerdmoore.ca\" .   }"
  },
  {
    "qid": "train_60",
    "input_seq": "Does the Twitter username johnmturturro belong to the Golden State Warriors?",
    "target_seq": "ASK { ?e <pred:name> \"Golden State Warriors\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"johnmturturro\" .  }"
  },
  {
    "qid": "train_61",
    "input_seq": "What large city is the twinned administrative body of Liverpool (whose population is 513441), having a start date in the year 1952?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Liverpool\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"513441\"^^xsd:double .  [ <pred:fact_h> ?e ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1952 .  }"
  },
  {
    "qid": "train_62",
    "input_seq": "Which movie is longer, The Chronicles of Narnia: The Voyage of the Dawn Treader (the one that has Simon Pegg as a cast member) or The Brothers Bloom?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Chronicles of Narnia: The Voyage of the Dawn Treader\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Simon Pegg\" .   } UNION { ?e <pred:name> \"The Brothers Bloom\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_63",
    "input_seq": "Tell me the one with a smaller duration, Love Story  (which is entititled Una storia d'amore) or full Metal Jacket.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Love Story\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Una storia d'amore\" . } UNION { ?e <pred:name> \"Full Metal Jacket\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_64",
    "input_seq": "Which is shorter, Velvet Goldmine or The Great Gatsby starring Robert Redford?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Velvet Goldmine\" .  } UNION { ?e <pred:name> \"The Great Gatsby\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Robert Redford\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_65",
    "input_seq": "Rocco and His Brothers is related in what way to Nino Rota?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rocco and His Brothers\" . ?e_2 <pred:name> \"Nino Rota\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_66",
    "input_seq": "Which higher education institution located in the Netherlands has the official website http://www.leiden.nl/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"municipality of the Netherlands\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.leiden.nl/\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_1 ] <country> ?qpv . ?qpv <pred:value> \"Netherlands\" .  }"
  },
  {
    "qid": "train_67",
    "input_seq": "What is the ISNI for Claire Forlani?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Claire Forlani\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_68",
    "input_seq": "For which work was Fred Astaire awarded the BAFTA Award for Best Actor in a Supporting Role?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"BAFTA Award for Best Actor in a Supporting Role\" . ?e_2 <pred:name> \"Fred Astaire\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_69",
    "input_seq": "When did Tom Johnson (the one that is educated at Harvard University) stop being an employee of CNN?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tom Johnson\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"Harvard University\" . ?e_2 <pred:name> \"CNN\" . ?e_1 <employer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <employer> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_70",
    "input_seq": "What is the street address of the California Institute of the Arts?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"California Institute of the Arts\" . ?e <located_at_street_address> ?pv .  }"
  },
  {
    "qid": "train_71",
    "input_seq": "Public Enemies, composed by Elliot Goldenthal, was released in what location on its publication date, 2009-07-16?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Public Enemies\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Elliot Goldenthal\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2009-07-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_72",
    "input_seq": "Where is the visual artwork titled \"A Civil Action\" that was published on April 22, 1999 published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"A Civil Action\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-04-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_73",
    "input_seq": "What number of animated movies were published after 1940?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1940 ) .  }"
  },
  {
    "qid": "train_74",
    "input_seq": "What is the connection between The Matrix Revolutions to California (the one whose CANTIC-ID is a11459566)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Matrix Revolutions\" . ?e_2 <pred:name> \"California\" . ?e_2 <CANTIC-ID> ?pv . ?pv <pred:value> \"a11459566\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_75",
    "input_seq": "Does the soccer club in Hamburg use the Instagram name fcstpauli ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Hamburg\" .  ?e <Instagram_username> ?pv . ?pv <pred:value> \"fcstpauli\" .  }"
  },
  {
    "qid": "train_76",
    "input_seq": "How many sports are included in the modern pentathlon or designated by IAB code 498?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" .  { ?e_1 <has_part> ?e . ?e_1 <pred:name> \"modern pentathlon\" .  } UNION { ?e <IAB_code> ?pv . ?pv <pred:value> \"498\" .  } }"
  },
  {
    "qid": "train_77",
    "input_seq": "What was based on The Lion King (released in the USA)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"The Lion King\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"United States of America\" .   }"
  },
  {
    "qid": "train_78",
    "input_seq": "How are the Pittsburgh Steelers related to the Pittsburgh where David O. Selznick was born?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pittsburgh Steelers\" . ?e_2 <pred:name> \"Pittsburgh\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"David O. Selznick\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_79",
    "input_seq": "Which administrative territorial entity has the GSS code (2011) of S12000006?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <GSS_code_(2011)> ?pv . ?pv <pred:value> \"S12000006\" .  }"
  },
  {
    "qid": "train_80",
    "input_seq": "Which person's Twitter username is theharryshearer?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"theharryshearer\" .  }"
  },
  {
    "qid": "train_81",
    "input_seq": "Does literature-based film The Fugitive clock in at over 3900 seconds ?",
    "target_seq": "ASK { ?e <pred:name> \"The Fugitive\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"film based on literature\" .  ?e <duration> ?pv . ?pv <pred:unit> \"second\" . ?pv <pred:value> ?v . FILTER ( ?v > \"3900\"^^xsd:double ) .  }"
  }
]