[
  {
    "qid": "train_1635",
    "input_seq": "What has less area, County Monaghan or County Limerick?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"County Monaghan\" .  } UNION { ?e <pred:name> \"County Limerick\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1636",
    "input_seq": "Which is larger in size physically, Champaign County (population 203435) or Peoria County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Champaign County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"203435\"^^xsd:double . } UNION { ?e <pred:name> \"Peoria County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1637",
    "input_seq": "Which one, New Britain or Newburyport, has greater area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"New Britain\" .  } UNION { ?e <pred:name> \"Newburyport\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1638",
    "input_seq": "Where was the visual artwork that has Russi Taylor as a cast member published on 1995-12-07?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Russi Taylor\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1995-12-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1639",
    "input_seq": "Which political party has the Twitter username Greens (the subscription number of this statement is 87368) and the official website at http://www.greens.org.au/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Greens\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"87368\"^^xsd:double . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.greens.org.au/\" .  }"
  },
  {
    "qid": "train_1640",
    "input_seq": "What is the run-time of the English-language Anna Karenina?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Anna Karenina\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1641",
    "input_seq": "Was the Jane Eyre that includes George C. Scott in its cast published later than 1933?",
    "target_seq": "ASK { ?e <pred:name> \"Jane Eyre\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"George C. Scott\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1933 ) .  }"
  },
  {
    "qid": "train_1642",
    "input_seq": "Who has fewer children, David Guetta or Mark Hamill?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"David Guetta\" .  } UNION { ?e <pred:name> \"Mark Hamill\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1643",
    "input_seq": "Does Andorra or South Korea have a greater area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Andorra\" .  } UNION { ?e <pred:name> \"South Korea\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1644",
    "input_seq": "What language is used with http://abc.go.com/shows/modern-family, the official websites of the TV series whose Instagram username is abcmodernfarm ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"abcmodernfam\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://abc.go.com/shows/modern-family\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1645",
    "input_seq": "Was a person, who died on 23rd July 1901, born before 1922 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1901-07-23\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1922 ) .  }"
  },
  {
    "qid": "train_1646",
    "input_seq": "Is the episode count not 6300 for Anger Management whose end time is 2014-12-22?",
    "target_seq": "ASK { ?e <pred:name> \"Anger Management\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2014-12-22\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"6300\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1647",
    "input_seq": "What entity of rock music is the genre of a band whose origin lies in France ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock music\" . ?e_1 <genre> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"band\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"France\" .   }"
  },
  {
    "qid": "train_1648",
    "input_seq": "Who was the Academy Award winning Best Supporting Actress of 1975?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Academy Award for Best Supporting Actress\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 1975 .  }"
  },
  {
    "qid": "train_1649",
    "input_seq": "What is the connection between Kentucky (the one that mainly depicts horse) to drama film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kentucky\" . ?e_1 <main_subject> ?e_3 . ?e_3 <pred:name> \"horse\" . ?e_2 <pred:name> \"drama film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1650",
    "input_seq": "Where was the movie with exploitation visa number, publication date is 2007-08-09, 95782 published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"95782\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-08-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1651",
    "input_seq": "Which island, whose population is greater than 630000, has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"630000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1652",
    "input_seq": "Which big city's postal code is 14000?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <postal_code> ?pv . ?pv <pred:value> \"14000\" .  }"
  },
  {
    "qid": "train_1653",
    "input_seq": "Which movie is longer, Superman II: The Richard Donner Cut or The Merry Widow (the one that origins from Austria)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Superman II: The Richard Donner Cut\" .  } UNION { ?e <pred:name> \"The Merry Widow\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Austria\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1654",
    "input_seq": "How many subscribers does the human whose native language name is Jack Huston have under the Twitter username thejackhuston?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Jack Huston\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"thejackhuston\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1655",
    "input_seq": "What is the time period that 1147782 is the number of out-of-school children in the republic whose INSEE countries and foreign territories code is 99310?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <INSEE_countries_and_foreign_territories_code> ?pv_1 . ?pv_1 <pred:value> \"99310\" . ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1147782\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_out-of-school_children> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1656",
    "input_seq": "What person's British Museum person-institution is 90959?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"90959\" .  }"
  },
  {
    "qid": "train_1657",
    "input_seq": "What is the topic of the statement that The Barbarian Invasions was nominated for an Academy Award for Best Foreign Language Film?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Barbarian Invasions\" . ?e_2 <pred:name> \"Academy Award for Best Foreign Language Film\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1658",
    "input_seq": "Which major incident is associated with the release date of The White Ribbon, 2009-05-21?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The White Ribbon\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-05-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <significant_event> ?qpv .  }"
  },
  {
    "qid": "train_1659",
    "input_seq": "Is Bruce Springsteen's pseudonym Marlene Dietrich ?",
    "target_seq": "ASK { ?e <pred:name> \"Bruce Springsteen\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Marlene Dietrich\" .  }"
  },
  {
    "qid": "train_1660",
    "input_seq": "What is the number of National Football League Drafts that have the Los Angeles Rams as participants?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"National Football League Draft\" . ?e <participant> ?e_1 . ?e_1 <pred:name> \"Los Angeles Rams\" .   }"
  },
  {
    "qid": "train_1661",
    "input_seq": "Is the dissolution date after 1947 for the record label whose ISNI is 0000 0000 9007 2673?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 9007 2673\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1947 ) .  }"
  },
  {
    "qid": "train_1662",
    "input_seq": "Who is taller, David Arnold (the one that is educated at University of Michigan) or Orlando Bloom?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"David Arnold\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"University of Michigan\" .   } UNION { ?e <pred:name> \"Orlando Bloom\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1663",
    "input_seq": "Is QR the short name for wide receiver?",
    "target_seq": "ASK { ?e <pred:name> \"wide receiver\" . ?e <short_name> ?pv . ?pv <pred:value> \"QR\" .  }"
  },
  {
    "qid": "train_1664",
    "input_seq": "Which movie made less at the box office, Tangled (the one whose release region is Germany) or Rise of the Guardians?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tangled\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Germany\" .   } UNION { ?e <pred:name> \"Rise of the Guardians\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1665",
    "input_seq": "What is the ISNI of the person nominated for MTV Movie Award for Best Song from a Movie (the point in time of this statement is 1999)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"MTV Movie Award for Best Song from a Movie\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1999 . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1666",
    "input_seq": "Which movie is longer, The Rocky Horror Picture Show or Big Fish?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Rocky Horror Picture Show\" .  } UNION { ?e <pred:name> \"Big Fish\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1667",
    "input_seq": "Brazil, with a nominal GDP value of 437798577639.752 USD, is in what diplomatic relationship with the African Union?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brazil\" . ?e_1 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"437798577639.752\"^^xsd:double . ?e_2 <pred:name> \"African Union\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1668",
    "input_seq": "What number of Primetime Emmy Awards did St. Elsewhere win?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"St. Elsewhere\" .   }"
  },
  {
    "qid": "train_1669",
    "input_seq": "Among the counties of California with the population above 45,000, which one is the largest by area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"45000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1670",
    "input_seq": "Who has more children, Edward Burns or George Washington (the one whose height is 74 inch)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Edward Burns\" . } UNION { ?e <pred:name> \"George Washington\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"inch\" . ?pv_1 <pred:value> \"74\"^^xsd:double . } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1672",
    "input_seq": "When was the Academy Award for Best Documentary Feature nominated to Malcolm X , released on 1972-01-01?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Malcolm X\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1972-01-01\"^^xsd:date . ?e_2 <pred:name> \"Academy Award for Best Documentary Feature\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1673",
    "input_seq": "What is the ARCHON code of the university headquartered in London (the one whose population is 366151)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"London\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"366151\"^^xsd:double . ?e <ARCHON_code> ?pv .  }"
  },
  {
    "qid": "train_1674",
    "input_seq": "For the human whose official site is http://www.axl-one.com/talent/morikawa.html, his/her Twitter username is moriax291, how numerous supporters does the client have",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.axl-one.com/talent/morikawa.html\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"moriax291\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1675",
    "input_seq": "Which has the most area among the Oregon counties whose population is more than 45000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"45000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1676",
    "input_seq": "Which movie is longer, Hercules (the one that has Amanda Plummer as a voice actor) or Madagascar 3: Europe's Most Wanted?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hercules\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Amanda Plummer\" .   } UNION { ?e <pred:name> \"Madagascar 3: Europe's Most Wanted\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1677",
    "input_seq": "Which person's name in her native language is Kathrin Romary Beckinsale?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Kathrin Romary Beckinsale\" .  }"
  },
  {
    "qid": "train_1678",
    "input_seq": "Was an association football club, headquartered in Ipswich, where Ralph Fiennes was born, founded in 300 B.C. ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Ipswich\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Ralph Fiennes\" .  ?e <inception> ?pv . ?pv <pred:year> -300 .  }"
  },
  {
    "qid": "train_1679",
    "input_seq": "Which has more area, Saxony-Anhalt that is located in the German Democratic Republic or the Australian Capital Territory?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Saxony-Anhalt\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"German Democratic Republic\" .   } UNION { ?e <pred:name> \"Australian Capital Territory\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1680",
    "input_seq": "What is the connection between Saint Louis University to Missouri?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saint Louis University\" . ?e_2 <pred:name> \"Missouri\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1681",
    "input_seq": "Which place has less mains voltage, Tanzania or Mozambique?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mozambique\" .  } UNION { ?e <pred:name> \"Tanzania\" .  } ?e <mains_voltage> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1682",
    "input_seq": "When did the city with the official website www.tampere.fi have a population numbering 217,421?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tampere.fi\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"217421\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1683",
    "input_seq": "Which one has less elevation above sea level between Worcester (the one that is the origin of the name Worcester County) or Somerville (the one whose area is 10.936893 square kilometers)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Worcester\" . ?e_1 <named_after> ?e . ?e_1 <pred:name> \"Worcester County\" . } UNION { ?e <pred:name> \"Somerville\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"10.936893\"^^xsd:double . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1684",
    "input_seq": "What is the relation between The Ring (the one whose total sale was 249348933 United States dollars) and Jane Alexander (the one whose ISNI is 0000 0001 0800 408X)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Ring\" . ?e_1 <box_office> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"249348933\"^^xsd:double . ?e_2 <pred:name> \"Jane Alexander\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0800 408X\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1685",
    "input_seq": "Is the street address of the higher education institution with the postal code of 91125 College Ave, Lancaster, PA, 17604-3003 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"91125\" . ?e <located_at_street_address> ?pv . ?pv <pred:value> \"College Ave, Lancaster, PA, 17604-3003\" .  }"
  },
  {
    "qid": "train_1686",
    "input_seq": "What is the connection between Cleopatra (the one whose country is United States of America) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cleopatra\" . ?e_1 <country> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1687",
    "input_seq": "What is the connection between Dark Shadows (the one that is originally aired on American Broadcasting Company) to Dan Curtis?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dark Shadows\" . ?e_1 <original_network> ?e_3 . ?e_3 <pred:name> \"American Broadcasting Company\" . ?e_2 <pred:name> \"Dan Curtis\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1688",
    "input_seq": "Which person is an executive producer of A Christmas Carol (the one that has Chuck Jones as an executive producer) and has http://www.chuckjones.com/ as his or her official website?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.chuckjones.com/\" . ?e_1 <executive_producer> ?e . ?e_1 <pred:name> \"A Christmas Carol\" . ?e_1 <executive_producer> ?e_2 . ?e_2 <pred:name> \"Chuck Jones\" .  }"
  },
  {
    "qid": "train_1689",
    "input_seq": "Orlando Bloom was cast as what character on Pirates of the Caribbean: At World's End ( nominated for a Saturn Award for Best Costume)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pirates of the Caribbean: At World's End\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Saturn Award for Best Costume\" . ?e_2 <pred:name> \"Orlando Bloom\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1690",
    "input_seq": "Who is the voice actor in, Where the Wild Things Are (the one whose director is Spike Jonze), which has Catherine Keener as a cast member?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Where the Wild Things Are\" . ?e_1 <director> ?e_3 . ?e_3 <pred:name> \"Spike Jonze\" . ?e_2 <pred:name> \"Catherine Keener\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <voice_actor> ?qpv .  }"
  },
  {
    "qid": "train_1691",
    "input_seq": "What was the release location of the visual artwork with exploitation visa number 149665 on its publication date, 2018-10-24?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"149665\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2018-10-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1692",
    "input_seq": "Which university affiliated with the English-language website www1.villanova.edu/content/main.html  is the alma mater of Jon Polito?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www1.villanova.edu/content/main.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Jon Polito\" .  }"
  },
  {
    "qid": "train_1693",
    "input_seq": "For the United States city which has the native name Flagstaff, at what time point is its population 45857?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Flagstaff\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"45857\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1694",
    "input_seq": "What is the connection between Johns Hopkins University to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Johns Hopkins University\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1695",
    "input_seq": "Does Gabon or Denmark have less total reserves?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Gabon\" .  } UNION { ?e <pred:name> \"Denmark\" .  } ?e <total_reserves> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1696",
    "input_seq": "What learned society is quartered in a city other than Westminster?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"learned society\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"district with city status\" . ?e_2 <different_from> ?e_1 . ?e_2 <pred:name> \"Westminster\" .   }"
  },
  {
    "qid": "train_1697",
    "input_seq": "What capital equals the capital of the nation, that has a diplomatic relationship with Algeria (the subject of this statement is Algeria–Cyprus relations)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e_1 <capital> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <diplomatic_relation> ?e_1 . ?e_2 <pred:name> \"Algeria\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Algeria–Cyprus relations\" .   }"
  },
  {
    "qid": "train_1698",
    "input_seq": "Among the infectious diseases whose death number is less than 960000, which has the largest death number?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"infectious disease\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"960000\"^^xsd:double ) . ?e <number_of_deaths> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1699",
    "input_seq": "What was the predecessor of Fahrenheit 9/11, which received the Palme d'Or?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Fahrenheit 9/11\" . ?e_2 <pred:name> \"Palme d'Or\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <follows> ?qpv .  }"
  },
  {
    "qid": "train_1700",
    "input_seq": "Which movie is shorter, A Beautiful Mind or Frankenstein (the one whose release region is Mexico)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"A Beautiful Mind\" .  } UNION { ?e <pred:name> \"Frankenstein\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Mexico\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1701",
    "input_seq": "How many kids does the Mark Gordon born on 1957-03-14 have?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mark Gordon\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1957-03-14\"^^xsd:date . ?e <number_of_children> ?pv .  }"
  },
  {
    "qid": "train_1702",
    "input_seq": "What is the length of the film titled Harry Potter and the Order of the Phoenix?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Harry Potter and the Order of the Phoenix\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1703",
    "input_seq": "Tell me how long Dune is (which is in the genre a film based on literature)",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dune\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"film based on literature\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1704",
    "input_seq": "What show has less seasons, Northern Exposure or Deadwood?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Deadwood\" .  } UNION { ?e <pred:name> \"Northern Exposure\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1705",
    "input_seq": "Which has the highest elevation above sea level among the New Jersey cities whose local dialing code is 908?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"908\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1706",
    "input_seq": "What is its CAS Registry Number for the group or class of chemical substances whose EC number is 232-503-8?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group or class of chemical substances\" . ?e <EC_number> ?pv_1 . ?pv_1 <pred:value> \"232-503-8\" . ?e <CAS_Registry_Number> ?pv .  }"
  },
  {
    "qid": "train_1707",
    "input_seq": "How is Dothan related to the USA?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dothan\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1708",
    "input_seq": "What person has the Instagram username clairedanes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"clairedanes\" .  }"
  },
  {
    "qid": "train_1709",
    "input_seq": "What is the connection between Lili Taylor to actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lili Taylor\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1710",
    "input_seq": "How is Armstrong County related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Armstrong County\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1711",
    "input_seq": "Does Avignon or Saint John (the one whose Statistics Canada Geographic code is 1301006), have less area ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Avignon\" . } UNION { ?e <pred:name> \"Saint John\" . ?e <Statistics_Canada_Geographic_code> ?pv_1 . ?pv_1 <pred:value> \"1301006\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1712",
    "input_seq": "What band was nominated for a Grammy Award for Best Rock Instrumental Performance in 2007 and has official website http://www.rush.com/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Grammy Award for Best Rock Instrumental Performance\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2007 . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.rush.com/\" .  }"
  }
]