[
  {
    "qid": "train_1800",
    "input_seq": "What television series titled Homicide: Life on the Street originally aired on NBC?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv . ?pv <pred:value> \"Homicide: Life on the Street\" . ?e <original_network> ?e_1 . ?e_1 <pred:name> \"NBC\" .  }"
  },
  {
    "qid": "train_1801",
    "input_seq": "Which has less population, Montevideo or Ipswich (whose above sea level elevation is 50 metres)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Montevideo\" . } UNION { ?e <pred:name> \"Ipswich\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"50\"^^xsd:double . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1802",
    "input_seq": "How many film festival editions are in the sovereign state country whose short name is აშშ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film festival edition\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"აშშ\" .   }"
  },
  {
    "qid": "train_1803",
    "input_seq": "Which film acquired exploitation visa number 128266 in 2011?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"128266\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv . ?qpv <pred:year> 2011 .  }"
  },
  {
    "qid": "train_1804",
    "input_seq": "What phenomenon's subreddit is nature (this statement's language is English)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <subreddit> ?pv . ?pv <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .  }"
  },
  {
    "qid": "train_1805",
    "input_seq": "Regarding the US city that has Willamette University is the native label exactly Salem?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Willamette University\" .  ?e <native_label> ?pv . ?pv <pred:value> \"Salem\" .  }"
  },
  {
    "qid": "train_1806",
    "input_seq": "Who has more children, Keira Knightley or Eve Myles?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Keira Knightley\" .  } UNION { ?e <pred:name> \"Eve Myles\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1807",
    "input_seq": "When was 227751 the population of the big city that is the release region of X-Men Origins: Wolverine (the one whose release region is Slovenia) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e_1 <film_release_region> ?e . ?e_1 <pred:name> \"X-Men Origins: Wolverine\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"Slovenia\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"227751\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1808",
    "input_seq": "What city was the person with ISNI 0000 0000 8092 0106 born in?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8092 0106\" .   }"
  },
  {
    "qid": "train_1809",
    "input_seq": "Which place has a greater population, the Dutch Republic or Vatican City?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dutch Republic\" .  } UNION { ?e <pred:name> \"Vatican City\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1810",
    "input_seq": "Which is shorter, The Man Who Knew Too Much produced by Michael Balcon or Henry V starring Ian Holm?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Man Who Knew Too Much\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Michael Balcon\" .   } UNION { ?e <pred:name> \"Henry V\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Ian Holm\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1811",
    "input_seq": "What city in the United States is different from the one with the ISNI of 0000 0004 0620 0169?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <different_from> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0620 0169\" .   }"
  },
  {
    "qid": "train_1812",
    "input_seq": "When was the samba created ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"samba\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1813",
    "input_seq": "What is the relationship between Vadivelu and India (the one whose population is 1110626108)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vadivelu\" . ?e_2 <pred:name> \"India\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1110626108\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1814",
    "input_seq": "How many non-metropolitan counties are located in the United Kingdom or are not Cornwall?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan county\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  } UNION { ?e_1 <different_from> ?e . ?e_1 <pred:name> \"Cornwall\" .  } }"
  },
  {
    "qid": "train_1815",
    "input_seq": "Which ISO 639-2 code designates the language of Eat Bulaga! ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e_1 <language_of_work_or_name> ?e . ?e_1 <pred:name> \"Eat Bulaga!\" .  ?e <ISO_639-2_code> ?pv .  }"
  },
  {
    "qid": "train_1816",
    "input_seq": "Tell me the record label that is in the Christian rock genre that that is from United States of America country",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"Christian rock\" .  ?e <country> ?e_2 . ?e_2 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_1817",
    "input_seq": "When did San Diego have a population count of 39578?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"San Diego\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"39578\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1818",
    "input_seq": "When did a sovereign state, whose ISO 3166-1 numeric code is 352, reach the nominal GDP of 17,048,647,567.6831 USD",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <ISO_3166-1_numeric_code> ?pv_1 . ?pv_1 <pred:value> \"352\" . ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"17048647567.6831\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1819",
    "input_seq": "Who is shorter in height, Amanda Lear or George Clooney?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Amanda Lear\" .  } UNION { ?e <pred:name> \"George Clooney\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1820",
    "input_seq": "What is the run-time of Fort Worth (titled Fort Worth)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fort Worth\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Fort Worth\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1821",
    "input_seq": "When was founded the University of Adelaide?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"University of Adelaide\" . ?e_2 <pred:name> \"Australia\" . ?e_3 <country_of_citizenship> ?e_2 . ?e_3 <pred:name> \"Joel Edgerton\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1822",
    "input_seq": "Is http://www.inc.in/ the official website of the political party that has Govinda as a member?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e_1 <member_of_political_party> ?e . ?e_1 <pred:name> \"Govinda\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.inc.in/\" .  }"
  },
  {
    "qid": "train_1823",
    "input_seq": "Does the television series titled A balfácán have less than 70 seasons?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"A balfácán\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"70\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1824",
    "input_seq": "What is the date of death of the human that was nominated for an Academy Award for Best Supporting Actor for The Defiant Ones?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actor\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"The Defiant Ones\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1825",
    "input_seq": "Is SanLorenzo's the Twitter username of Club Atlético San Lorenzo de Almagro?",
    "target_seq": "ASK { ?e <pred:name> \"Club Atlético San Lorenzo de Almagro\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SanLorenzo\" .  }"
  },
  {
    "qid": "train_1826",
    "input_seq": "Which sovereign state is a part of the geographic region that is the terrain feature of Puerto Rico (whose inflation rate is 0.5 percentage)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <has_part> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"geographic region\" . ?e_2 <located_on_terrain_feature> ?e_1 . ?e_2 <pred:name> \"Puerto Rico\" . ?e_2 <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"0.5\"^^xsd:double .   }"
  },
  {
    "qid": "train_1827",
    "input_seq": "When was the person with the birth name Mark Anthony Williams born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Mark Anthony Williams\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1828",
    "input_seq": "Does Patton Oswalt not have 15 children?",
    "target_seq": "ASK { ?e <pred:name> \"Patton Oswalt\" . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"15\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1829",
    "input_seq": "Who is related to the person with the pseudonym Nippy?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <relative> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <pseudonym> ?pv . ?pv <pred:value> \"Nippy\" .   }"
  },
  {
    "qid": "train_1830",
    "input_seq": "When was the United States city that Glen Ballard was born in established?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Glen Ballard\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1831",
    "input_seq": "When did French departments, bordering  Seine-et-Marne, reach the population of 539,783 people ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"departments of France\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Seine-et-Marne\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"539783\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1832",
    "input_seq": "What record label is headquartered in the special ward of Japan whose postal code is 〒105-8511 (the country of this statement is Japan)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"special ward of Japan\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"〒105-8511\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_1 ] <country> ?qpv . ?qpv <pred:value> \"Japan\" .  }"
  },
  {
    "qid": "train_1833",
    "input_seq": "Was the movie titled Gods and Monsters released prior to 2006 at the Sundance Film Festival?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Gods and Monsters\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2006 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sundance Film Festival\" .  }"
  },
  {
    "qid": "train_1834",
    "input_seq": "Of seas with Montenegro as their basin country, which is shallowest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <basin_country> ?e_1 . ?e_1 <pred:name> \"Montenegro\" .  ?e <vertical_depth> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1835",
    "input_seq": "Was the state of Germany with ISNI 0000 0004 0555 6964 founded before 1909?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0555 6964\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1909 ) .  }"
  },
  {
    "qid": "train_1836",
    "input_seq": "What is the publication territory of Madagascar: Escape 2 Africa (whose release region is the United States of America) on its release date 2008-12-04?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Madagascar: Escape 2 Africa\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2008-12-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1837",
    "input_seq": "When did the Brian Jones born as Brian Tavarus Jones join the Jacksonville Jaguars team?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brian Jones\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Brian Tavarus Jones\" . ?e_2 <pred:name> \"Jacksonville Jaguars\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1838",
    "input_seq": "Is TheOliverStone the Twitter username of the person whose ISNI is 0000 0001 0653 7579?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0653 7579\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TheOliverStone\" .  }"
  },
  {
    "qid": "train_1839",
    "input_seq": "What has a longer duration, Ryan's Daughter or G.I. Joe: Retaliation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ryan's Daughter\" .  } UNION { ?e <pred:name> \"G.I. Joe: Retaliation\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1840",
    "input_seq": "How does ISNI designate the rock band formed in Guildford, of postal code GU1-4?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Guildford\" . ?e_1 <postal_code> ?pv_1 . ?pv_1 <pred:value> \"GU1-4\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1841",
    "input_seq": "Is Ben-Hur's (the one whose release region is Sweden) official website equal to http://benhurmovie.com/?",
    "target_seq": "ASK { ?e <pred:name> \"Ben-Hur\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Sweden\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://benhurmovie.com/\" .  }"
  },
  {
    "qid": "train_1842",
    "input_seq": "When did Costa-Gavras receive the Academy Award for Best Foreign Language Film?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Costa-Gavras\" . ?e_2 <pred:name> \"Academy Award for Best Foreign Language Film\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1843",
    "input_seq": "The 66th Academy Awards followed how many Academy Awards events?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <followed_by> ?e_1 . ?e_1 <pred:name> \"66th Academy Awards\" .   }"
  },
  {
    "qid": "train_1844",
    "input_seq": "How is John Spencer (whose religion Catholic Church) related to United States Army?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Spencer\" . ?e_1 <religion> ?e_3 . ?e_3 <pred:name> \"Catholic Church\" . ?e_2 <pred:name> \"United States Army\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1845",
    "input_seq": "Where was the location of the primary school in which Robert Byrd was educated?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Robert Byrd\" . ?e_2 <pred:name> \"primary school\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <location> ?qpv .  }"
  },
  {
    "qid": "train_1846",
    "input_seq": "What is the connection between Knoxville to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Knoxville\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1847",
    "input_seq": "What is the date of death of Andy Williams (the one that is famous for jazz) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Andy Williams\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"jazz\" .  ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1848",
    "input_seq": "For the county of Texas that shares a northwest border with Denton County, what is the determination method for its population being 2408488?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Denton County\" . [ <pred:fact_h> ?e ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_1 ] <direction_relative_to_location> ?qpv_1 . ?qpv_1 <pred:value> \"northwest\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2408488\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1849",
    "input_seq": "How was it determined that Tuolumne County has a population of 53709?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Tuolumne County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"53709\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1850",
    "input_seq": "What is the local dialing code of Durham (the one whose postal code is 27715)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Durham\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"27715\" . ?e <local_dialing_code> ?pv .  }"
  },
  {
    "qid": "train_1851",
    "input_seq": "What person was nominated for a Grammy Award for Best Male Pop Vocal Performance in the year 2001?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Grammy Award for Best Male Pop Vocal Performance\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2001 .  }"
  },
  {
    "qid": "train_1852",
    "input_seq": "Brian Dennehy won a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie\" . ?e_2 <pred:name> \"Brian Dennehy\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1853",
    "input_seq": "What is the British Museum person-institution of the university whose ISNI is 0000 0001 0462 7212?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0462 7212\" . ?e <British_Museum_person-institution> ?pv .  }"
  },
  {
    "qid": "train_1854",
    "input_seq": "Which language is used on the website www.popcap.com that represents the video game developer headquartered in Seattle?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Seattle\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.popcap.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1855",
    "input_seq": "How is Zach Braff related to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Zach Braff\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1856",
    "input_seq": "What is the Twitter username of the association football club whose official website is http://www.incheonutd.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.incheonutd.com/\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_1857",
    "input_seq": "What is the elevation above sea level for the city that is the twinned administrative body of Chesterfield?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Chesterfield\" .  ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_1858",
    "input_seq": "Did \"Charmed,\" which has an official website at https://cwtv.com/shows/charmed, not begin in 2017?",
    "target_seq": "ASK { ?e <pred:name> \"Charmed\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://cwtv.com/shows/charmed\" . ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2017 ) .  }"
  },
  {
    "qid": "train_1859",
    "input_seq": "What was The Nun's Story, which was nominated for the Academy Award for Best Picture, about?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Nun's Story\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1860",
    "input_seq": "What is the official name of Fontana (founded in 1954-01-01)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fontana\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-01-01\"^^xsd:date . ?e <official_name> ?pv .  }"
  },
  {
    "qid": "train_1861",
    "input_seq": "Which movie made more money at the box office, The Last Samurai or American Psycho?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Last Samurai\" .  } UNION { ?e <pred:name> \"American Psycho\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1862",
    "input_seq": "When did Nikola Telsa win the Edison Medal?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Edison Medal\" . ?e_2 <pred:name> \"Nikola Tesla\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1863",
    "input_seq": "Is San Angelo's native language label also San Angelo ?",
    "target_seq": "ASK { ?e <pred:name> \"San Angelo\" . ?e <native_label> ?pv . ?pv <pred:value> \"San Angelo\" .  }"
  },
  {
    "qid": "train_1864",
    "input_seq": "Is the CANTIC-ID of a person, who received Filmfare Award for Best Actor (the award-winning work of this statement is Tezaab), a10741070?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Filmfare Award for Best Actor\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Tezaab\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10741070\" .  }"
  },
  {
    "qid": "train_1865",
    "input_seq": "When did Brad Bird become an employee of Pixar?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brad Bird\" . ?e_2 <pred:name> \"Pixar\" . ?e_1 <employer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <employer> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1866",
    "input_seq": "Someone with ISNI # 0000 0000 8367 8431 has which general officer rank in the military?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"general officer\" . ?e_1 <military_rank> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8367 8431\" .   }"
  },
  {
    "qid": "train_1867",
    "input_seq": "What is the connection between Cleopatra (the one whose release region is Spain) to Richard Burton?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cleopatra\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Spain\" . ?e_2 <pred:name> \"Richard Burton\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1869",
    "input_seq": "UMLS CUI code C1842408 designates which medical malady?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C1842408\" .  }"
  },
  {
    "qid": "train_1870",
    "input_seq": "When did the person whose Libris-URI is khw03fk33plpl80 die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"khw03fk33plpl80\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1871",
    "input_seq": "Which comune of Italy whose population is not 2400000000 has the lowest elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comune of Italy\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"2400000000\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1872",
    "input_seq": "What is the title of the TV movie published in 1969?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> 1969 . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_1873",
    "input_seq": "Is http://beta.reading.gov.uk/ the official website of the county town whose WOEID is 32997?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county town\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"32997\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://beta.reading.gov.uk/\" .  }"
  },
  {
    "qid": "train_1874",
    "input_seq": "Is the exploitation visa number of Spider-Man (the one whose duration is 116 minute) 61757?",
    "target_seq": "ASK { ?e <pred:name> \"Spider-Man\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"116\"^^xsd:double . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"61757\" .  }"
  },
  {
    "qid": "train_1875",
    "input_seq": "What relation does Puerto Rico—which has an ISO 3166-2 code of US-PR—have with Latin America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Latin America\" . ?e_2 <pred:name> \"Puerto Rico\" . ?e_2 <ISO_3166-2_code> ?pv . ?pv <pred:value> \"US-PR\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1876",
    "input_seq": "How is Groningen whose Dewey Decimal Classification is 2--49212 related to Europe?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Groningen\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--49212\" . ?e_2 <pred:name> \"Europe\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1877",
    "input_seq": "What is the relationship between Alice in Wonderland (the one whose composer is Ravi Shankar) to Peter Sellers?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alice in Wonderland\" . ?e_1 <composer> ?e_3 . ?e_3 <pred:name> \"Ravi Shankar\" . ?e_2 <pred:name> \"Peter Sellers\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1878",
    "input_seq": "What is the connection between Andrew Jackson (the one that was born in Los Angeles) to Iowa State University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Andrew Jackson\" . ?e_1 <place_of_birth> ?e_3 . ?e_3 <pred:name> \"Los Angeles\" . ?e_2 <pred:name> \"Iowa State University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1879",
    "input_seq": "What number of North Carolina counties are in the United States of America?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of North Carolina\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   }"
  },
  {
    "qid": "train_1880",
    "input_seq": "Which area has fewer people, Norristown or Autonomous Republic of Crimea?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Norristown\" .  } UNION { ?e <pred:name> \"Autonomous Republic of Crimea\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1881",
    "input_seq": "What person was nominated for an Academy Award for Best Supporting Actor that relates to the the award-winning work Barton Fink?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actor\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Barton Fink\" .  }"
  },
  {
    "qid": "train_1882",
    "input_seq": "How many research universities were founded in 1908 and with an ISNI is 0000 0004 1937 1119?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"research university\" . ?e <inception> ?pv . ?pv <pred:year> 1908 . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1937 1119\" .  }"
  }
]