[
  {
    "qid": "train_1966",
    "input_seq": "When did the county of Oregon whose ISNI is 0000 0004 0419 6469 have a population of 159800?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0419 6469\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"159800\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1968",
    "input_seq": "What is the connection between Chris Parnell to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chris Parnell\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1969",
    "input_seq": "Tell me the subject of the statement The Birdcage got nominated for Academy Award for Best Production Design.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Birdcage\" . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1970",
    "input_seq": "What is the role of Jason Isaacs in the US version of Harry Potter and the Order of the Phoenix?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Jason Isaacs\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1971",
    "input_seq": "How is Mansfield, which belongs to the USA, related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mansfield\" . ?e_1 <country> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1972",
    "input_seq": "What is the connection between Emmylou Harris to Asylum Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Emmylou Harris\" . ?e_2 <pred:name> \"Asylum Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1973",
    "input_seq": "What is the Instagram username of the higher education institution whose official website is http://www.eku.edu?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.eku.edu\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_1974",
    "input_seq": "Tell me the relationship between Geoffrey Lewis and Woodland Hills.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Geoffrey Lewis\" . ?e_2 <pred:name> \"Woodland Hills\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1975",
    "input_seq": "What is the GSS code (2011) of the non-metropolitan district that is located in Cambridgeshire (the one that contains the administrative division South Cambridgeshire) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan district\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Cambridgeshire\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . ?e_2 <pred:name> \"South Cambridgeshire\" .  ?e <GSS_code_(2011)> ?pv .  }"
  },
  {
    "qid": "train_1976",
    "input_seq": "What's the person's ISNI if we know that the person was a member of Jethro Tull since 1982 ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of> ?e_1 . ?e_1 <pred:name> \"Jethro Tull\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1982 . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1977",
    "input_seq": "I want to know the county of Oregon that has a population other than 6.5.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"6.5\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1978",
    "input_seq": "What is the topic of the declaration that The Godfather (that was nominated for an Academy Award for Best Sound Mixing) was a nominee for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Godfather\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Sound Mixing\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1979",
    "input_seq": "When was the founding of the soccer club with the official website www.stalybridgeceltic.co.uk?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.stalybridgeceltic.co.uk/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1980",
    "input_seq": "What is the connection between Richard Wagner (the one whose date of death is 1979-09-15) to Germany?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Wagner\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"1979-09-15\"^^xsd:date . ?e_2 <pred:name> \"Germany\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1981",
    "input_seq": "Which area is larger, Aquitaine or Burgundy?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Aquitaine\" .  } UNION { ?e <pred:name> \"Burgundy\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1982",
    "input_seq": "Which one of the areas among the county of Arizona, with a population that is not equal 78000000, is the smallest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"78000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1983",
    "input_seq": "Was the movie composed by George Gershwin less than 8.6 hours?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"George Gershwin\" .  ?e <duration> ?pv . ?pv <pred:unit> \"hour\" . ?pv <pred:value> ?v . FILTER ( ?v > \"8.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1984",
    "input_seq": "What is the theme song of Skyfall (released in Croatia)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e_1 <theme_music> ?e . ?e_1 <pred:name> \"Skyfall\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"Croatia\" .   }"
  },
  {
    "qid": "train_1985",
    "input_seq": "What is the connection between Hunter College to Manhattan (the one that contains Columbia University Graduate School of Journalism)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hunter College\" . ?e_2 <pred:name> \"Manhattan\" . ?e_3 <located_in_the_administrative_territorial_entity> ?e_2 . ?e_3 <pred:name> \"Columbia University Graduate School of Journalism\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1986",
    "input_seq": "Among Nova Scotia and Prince Edward Island which one has a greater area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nova Scotia\" .  } UNION { ?e <pred:name> \"Prince Edward Island\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1987",
    "input_seq": "Does ROME Occupation Code (v3) C1503 correspond to the job of fighter pilot?",
    "target_seq": "ASK { ?e <pred:name> \"fighter pilot\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"C1503\" .  }"
  },
  {
    "qid": "train_1988",
    "input_seq": "How many kinds of fiction share the genre of United 93 or are designated by IAB code 642?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" .  { ?e_1 <genre> ?e . ?e_1 <pred:name> \"United 93\" .  } UNION { ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" .  } }"
  },
  {
    "qid": "train_1989",
    "input_seq": "Which has a greater area, Napa County or Santa Clara County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Napa County\" .  } UNION { ?e <pred:name> \"Santa Clara County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1990",
    "input_seq": "What was the budget of Corpse Bride?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Corpse Bride\" . ?e <budget> ?pv .  }"
  },
  {
    "qid": "train_1991",
    "input_seq": "What is the connection between Lincoln University to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lincoln University\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1992",
    "input_seq": "Who is the visual artwork director who has official website of http://www.LeonardNimoyPhotography.com/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <director> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.LeonardNimoyPhotography.com/\" .   }"
  },
  {
    "qid": "train_1993",
    "input_seq": "What is the connection between Meridian (the one whose area is 141.167251 square kilometre) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Meridian\" . ?e_1 <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"141.167251\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1994",
    "input_seq": "How many agents serve the United States city which has a subscription number of 103 under the subreddit Alton?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <place_served_by_transport_hub> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <subreddit> ?pv . ?pv <pred:value> \"Alton\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"103\"^^xsd:double .   }"
  },
  {
    "qid": "train_1995",
    "input_seq": "How many New Jersey cities are in Russia?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Russia\" .   }"
  },
  {
    "qid": "train_1996",
    "input_seq": "What is the connection between Richard Brooks (the one whose date of birth is 1962-12-07) to Cleveland?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Brooks\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1962-12-07\"^^xsd:date . ?e_2 <pred:name> \"Cleveland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1997",
    "input_seq": "What is the relation of Spider-Man (65 episodes) to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Spider-Man\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1998",
    "input_seq": "Which work with a script by Richard Matheson was the longest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Richard Matheson\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1999",
    "input_seq": "Does the website www.takenmovie.com represent the manga published post-1948?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1948 ) . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.takenmovie.com/\" .  }"
  },
  {
    "qid": "train_2000",
    "input_seq": "For the official website of http://www.paramountvantage.com/ (the language of this statement is English), does the film-production company have its inception time after 1846?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.paramountvantage.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1846 ) .  }"
  },
  {
    "qid": "train_2001",
    "input_seq": "How many pop musics have origins in United Kingdom or did not begin in 1990?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pop music\" .  { ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1990 ) .  } }"
  },
  {
    "qid": "train_2002",
    "input_seq": "What is Turkey's diplomatic relationship with Kazakhstan?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Turkey\" . ?e_2 <pred:name> \"Kazakhstan\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2003",
    "input_seq": "What is the connection between Godzilla (the one whose producer is Dean Devlin) to dinosaur?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Godzilla\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Dean Devlin\" . ?e_2 <pred:name> \"dinosaur\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2004",
    "input_seq": "The film titled Affliction was published on 1997-08-28 in what location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Affliction\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1997-08-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2005",
    "input_seq": "Does Infernal Affairs, which includes Infernal Affairs II, have under 890 total episodes?",
    "target_seq": "ASK { ?e <pred:name> \"Infernal Affairs\" . ?e_1 <part_of_the_series> ?e . ?e_1 <pred:name> \"Infernal Affairs II\" .  ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"890\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2006",
    "input_seq": "Which has higher elevation above sea level, Nuremberg (the one whose country is Nazi Germany) or Helsinki?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nuremberg\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Nazi Germany\" .   } UNION { ?e <pred:name> \"Helsinki\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2007",
    "input_seq": "Is the Twitter username of Season of Mist SeasonofMist ?",
    "target_seq": "ASK { ?e <pred:name> \"Season of Mist\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SeasonofMist\" .  }"
  },
  {
    "qid": "train_2008",
    "input_seq": "How are Stuart Craig and the 61st Academy Awards related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stuart Craig\" . ?e_2 <pred:name> \"61st Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2009",
    "input_seq": "What is the birth name of the 1974 Grammy nominee for Record of the Year?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Grammy Award for Record of the Year\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1974 . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_2010",
    "input_seq": "Did Ray Winstone's work period start after 1951?",
    "target_seq": "ASK { ?e <pred:name> \"Ray Winstone\" . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1951 ) .  }"
  },
  {
    "qid": "train_2011",
    "input_seq": "Which area is larger, Allegheny County or Northampton County (the one whose population is 300813)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Allegheny County\" . } UNION { ?e <pred:name> \"Northampton County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"300813\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2012",
    "input_seq": "What is the official website of How to Train Your Dragon (the one that is released for Wii)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"How to Train Your Dragon\" . ?e <platform> ?e_1 . ?e_1 <pred:name> \"Wii\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2013",
    "input_seq": "Is the population of the United States city whose official English language website is http://www.ci.haverhill.ma.us/ greater than 7500?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ci.haverhill.ma.us/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"7500\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2014",
    "input_seq": "How is Dave Fleischer related to the animator profession?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dave Fleischer\" . ?e_2 <pred:name> \"animator\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2015",
    "input_seq": "What is the Vicenza born Amy Adams' name in native language?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Amy Adams\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Vicenza\" .  ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_2016",
    "input_seq": "How many people have the award that is the honorific prefix of Arthur Conan Doyle (the one that is influenced by Robert Louis Stevenson)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <honorific_prefix> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"award\" . ?e_3 <honorific_prefix> ?e_1 . ?e_3 <pred:name> \"Arthur Conan Doyle\" . ?e_3 <influenced_by> ?e_4 . ?e_4 <pred:name> \"Robert Louis Stevenson\" .   }"
  },
  {
    "qid": "train_2017",
    "input_seq": "What's the connection between Glenn Frey and pneumonia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Glenn Frey\" . ?e_2 <pred:name> \"pneumonia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2018",
    "input_seq": "Which one, Battleground or Miami Vice (the one whose genre is action film), has greater length?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Battleground\" .  } UNION { ?e <pred:name> \"Miami Vice\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"action film\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2019",
    "input_seq": "From when did Karl Marx (the one whose Swedish Literature Bank AuthorID is MarxK) live in Paris (the birthplace of Roman Polanski) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Karl Marx\" . ?e_1 <Swedish_Literature_Bank_AuthorID> ?pv . ?pv <pred:value> \"MarxK\" . ?e_2 <pred:name> \"Paris\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Roman Polanski\" . ?e_1 <residence> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <residence> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2020",
    "input_seq": "WOEID 865157 corresponds to which city?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <WOEID> ?pv . ?pv <pred:value> \"865157\" .  }"
  },
  {
    "qid": "train_2021",
    "input_seq": "Is the film titled This is Spinal Tap less than 810 minutes long?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"This Is Spinal Tap\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v < \"810\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2022",
    "input_seq": "What is the connection between Batman (the one whose MAME ROM name is batman) to Atari Games?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Batman\" . ?e_1 <MAME_ROM_name> ?pv . ?pv <pred:value> \"batman\" . ?e_2 <pred:name> \"Atari Games\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2023",
    "input_seq": "For Raith Wanderers F.C.,is its official website tantamount to http://www.maccabi.co.ll/?",
    "target_seq": "ASK { ?e <pred:name> \"Raith Rovers F.C.\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.maccabi.co.il/\" .  }"
  },
  {
    "qid": "train_2024",
    "input_seq": "How long is The Turning Point with William Holden as a cast member?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"The Turning Point\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"William Holden\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_2025",
    "input_seq": "What was the release date of the TV movie titled All Quiet on the Western Front?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"All Quiet on the Western Front\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_2026",
    "input_seq": "What is Mark Ruffalo's date of birth?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mark Ruffalo\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2027",
    "input_seq": "How is Capsicum related to L-alanine?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Capsicum\" . ?e_2 <pred:name> \"L-alanine\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2028",
    "input_seq": "Was FC Banants' inception time after 1589?",
    "target_seq": "ASK { ?e <pred:name> \"FC Banants\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1589 ) .  }"
  },
  {
    "qid": "train_2029",
    "input_seq": "Which one had a lower box office score, Lincoln (the one that has James Spader as a cast member) or Harry Potter and the Order of the Phoenix (the one whose publication date is 11th July 2007)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lincoln\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"James Spader\" . } UNION { ?e <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-07-11\"^^xsd:date . } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2030",
    "input_seq": "Did the person with ISNI 0000 0000 4510 1236 die in 2003 or not?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 4510 1236\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2003 ) .  }"
  },
  {
    "qid": "train_2031",
    "input_seq": "Which area is larger, Enid (the one whose area is 191.755165 square kilometre) or Hollywood (the one whose population is 146526)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Enid\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"191.755165\"^^xsd:double . } UNION { ?e <pred:name> \"Hollywood\" . ?e <population> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"146526\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2032",
    "input_seq": "What is the number of fictional jobs that have Selina Kyle as a birth name or whose name in native language is Wonder Woman.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fictional profession\" .  { ?e <birth_name> ?pv . ?pv <pred:value> \"Selina Kyle\" .  } UNION { ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Wonder Woman\" .  } }"
  },
  {
    "qid": "train_2033",
    "input_seq": "How many genre has OCLC control number 357792?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" .  }"
  },
  {
    "qid": "train_2034",
    "input_seq": "When did the person with ISNI 0000 0000 8050 4751 die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8050 4751\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_2035",
    "input_seq": "What province of the Netherlands has the NUTS code of NL21?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of the Netherlands\" . ?e <NUTS_code> ?pv . ?pv <pred:value> \"NL21\" .  }"
  },
  {
    "qid": "train_2036",
    "input_seq": "How many natural languages are native to the sovereign state where Walt Disney-distributed Splash was filmed?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"natural language\" . ?e <indigenous_to> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <filming_location> ?e_1 . ?e_2 <pred:name> \"Splash\" . ?e_2 <distributor> ?e_3 . ?e_3 <pred:name> \"The Walt Disney Company\" .   }"
  },
  {
    "qid": "train_2037",
    "input_seq": "In what edition of the Golden Globe Award ceremony, John Adams (the one aired on HBO) received the nomination7award?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Golden Globe Award ceremony\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"John Adams\" . ?e_1 <original_network> ?e_2 . ?e_2 <pred:name> \"HBO\" .  ?e <edition_number> ?pv .  }"
  },
  {
    "qid": "train_2038",
    "input_seq": "Is the movie production company of Seraphim Falls affiliated with the website www.iconmovies.com?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e_1 <production_company> ?e . ?e_1 <pred:name> \"Seraphim Falls\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.iconmovies.com/\" .  }"
  },
  {
    "qid": "train_2039",
    "input_seq": "What is the publication region of the film whose official website is https://web.archive.org/web/20080603025643/http://www.luckyred.it/ildivo/ and release date is 2009-04-16?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://web.archive.org/web/20080603025643/http://www.luckyred.it/ildivo/\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-04-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2040",
    "input_seq": "What does Capote have to do with BAFTA Award for Best Actress in a Supporting Role?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Capote\" . ?e_2 <pred:name> \"BAFTA Award for Best Actress in a Supporting Role\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2041",
    "input_seq": "How is Saint Paul related to the Mississippi River?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saint Paul\" . ?e_2 <pred:name> \"Mississippi River\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2042",
    "input_seq": "For the movie Home Alone that was released in Chile, what does it have to do with Croatia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Home Alone\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Chile\" . ?e_2 <pred:name> \"Croatia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2043",
    "input_seq": "Kurt Cobain was the husband of Courtney Love until which point in time?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kurt Cobain\" . ?e_2 <pred:name> \"Courtney Love\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2044",
    "input_seq": "What is the relationship between Superman (the one that is created by David S. Goyer) and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Superman\" . ?e_1 <creator> ?e_3 . ?e_3 <pred:name> \"David S. Goyer\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2045",
    "input_seq": "Tell me how long Ninotchka is.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ninotchka\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_2046",
    "input_seq": "How many plays were either published before 1991 or founded after 1950?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1991 ) .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1590 ) .  } }"
  },
  {
    "qid": "train_2047",
    "input_seq": "What ISNI is matched to the Illinois county whose official website is http://dekalbcounty.org/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://dekalbcounty.org/\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2048",
    "input_seq": "What is the Twitter username of Busta Rhymes?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Busta Rhymes\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_2049",
    "input_seq": "Which movie is longer, Harry Potter and the Prisoner of Azkaban (the one whose cost is 130000000 United States dollar) or Bedknobs and Broomsticks?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e <cost> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"130000000\"^^xsd:double . } UNION { ?e <pred:name> \"Bedknobs and Broomsticks\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2050",
    "input_seq": "How is Elizabeth II related to the Church of Scotland?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Elizabeth II\" . ?e_2 <pred:name> \"Church of Scotland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2051",
    "input_seq": "Is the 34th Academy Awards the event's 34th edition in the series?",
    "target_seq": "ASK { ?e <pred:name> \"34th Academy Awards\" . ?e <edition_number> ?pv . ?pv <pred:value> \"34\" .  }"
  }
]