[
  {
    "qid": "train_2052",
    "input_seq": "What method determines that 89320 is the population of the administrative territorial entity that shares a border with Carroll County (whose ISNI is 0000 0004 0400 9889)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Carroll County\" . ?e_1 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0400 9889\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"89320\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_2053",
    "input_seq": "What is the connection between Hundred Flowers Award for Best Actress to acting?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hundred Flowers Award for Best Actress\" . ?e_2 <pred:name> \"acting\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2054",
    "input_seq": "Which area is larger, El Paso County (the one whose area is 2628 square kilometre) or Galveston County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"El Paso County\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"2628\"^^xsd:double . } UNION { ?e <pred:name> \"Galveston County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2055",
    "input_seq": "What is the connection between Luther (the one whose official website is http://www.bbc.co.uk/programmes/b00s8jk0) to London (the one whose population is 4709960)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Luther\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.bbc.co.uk/programmes/b00s8jk0\" . ?e_2 <pred:name> \"London\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4709960\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2056",
    "input_seq": "Does China administrative division code 33 correspond to the Chinese province twinned to Shizuoka Prefecture?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:name> \"Shizuoka Prefecture\" .  ?e <China_administrative_division_code> ?pv . ?pv <pred:value> \"33\" .  }"
  },
  {
    "qid": "train_2057",
    "input_seq": "Which one has fewer people living there, Hubei or Jiangsu ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jiangsu\" .  } UNION { ?e <pred:name> \"Hubei\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2058",
    "input_seq": "How tall is Dakota Fanning?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dakota Fanning\" . ?e <height> ?pv .  }"
  },
  {
    "qid": "train_2059",
    "input_seq": "Brian Wilson had how many match appearances as a member of Newcastle United F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brian Wilson\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Newcastle United F.C.\" . ?e_2 <pred:name> \"Newcastle United F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_2060",
    "input_seq": "Which movie is shorter, The Greatest Story Ever Told or Rhinestone?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Greatest Story Ever Told\" .  } UNION { ?e <pred:name> \"Rhinestone\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2061",
    "input_seq": "How many basketball teams are in the country United States of America or the location Yakima?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } UNION { ?e <location> ?e_1 . ?e_1 <pred:name> \"Yakima\" .  } }"
  },
  {
    "qid": "train_2062",
    "input_seq": "What is the date of birth for the person whose ISNI is 0000 0001 1473 875X?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1473 875X\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2063",
    "input_seq": "When did Kenny Rogers (the one that was nominated for Grammy Award for Best Male Country Vocal Performance) get nominated for Golden Globe Award for Best Original Song?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kenny Rogers\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Grammy Award for Best Male Country Vocal Performance\" . ?e_2 <pred:name> \"Golden Globe Award for Best Original Song\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2064",
    "input_seq": "What is the connection between Fleetwood Town F.C. to red?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fleetwood Town F.C.\" . ?e_2 <pred:name> \"red\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2065",
    "input_seq": "Which Indian census area code (2001) designates the Indian state where the official language is Marathi?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <official_language> ?e_1 . ?e_1 <pred:name> \"Marathi\" .  ?e <Indian_census_area_code_(2001)> ?pv .  }"
  },
  {
    "qid": "train_2066",
    "input_seq": "When did Gloucester, which is 15 m above sea level, reached the population of 28789 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Gloucester\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"15\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"28789\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2067",
    "input_seq": "ISNI 0000 0001 2118 8346 denotes which individual?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2118 8346\" .  }"
  },
  {
    "qid": "train_2068",
    "input_seq": "Tell me the relationship between ER and medical drama.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"ER\" . ?e_2 <pred:name> \"medical drama\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2069",
    "input_seq": "How many Primetime Emmy Awards either are in the United States of America or have the official website of http://www.emmys.com/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emmys.com/\" .  } }"
  },
  {
    "qid": "train_2070",
    "input_seq": "Was Tallahassee not established in 1957?",
    "target_seq": "ASK { ?e <pred:name> \"Tallahassee\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1957 ) .  }"
  },
  {
    "qid": "train_2071",
    "input_seq": "Which movie is shorter, Some Like It Hot (the one whose release region is United States of America) or Sedona (the one whose official website is http://sedonamovie.com/)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Some Like It Hot\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" . } UNION { ?e <pred:name> \"Sedona\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://sedonamovie.com/\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2072",
    "input_seq": "Is the duration of the film whose title is Twin Peaks: Fire Walk with Me not equal to 2100 seconds?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Twin Peaks: Fire Walk with Me\" . ?e <duration> ?pv . ?pv <pred:unit> \"second\" . ?pv <pred:value> ?v . FILTER ( ?v != \"2100\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2073",
    "input_seq": "Tell me the symptom that has hypertension as a risk factor.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e_1 <risk_factor> ?e . ?e_1 <pred:name> \"hypertension\" .   }"
  },
  {
    "qid": "train_2074",
    "input_seq": "Why did the Communist Party of the Soviet Union dissolve on 1991-08-29?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Communist Party of the Soviet Union\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1991-08-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved,_abolished_or_demolished> ; <pred:fact_t> ?pv ] <has_cause> ?qpv .  }"
  },
  {
    "qid": "train_2075",
    "input_seq": "Was the movie War on Terror published after 1996?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"War on Terror\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1996 ) .  }"
  },
  {
    "qid": "train_2076",
    "input_seq": "Does the real estate property with the English-language website www.walkoffame.com get over 9,800,000 guests annually?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"real property\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.walkoffame.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"9800000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2077",
    "input_seq": "What is the connection between Bewitched (that was nominated for a Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series) and children's film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bewitched\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series\" . ?e_2 <pred:name> \"children's film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2078",
    "input_seq": "For what work did Alexander Payne win a BAFTA Award for Best Adapted Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"BAFTA Award for Best Adapted Screenplay\" . ?e_2 <pred:name> \"Alexander Payne\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_2079",
    "input_seq": "How is Bethesda related to Montgomery County whose local dialing code is 301?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bethesda\" . ?e_2 <pred:name> \"Montgomery County\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"301\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2080",
    "input_seq": "How many counties of Texas were not founded in 1849?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1849 ) .  }"
  },
  {
    "qid": "train_2081",
    "input_seq": "Is Billy Crystal's Munzinger IBA 00000021594?",
    "target_seq": "ASK { ?e <pred:name> \"Billy Crystal\" . ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000021594\" .  }"
  },
  {
    "qid": "train_2082",
    "input_seq": "Does the town where the story of Oh! What a Lovely War was set measure under 260 square miles in size?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e_1 <narrative_location> ?e . ?e_1 <pred:name> \"Oh! What a Lovely War\" .  ?e <area> ?pv . ?pv <pred:unit> \"square mile\" . ?pv <pred:value> ?v . FILTER ( ?v < \"260\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2083",
    "input_seq": "Which Diane Kruger work earned a SAG Award for Outstanding Performance by a Cast in a Motion Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture\" . ?e_2 <pred:name> \"Diane Kruger\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_2084",
    "input_seq": "Which movie is longer, Flags of Our Fathers or House of Sand and Fog?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Flags of Our Fathers\" .  } UNION { ?e <pred:name> \"House of Sand and Fog\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2085",
    "input_seq": "What is the relationship between Independence Day (the one whose duration is 110 minute) and Dianne Wiest?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Independence Day\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"110\"^^xsd:double . ?e_2 <pred:name> \"Dianne Wiest\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2086",
    "input_seq": "How many subscribers are there on GLEEonFOX, the Twitter username of TV series whose Instagram username is gleeonfox ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"gleeonfox\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"GLEEonFOX\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2087",
    "input_seq": "Which disease's ICD-9-CM is 555.1?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <ICD-9-CM> ?pv . ?pv <pred:value> \"555.1\" .  }"
  },
  {
    "qid": "train_2088",
    "input_seq": "What is the number of plays that inspires Robots (which has Jennifer Coolidge as a voice actor)and was published after 1991?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e_1 <inspired_by> ?e . ?e_1 <pred:name> \"Robots\" . ?e_1 <voice_actor> ?e_2 . ?e_2 <pred:name> \"Jennifer Coolidge\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1991 ) .  }"
  },
  {
    "qid": "train_2089",
    "input_seq": "What is the association between Cats & Dogs and Jack McBrayer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cats & Dogs\" . ?e_2 <pred:name> \"Jack McBrayer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2090",
    "input_seq": "Does Johnstown or Greensburg have higher elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Johnstown\" .  } UNION { ?e <pred:name> \"Greensburg\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2091",
    "input_seq": "When was Longview (the one whose genre is alternative rock) published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Longview\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"alternative rock\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_2092",
    "input_seq": "Which constitutional monarchy has the demonym marroquín?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"constitutional monarchy\" . ?e <demonym> ?pv . ?pv <pred:value> \"marroquín\" .  }"
  },
  {
    "qid": "train_2093",
    "input_seq": "Which one has less running time, Recount or Fist of the North Star (the one whose official website is http://www.toei-video.co.jp/DVD/sp21/hokutonoken.html)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Recount\" . } UNION { ?e <pred:name> \"Fist of the North Star\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.toei-video.co.jp/DVD/sp21/hokutonoken.html\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2094",
    "input_seq": "How was it determined that Mendocino County has a population of 87434?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mendocino County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"87434\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_2095",
    "input_seq": "What class of instruments was used by Stevie Nicks and Dido (the one that has the occupation of singer-songwriter)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e_1 <instrument> ?e . ?e_1 <pred:name> \"Stevie Nicks\" .  ?e_2 <instrument> ?e . ?e_2 <pred:name> \"Dido\" . ?e_2 <occupation> ?e_3 . ?e_3 <pred:name> \"singer-songwriter\" .  }"
  },
  {
    "qid": "train_2096",
    "input_seq": "What county has a larger area, Nevada County or El Dorado County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nevada County\" .  } UNION { ?e <pred:name> \"El Dorado County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2097",
    "input_seq": "What is the postal code of an Amsterdam (where AFC Ajax's headquarters locate)'s headquarters location of Philips (the one that produce software as product or material) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Philips\" . ?e_1 <product_or_material_produced> ?e_3 . ?e_3 <pred:name> \"software\" . ?e_2 <pred:name> \"Amsterdam\" . ?e_4 <headquarters_location> ?e_2 . ?e_4 <pred:name> \"A.F.C. Ajax\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_2098",
    "input_seq": "Where was the film titled Låt den rätte komma in published on 2008-12-23?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Låt den rätte komma in\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-12-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2099",
    "input_seq": "Which has the lowest population among the towns with local dialing code 01273?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"01273\" . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2100",
    "input_seq": "Boaz Myhill was a member until 2011 of which soccer club with white as its official color?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_color> ?e_1 . ?e_1 <pred:name> \"white\" .  ?e_2 <member_of_sports_team> ?e . ?e_2 <pred:name> \"Boaz Myhill\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <end_time> ?qpv . ?qpv <pred:year> 2011 .  }"
  },
  {
    "qid": "train_2101",
    "input_seq": "Does Copenhagen or Yerevan have the lower elevation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Copenhagen\" .  } UNION { ?e <pred:name> \"Yerevan\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2102",
    "input_seq": "Does Rocco and His Brothers or Nevada (original language English) have a longer run-time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rocco and His Brothers\" .  } UNION { ?e <pred:name> \"Nevada\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2103",
    "input_seq": "How many counties of Maryland are named after George Washington (the one that is the member of American Philosophical Society)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"George Washington\" . ?e_1 <member_of> ?e_2 . ?e_2 <pred:name> \"American Philosophical Society\" .   }"
  },
  {
    "qid": "train_2104",
    "input_seq": "What number of Maryland counties have the capital of Walnut Creek?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Walnut Creek\" .   }"
  },
  {
    "qid": "train_2105",
    "input_seq": "Is the area of New Jersey city, the birthplace of Donald Fagen, not the same as  10000000 square km ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Donald Fagen\" .  ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v != \"10000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2106",
    "input_seq": "When did Kazakhstan have an 854.6% rate of inflation?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kazakhstan\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"854.6\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2107",
    "input_seq": "Which public university's ISNI is 0000 0004 0382 8305?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public university\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0382 8305\" .  }"
  },
  {
    "qid": "train_2108",
    "input_seq": "Which learned society has as a member the human whose ISNI is 0000 0001 2134 0790?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"learned society\" . ?e_1 <member_of> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2134 0790\" .   }"
  },
  {
    "qid": "train_2109",
    "input_seq": "Does Qing dynasty or German Democratic Republic have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Qing dynasty\" .  } UNION { ?e <pred:name> \"German Democratic Republic\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2110",
    "input_seq": "When was the instance of National Football League Draft whose English language website is http://www.nfl.com/draft/history/fulldraft?season=2007?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"National Football League Draft\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.nfl.com/draft/history/fulldraft?season=2007\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <point_in_time> ?pv .  }"
  },
  {
    "qid": "train_2111",
    "input_seq": "Did the person with CANTIC-ID a11437480 have ISNI 0000 0004 0419 4770?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11437480\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0419 4770\" .  }"
  },
  {
    "qid": "train_2112",
    "input_seq": "How many historic counties of England have the official website http://www.lgyh.gov.uk/ or are the narrative location of Wuthering Heights (whose producer is Samuel Z. Arkoff)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historic county of England\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.lgyh.gov.uk/\" .  } UNION { ?e_1 <narrative_location> ?e . ?e_1 <pred:name> \"Wuthering Heights\" . ?e_1 <producer> ?e_2 . ?e_2 <pred:name> \"Samuel Z. Arkoff\" .  } }"
  },
  {
    "qid": "train_2113",
    "input_seq": "Is 200-795-6 the EC number of calcium?",
    "target_seq": "ASK { ?e <pred:name> \"calcium\" . ?e <EC_number> ?pv . ?pv <pred:value> \"200-795-6\" .  }"
  },
  {
    "qid": "train_2114",
    "input_seq": "When was 60608 the population of the city of the United States whose official website is http://www.ci.springfield.oh.us/ ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ci.springfield.oh.us/\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"60608\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2115",
    "input_seq": "How is The Simpsons Movie linked to Mike Scully?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Simpsons Movie\" . ?e_2 <pred:name> \"Mike Scully\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2116",
    "input_seq": "How many high schools have bxsci as the subreddit?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e <subreddit> ?pv . ?pv <pred:value> \"bxsci\" .  }"
  },
  {
    "qid": "train_2117",
    "input_seq": "Was Kalmar FF created in 1447?",
    "target_seq": "ASK { ?e <pred:name> \"Kalmar FF\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1447 ) .  }"
  },
  {
    "qid": "train_2118",
    "input_seq": "Which has a greater number of students, National and Kapodistrian University of Athens or Texas Tech University?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"National and Kapodistrian University of Athens\" .  } UNION { ?e <pred:name> \"Texas Tech University\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2119",
    "input_seq": "Between Beverly Hills, 90210 or Stargate SG-1, which has the fewest episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Beverly Hills, 90210\" .  } UNION { ?e <pred:name> \"Stargate SG-1\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2120",
    "input_seq": "How many MTV Video Music Awards has No Doubt been nominated for?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"No Doubt\" .   }"
  },
  {
    "qid": "train_2121",
    "input_seq": "How much computer programming involves the application/JavaScript media type and the JS file extension?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"computer programming\" . ?e <media_type> ?pv . ?pv <pred:value> \"application/javascript\" . ?e <file_extension> ?pv_1 . ?pv_1 <pred:value> \"js\" .  }"
  },
  {
    "qid": "train_2122",
    "input_seq": "How is  The Master (the one that was nominated for Broadcast Film Critics Association Award for Best Composer) connected to 2012 Toronto International Film Festival   ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Master\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Broadcast Film Critics Association Award for Best Composer\" . ?e_2 <pred:name> \"2012 Toronto International Film Festival\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2123",
    "input_seq": "What is Robert Elswit's date of birth?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Robert Elswit\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2124",
    "input_seq": "For Lemony Snicket's A Series of Unfortunate Events (the one whose publisher is Activision Publishing, Inc.), what are its game mode entertainments?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e_1 <game_mode> ?e . ?e_1 <pred:name> \"Lemony Snicket's A Series of Unfortunate Events\" . ?e_1 <publisher> ?e_2 . ?e_2 <pred:name> \"Activision Publishing, Inc.\" .   }"
  },
  {
    "qid": "train_2125",
    "input_seq": "What is the connection between My Week with Marilyn to United Arab Emirates?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"My Week with Marilyn\" . ?e_2 <pred:name> \"United Arab Emirates\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2126",
    "input_seq": "The movie production company designated by ISNI 0000 0001 2193 1929 is the founder of which TV network?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television network\" . ?e <founded_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film production company\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2193 1929\" .   }"
  },
  {
    "qid": "train_2127",
    "input_seq": "What is the OS grid reference of Islington?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Islington\" . ?e <OS_grid_reference> ?pv .  }"
  },
  {
    "qid": "train_2128",
    "input_seq": "Is Star Trek: Insurrection or Happy-Go-Lucky the shorter work?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Trek: Insurrection\" .  } UNION { ?e <pred:name> \"Happy-Go-Lucky\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2129",
    "input_seq": "How are Tennessee Williams and The Loss of a Teardrop Diamond related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Loss of a Teardrop Diamond\" . ?e_2 <pred:name> \"Tennessee Williams\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2130",
    "input_seq": "What is the Deutsche Synchronkartei actor-ID of Michael Jordan who is a member of North Carolina Tar Heels men's basketball?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Michael Jordan\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"North Carolina Tar Heels men's basketball\" .  ?e <Deutsche_Synchronkartei_actor-ID> ?pv .  }"
  },
  {
    "qid": "train_2131",
    "input_seq": "Does the higher season count belong to Cold War, with a 1 season run, or reality TV's The Challenge?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cold War\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1\"^^xsd:double . } UNION { ?e <pred:name> \"The Challenge\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"reality television\" . } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2132",
    "input_seq": "The Lord of the Rings: The Two Towers, with David Wenham as a cast member, has what connection to the Dominican Republic?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Lord of the Rings: The Two Towers\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"David Wenham\" . ?e_2 <pred:name> \"Dominican Republic\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2133",
    "input_seq": "Is X2 longer than 9.8 hours?",
    "target_seq": "ASK { ?e <pred:name> \"X2\" . ?e <duration> ?pv . ?pv <pred:unit> \"hour\" . ?pv <pred:value> ?v . FILTER ( ?v > \"9.8\"^^xsd:double ) .  }"
  }
]