[
  {
    "qid": "train_3871",
    "input_seq": "When did the historical country that bordered the Empire of Japan until 1912 have a population of 400000000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historical country\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Empire of Japan\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e ] <end_time> ?qpv_1 . ?qpv_1 <pred:year> 1912 . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"400000000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3872",
    "input_seq": "How is Milton Friendman related to economics ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Milton Friedman\" . ?e_2 <pred:name> \"economics\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3873",
    "input_seq": "Which website represents Chris Isaak?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Isaak\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3874",
    "input_seq": "How many Protestant denominations were established later than 1868 or in any year except 1957?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1957 ) .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1868 ) .  } }"
  },
  {
    "qid": "train_3875",
    "input_seq": "Which one has the largest area among New York Country whose population is not equal to 6.8?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"6.8\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3876",
    "input_seq": "Tell me the one with the longest length within the river that has discharge of under 6500 cubic metre per second",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <discharge> ?pv_1 . ?pv_1 <pred:unit> \"cubic metre per second\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"6500\"^^xsd:double ) . ?e <length> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3877",
    "input_seq": "What is the connection between BAFTA Academy Fellowship Award to David Lean?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"BAFTA Academy Fellowship Award\" . ?e_2 <pred:name> \"David Lean\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3878",
    "input_seq": "Which has fewer episodes, Eureka (the one whose end time is 2012-07-16) or Oliver Twist (the one whose start time is 1985-10-13)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Eureka\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2012-07-16\"^^xsd:date . } UNION { ?e <pred:name> \"Oliver Twist\" . ?e <start_time> ?pv_2 . ?pv_2 <pred:date> \"1985-10-13\"^^xsd:date . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3879",
    "input_seq": "What country does the city of the United States with an official website at http://www.cityofventura.net and a postal code of 93006 belong to?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofventura.net\" . ?e <postal_code> ?pv . ?pv <pred:value> \"93006\" . [ <pred:fact_h> ?e ; <pred:fact_r> <postal_code> ; <pred:fact_t> ?pv ] <country> ?qpv .  }"
  },
  {
    "qid": "train_3880",
    "input_seq": "Regarding the visual artwork that has the CANTIC-ID of a12008783 and that was published on 1967-07-26 where did it get published.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a12008783\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1967-07-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3881",
    "input_seq": "What is the connection between A Serious Man to Netherlands?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Serious Man\" . ?e_2 <pred:name> \"Netherlands\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3882",
    "input_seq": "Where was Memento published on 2000-10-11?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Memento\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-10-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3883",
    "input_seq": "Zodiac, released in 1986, inspired which movie released prior to 2009?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2009 ) . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"Zodiac\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:year> 1986 .  }"
  },
  {
    "qid": "train_3884",
    "input_seq": "Which subreddit designates the person of the official English-language website at https://stephenking.com/ ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://stephenking.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <subreddit> ?pv .  }"
  },
  {
    "qid": "train_3885",
    "input_seq": "How was it determined that the ranking for the national association football team that belongs to Antigua and Barbuda is 161?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <country_for_sport> ?e_1 . ?e_1 <pred:name> \"Antigua and Barbuda\" .  ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"161\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_3886",
    "input_seq": "What is the connection between Little Fockers to Teri Polo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Little Fockers\" . ?e_2 <pred:name> \"Teri Polo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3887",
    "input_seq": "Is 2000 not the population in the year 2008 of the capital whose native name is Finfinne?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Finfinne\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"2000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2008 .  }"
  },
  {
    "qid": "train_3888",
    "input_seq": "Was David Kaye (the one that was born in Huddersfield) born on 1975-12-03?",
    "target_seq": "ASK { ?e <pred:name> \"David Kaye\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Huddersfield\" .  ?e <date_of_birth> ?pv . ?pv <pred:date> \"1975-12-03\"^^xsd:date .  }"
  },
  {
    "qid": "train_3889",
    "input_seq": "Is the run-time shorter for Tarzan, released on 2014-02-20, or Life as We Know It?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tarzan\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2014-02-20\"^^xsd:date . } UNION { ?e <pred:name> \"Life as We Know It\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3890",
    "input_seq": "How many episodes are in the television series that has the Twitter username of awtribute (the subscription number of this statement is 433)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"awtribute\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"433\"^^xsd:double . ?e <number_of_episodes> ?pv .  }"
  },
  {
    "qid": "train_3891",
    "input_seq": "Which movie features Keith Richards (the one whose work period (start) is 1960) in the cast?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Keith Richards\" . ?e_1 <work_period_(start)> ?pv . ?pv <pred:year> 1960 .   }"
  },
  {
    "qid": "train_3892",
    "input_seq": "Is the film produced by Fisher Stevens titled Big Love ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Fisher Stevens\" .  ?e <title> ?pv . ?pv <pred:value> \"Big Love\" .  }"
  },
  {
    "qid": "train_3893",
    "input_seq": "Does Bhubaneswar have an area less than 70 square miles?",
    "target_seq": "ASK { ?e <pred:name> \"Bhubaneswar\" . ?e <area> ?pv . ?pv <pred:unit> \"square mile\" . ?pv <pred:value> ?v . FILTER ( ?v < \"70\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3894",
    "input_seq": "How many provinces in China share a border with Shaanxi?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Shaanxi\" .   }"
  },
  {
    "qid": "train_3895",
    "input_seq": "What is the street address of the higher education institution with ISNI 0000 0001 2174 1885?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2174 1885\" . ?e <located_at_street_address_(DEPRECATED)> ?pv .  }"
  },
  {
    "qid": "train_3896",
    "input_seq": "What academic discipline is a part of engineering?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"engineering\" .   }"
  },
  {
    "qid": "train_3897",
    "input_seq": "What is the number of neighborhoods with a population of under 77000000 or that have a population of over 9000000",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"77000000\"^^xsd:double ) .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"9000000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_3899",
    "input_seq": "What is the ISNI for the United Kingdom citizen, Chris Newman?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Newman\" . ?e <country_of_citizenship> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3900",
    "input_seq": "Is Mrs Henderson Presents or In the Loop the shorter work?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mrs Henderson Presents\" .  } UNION { ?e <pred:name> \"In the Loop\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3901",
    "input_seq": "What person received the 1984 Tony Award for Best Actress in a Play?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Tony Award for Best Actress in a Play\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1984 .  }"
  },
  {
    "qid": "train_3902",
    "input_seq": "Of dogs whose life expectancy is under 12.5 years of age, which has the longest projected lifespan?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <life_expectancy> ?pv_1 . ?pv_1 <pred:unit> \"year\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"12.5\"^^xsd:double ) . ?e <life_expectancy> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3903",
    "input_seq": "Who is the screenwriter of Bram Stoker's Dracula (the one that was nominated for Academy Award for Best Makeup and Hairstyling) and works as a journalist ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"Bram Stoker's Dracula\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Makeup and Hairstyling\" .  ?e <occupation> ?e_3 . ?e_3 <pred:name> \"journalist\" .  }"
  },
  {
    "qid": "train_3904",
    "input_seq": "What is the ISNI of the human that was nominated for a Hong Kong Film Award for Best Film for Journey to the West: Conquering the Demons?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Hong Kong Film Award for Best Film\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Journey to the West: Conquering the Demons\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3905",
    "input_seq": "How many subscribers does the person born in  Marin County with the Twitter username LesterHoltNBC have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Marin County\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"LesterHoltNBC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3906",
    "input_seq": "Denton County has a border with Dallas County, the one that has a border with Collin County, tell me the location is relative to.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Denton County\" . ?e_2 <pred:name> \"Dallas County\" . ?e_3 <shares_border_with> ?e_2 . ?e_3 <pred:name> \"Collin County\" . ?e_1 <shares_border_with> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_2 ] <direction_relative_to_location> ?qpv .  }"
  },
  {
    "qid": "train_3907",
    "input_seq": "Was Los Gatos not founded in 1297?",
    "target_seq": "ASK { ?e <pred:name> \"Los Gatos\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1297 ) .  }"
  },
  {
    "qid": "train_3908",
    "input_seq": "Is Margot Kidder affiliated with the website www.clubalianzalima.com.pe ?",
    "target_seq": "ASK { ?e <pred:name> \"Margot Kidder\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.clubalianzalima.com.pe/\" .  }"
  },
  {
    "qid": "train_3909",
    "input_seq": "Was the film series featuring Jim Carrey as a cast member released sometime other than 1987 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jim Carrey\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1987 ) .  }"
  },
  {
    "qid": "train_3910",
    "input_seq": "Does the film whose official website is http://www.youdontmesswiththezohan.com/ (the language of this statement is English), have its box office not equal to 240000 pounds sterling?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.youdontmesswiththezohan.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <box_office> ?pv . ?pv <pred:unit> \"pound sterling\" . ?pv <pred:value> ?v . FILTER ( ?v != \"240000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3911",
    "input_seq": "When was the rock musician Neil Young nominated for a Grammy Award for Song of the Year?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Neil Young\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"rock music\" . ?e_2 <pred:name> \"Grammy Award for Song of the Year\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3912",
    "input_seq": "How is FC Kryvbas Kryvyi Rih related to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"FC Kryvbas Kryvyi Rih\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3913",
    "input_seq": "How is Kim Ki-duk, whose ISNI is 0000 0001 0909 9404, related to South Korea?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kim Ki-duk\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0909 9404\" . ?e_2 <pred:name> \"South Korea\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3914",
    "input_seq": "What is the run-time of the visual artwork titled Laura?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Laura\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_3915",
    "input_seq": "Which movie is longer, Dead Ringers or Vanity Fair (the one whose color is black-and-white)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dead Ringers\" .  } UNION { ?e <pred:name> \"Vanity Fair\" . ?e <color> ?e_1 . ?e_1 <pred:name> \"black-and-white\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3916",
    "input_seq": "At what frequency does the mains voltage of 110 volt, belonging to an administrative territorial entity whose motto text is Be Vigilant, work ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <motto_text> ?pv_1 . ?pv_1 <pred:value> \"Be Vigilant\" . ?e <mains_voltage> ?pv . ?pv <pred:unit> \"volt\" . ?pv <pred:value> \"110\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <mains_voltage> ; <pred:fact_t> ?pv ] <frequency> ?qpv .  }"
  },
  {
    "qid": "train_3917",
    "input_seq": "What is the title of the feature film that has an official website of http://www.ghostbusters.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ghostbusters.com/\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_3918",
    "input_seq": "Which Forest Whitaker project earned him an Academy Award nomination for Best Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Forest Whitaker\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3919",
    "input_seq": "What is the connection between Philips (the one whose distributor is Decca) to Netherlands?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Philips\" . ?e_1 <distributor> ?e_3 . ?e_3 <pred:name> \"Decca\" . ?e_2 <pred:name> \"Netherlands\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3920",
    "input_seq": "Was Dulwich College founded after 1645?",
    "target_seq": "ASK { ?e <pred:name> \"Dulwich College\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1645 ) .  }"
  },
  {
    "qid": "train_3921",
    "input_seq": "What is the ISNI of Mario Van Peebles?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mario Van Peebles\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3922",
    "input_seq": "For the Democracy that has military conflicts with Greece, which has the littlest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e_1 <military_conflicts> ?e . ?e_1 <pred:name> \"Greece\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3923",
    "input_seq": "The Towering Inferno was nominated for an Academy Award for Best Film Editing by which film editor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Towering Inferno\" . ?e_2 <pred:name> \"Academy Award for Best Film Editing\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3924",
    "input_seq": "Was SV Ried founded after 1861?",
    "target_seq": "ASK { ?e <pred:name> \"SV Ried\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1861 ) .  }"
  },
  {
    "qid": "train_3925",
    "input_seq": "Does the Grammy Award for Best Spoken Word Album for Children, have an official website of http://www.foxsearchlight.com/crazyheart?",
    "target_seq": "ASK { ?e <pred:name> \"Grammy Award for Best Spoken Word Album for Children\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.foxsearchlight.com/crazyheart\" .  }"
  },
  {
    "qid": "train_3926",
    "input_seq": "How many entertainments have the person whose Twitter username is fred_tatasciore as a voice actor?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"fred_tatasciore\" .   }"
  },
  {
    "qid": "train_3927",
    "input_seq": "Which Washington county that shares a boundary with Jefferson County (whose population os 30076) has the largest land area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Jefferson County\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"30076\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3928",
    "input_seq": "Which person with ISNI 0000 0000 3492 1474 received the 59th Primetime Emmy Awards?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"59th Primetime Emmy Awards\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 3492 1474\" .  }"
  },
  {
    "qid": "train_3929",
    "input_seq": "How many computer programs are the programming paradigm of C?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"computer programming\" . ?e <programming_paradigm> ?e_1 . ?e_1 <pred:name> \"functional programming\" .  ?e_2 <programming_paradigm> ?e . ?e_2 <pred:name> \"C\" .  }"
  },
  {
    "qid": "train_3930",
    "input_seq": "When did Charlie Parker (the one that is a member of Carlisle United F.C.) become a member of Sunderland A.F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Charlie Parker\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Carlisle United F.C.\" . ?e_2 <pred:name> \"Sunderland A.F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3931",
    "input_seq": "Tell me the one with smaller area, Yangon or Mosul.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mosul\" .  } UNION { ?e <pred:name> \"Yangon\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3932",
    "input_seq": "Is Greater Sudbury's ISNI equal to 0000 0001 0959 3568?",
    "target_seq": "ASK { ?e <pred:name> \"Greater Sudbury\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0959 3568\" .  }"
  },
  {
    "qid": "train_3933",
    "input_seq": "Where was the visual artwork with CANTIC-ID a1201820x published on 1997-07-31?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a1201820x\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1997-07-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3934",
    "input_seq": "When was the employee of University of New Brunswick born?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <employer> ?e_1 . ?e_1 <pred:name> \"University of New Brunswick\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1915 ) .  }"
  },
  {
    "qid": "train_3935",
    "input_seq": "When did Robert Silverberg win the  Nebula Award for Best Novel?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nebula Award for Best Novel\" . ?e_2 <pred:name> \"Robert Silverberg\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3936",
    "input_seq": "Does Bilbao or Daegu cover a smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bilbao\" .  } UNION { ?e <pred:name> \"Daegu\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3937",
    "input_seq": "How many counties of Maine come with the capital Bangor (situated in the US) ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maine\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Bangor\" . ?e_1 <country> ?e_2 . ?e_2 <pred:name> \"United States of America\" .   }"
  },
  {
    "qid": "train_3938",
    "input_seq": "Does \"Some Kind of Monster\" have the title \"Some Kind of Monster?\"",
    "target_seq": "ASK { ?e <pred:name> \"Some Kind of Monster\" . ?e <title> ?pv . ?pv <pred:value> \"Some Kind of Monster\" .  }"
  },
  {
    "qid": "train_3939",
    "input_seq": "What person is involved in the World War I conflict and has the ISNI 0000 0000 7830 8276?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <conflict> ?e_1 . ?e_1 <pred:name> \"World War I\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7830 8276\" .  }"
  },
  {
    "qid": "train_3940",
    "input_seq": "Anna Deavere Smith is related in what way to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Anna Deavere Smith\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3941",
    "input_seq": "Of console models for video gaming that sold other than 46000000 units, which model had the highest unit sales?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <units_sold> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"46000000\"^^xsd:double ) . ?e <units_sold> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3942",
    "input_seq": "Which area is smaller, Ludhiana or Jerusalem (the one whose population is 45430)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ludhiana\" . } UNION { ?e <pred:name> \"Jerusalem\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"45430\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3943",
    "input_seq": "What person uses Tamil as the native tongue and has the name ஸ்ரீதேவி in native language?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <native_language> ?e_1 . ?e_1 <pred:name> \"Tamil\" .  ?e <name_in_native_language> ?pv . ?pv <pred:value> \"ஸ்ரீதேவி\" .  }"
  },
  {
    "qid": "train_3944",
    "input_seq": "How many classes of instruments whose famous people is the person with ISNI 0000 0003 9901 7066?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0003 9901 7066\" .   }"
  },
  {
    "qid": "train_3945",
    "input_seq": "How are sodium and eggs related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"egg\" . ?e_2 <pred:name> \"sodium\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3946",
    "input_seq": "Between Juhi Chawla and Terry Gilliam, who has more offspring?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Juhi Chawla\" .  } UNION { ?e <pred:name> \"Terry Gilliam\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3947",
    "input_seq": "Who is the man whose birth name is Richard Rodney Bennett and whose Munzinger IBA is 00000014515?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv . ?pv <pred:value> \"Richard Rodney Bennett\" . ?e <Munzinger_IBA> ?pv_1 . ?pv_1 <pred:value> \"00000014515\" .  }"
  },
  {
    "qid": "train_3948",
    "input_seq": "Tell me the language associated with the creative work for Avalon Hill and the official website being http://www.avalonhill.com/.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Avalon Hill\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.avalonhill.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3949",
    "input_seq": "Which has a smaller population, Tulsa (the one whose WOEID is 2508533) or Paducah?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tulsa\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2508533\" . } UNION { ?e <pred:name> \"Paducah\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3950",
    "input_seq": "How many private school are there, where the education place of Paul Williams (the one whose date of death is 2008-09-10) or whose headquarter location is College Station?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private school\" .  { ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Paul Williams\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"2008-09-10\"^^xsd:date .  } UNION { ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"College Station\" .  } }"
  },
  {
    "qid": "train_3951",
    "input_seq": "What role does Ellen Pompeo play in the 20th Century Fox production of Daredevil?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Daredevil\" . ?e_1 <production_company> ?e_3 . ?e_3 <pred:name> \"20th Century Fox\" . ?e_2 <pred:name> \"Ellen Pompeo\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3952",
    "input_seq": "Which film series whose number of episodes is not 5300 has the lowest number of episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film series\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"5300\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  }
]