[
  {
    "qid": "train_3366",
    "input_seq": "What is the connection between David Suchet to detective fiction?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"David Suchet\" . ?e_2 <pred:name> \"detective fiction\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3367",
    "input_seq": "Some Kind of Monster has what connection to Tokyo, where The Rules of Attraction was released?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Some Kind of Monster\" . ?e_2 <pred:name> \"Tokyo\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"The Rules of Attraction\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3368",
    "input_seq": "How was it determined that the population of the administrative territorial entity with the FIPS 6-4 of 32003 is 1951269?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"32003\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1951269\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_3369",
    "input_seq": "Ewan McGregor was voice actor for what character on the adventure film Robots?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Robots\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"adventure film\" . ?e_2 <pred:name> \"Ewan McGregor\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3370",
    "input_seq": "What is the connection between Anthony Anderson (the one that is a member of Pittsburgh Steelers) to running back?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Anthony Anderson\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Pittsburgh Steelers\" . ?e_2 <pred:name> \"running back\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3371",
    "input_seq": "What number of North Carolina counties share borders with Boulder County?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of North Carolina\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Boulder County\" .   }"
  },
  {
    "qid": "train_3372",
    "input_seq": "What is the date of birth of the person whose birth name is Ricardo Dwayne Fuller?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Ricardo Dwayne Fuller\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3373",
    "input_seq": "When did the capital with Dewey Decimal Classification 2--5525 have a population totaling 8846782?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5525\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8846782\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3374",
    "input_seq": "Is the student population of National Autonomous University of Mexico or Ludwig Maximilian University of Munich the larger of the two?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"National Autonomous University of Mexico\" .  } UNION { ?e <pred:name> \"Ludwig Maximilian University of Munich\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3375",
    "input_seq": "For what was District 9 nominated for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"District 9\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3376",
    "input_seq": "How many states of the United States share a common border?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"contiguous United States\" .   }"
  },
  {
    "qid": "train_3377",
    "input_seq": "Which one is heavier, Kevin Garnett or Landon Donovan?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kevin Garnett\" .  } UNION { ?e <pred:name> \"Landon Donovan\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3378",
    "input_seq": "Crispin Freeman is the voice of which character on Final Fantasy VII: Advent Children?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Final Fantasy VII: Advent Children\" . ?e_2 <pred:name> \"Crispin Freeman\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3379",
    "input_seq": "What is Irene Lentz's birthdate?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Irene Lentz\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3380",
    "input_seq": "How many cities in New York have a population over 51000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"51000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3381",
    "input_seq": "What is the distribution format of the television series that has cast member Robbie Coltrane (in the character role of Tweedledum) and whose duration is 129 minutes?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Robbie Coltrane\" . [ <pred:fact_h> ?e ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_1 ] <character_role> ?qpv_1 . ?qpv_1 <pred:value> \"Tweedledum\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"129\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <distribution> ?qpv .  }"
  },
  {
    "qid": "train_3382",
    "input_seq": "How is Real Madrid CF related to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Real Madrid CF\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3383",
    "input_seq": "When did Alou Diarra become a member of FC Bayern Munich II?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Alou Diarra\" . ?e_2 <pred:name> \"FC Bayern Munich II\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3384",
    "input_seq": "How is the USA related to John Byrne, designated by CANTIC-ID a11793533?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Byrne\" . ?e_1 <CANTIC-ID> ?pv . ?pv <pred:value> \"a11793533\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3385",
    "input_seq": "What is the connection between AEP Paphos F.C. to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"AEP Paphos F.C.\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3386",
    "input_seq": "What visual artwork has the person whose pseudonym is Yeezy as a cast member?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <cast_member> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <pseudonym> ?pv . ?pv <pred:value> \"Yeezy\" .   }"
  },
  {
    "qid": "train_3387",
    "input_seq": "Among the independent cities with a population not equal to 98000, which one has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"98000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3388",
    "input_seq": "Is the street address of the University of South Florida 893 West St, Amherst, MA, 01002-5001 ?",
    "target_seq": "ASK { ?e <pred:name> \"University of South Florida\" . ?e <located_at_street_address> ?pv . ?pv <pred:value> \"893 West St, Amherst, MA, 01002-5001\" .  }"
  },
  {
    "qid": "train_3389",
    "input_seq": "The instrument played by Marcus Miller belongs to which instrument category?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e_1 <instrument> ?e . ?e_1 <pred:name> \"Marcus Miller\" .   }"
  },
  {
    "qid": "train_3390",
    "input_seq": "What can we say on the Cumann na nGaedheal's relation to Ireland (the one that is the release region of Moneyball)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cumann na nGaedheal\" . ?e_2 <pred:name> \"Ireland\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"Moneyball\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3391",
    "input_seq": "Was The Lion King (the one that received 67th Academy Awards) not published in 1975 (the place of publication of this statement is Sweden)?",
    "target_seq": "ASK { ?e <pred:name> \"The Lion King\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"67th Academy Awards\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1975 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }"
  },
  {
    "qid": "train_3392",
    "input_seq": "What is the character role of Jacqueline Bisset in Casino Royale, that was presented on 14th April 1967 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Casino Royale\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1967-04-14\"^^xsd:date . ?e_2 <pred:name> \"Jacqueline Bisset\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3393",
    "input_seq": "Of independent German cities with a population exceeding 8700, which is highest in elevation?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city of Germany\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"8700\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3394",
    "input_seq": "When did Frankfurt become the twin administrative body of Leipzig?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Frankfurt\" . ?e_2 <pred:name> \"Leipzig\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3395",
    "input_seq": "Which area has more people, Kingdom of Sardinia or Austrian Empire?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kingdom of Sardinia\" .  } UNION { ?e <pred:name> \"Austrian Empire\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3396",
    "input_seq": "Is the Stack Exchange tag of the academic discipline with the subreddit of abstractalgebra https://math.stackexchange.com/tags/abstract-algebra ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"abstractalgebra\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://math.stackexchange.com/tags/abstract-algebra\" .  }"
  },
  {
    "qid": "train_3397",
    "input_seq": "How many academic disciplines whose subreddit is AnimalRights and whose Dewey Decimal Classification is 590?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <subreddit> ?pv . ?pv <pred:value> \"AnimalRights\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"590\" .  }"
  },
  {
    "qid": "train_3398",
    "input_seq": "The visual artwork inspired by Aladdin, with Corey Burton as a voice actor, was released on 2019-05-24 in what location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"Aladdin\" . ?e_1 <voice_actor> ?e_2 . ?e_2 <pred:name> \"Corey Burton\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2019-05-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3399",
    "input_seq": "What is the connection between House (the one that has Geoffrey Lewis as a cast member) to John Cho?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"House\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Geoffrey Lewis\" . ?e_2 <pred:name> \"John Cho\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3400",
    "input_seq": "Which show has fewer episodes, The Twilight Zone (the one whose number of seasons is 1) or The Hitchhiker's Guide to the Galaxy (the one whose official website is http://www.bbc.co.uk/cult/hitchhikers/)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Twilight Zone\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1\"^^xsd:double . } UNION { ?e <pred:name> \"The Hitchhiker's Guide to the Galaxy\" . ?e <official_website> ?pv_2 . ?pv_2 <pred:value> \"http://www.bbc.co.uk/cult/hitchhikers/\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3401",
    "input_seq": "Tell me the title for America's Got Talent",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"America's Got Talent\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_3402",
    "input_seq": "Which movie titled Oliver Twist is distributed by Paramount Pictures?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Oliver Twist\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"Paramount Pictures\" .  }"
  },
  {
    "qid": "train_3403",
    "input_seq": "Patrick McGoohan was cast as what character on Braveheart, released in Greece?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Braveheart\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Greece\" . ?e_2 <pred:name> \"Patrick McGoohan\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3404",
    "input_seq": "How many museums have a visitor count per year that is not equal to 710000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"710000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3405",
    "input_seq": "How is \"The Grapes of Wrath,\" produced by Nunnally Johnson, related to \"The Grapes of Wrath,\" written by John Steinbeck?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Grapes of Wrath\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Nunnally Johnson\" . ?e_2 <pred:name> \"The Grapes of Wrath\" . ?e_2 <author> ?e_4 . ?e_4 <pred:name> \"John Steinbeck\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3406",
    "input_seq": "What is the connection between 58th Berlin International Film Festival to 59th Berlin International Film Festival?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"58th Berlin International Film Festival\" . ?e_2 <pred:name> \"59th Berlin International Film Festival\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3408",
    "input_seq": "Where was the movie titled Entourage released on 2015-06-25?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Entourage\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2015-06-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3409",
    "input_seq": "What film titled Donnie Darko casted Jena Malone?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jena Malone\" .  ?e <title> ?pv . ?pv <pred:value> \"Donnie Darko\" .  }"
  },
  {
    "qid": "train_3410",
    "input_seq": "What is the debut region of the visual artwork that is written by Virginia Woolf and has the release date 1993-01-28?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <after_a_work_by> ?e_1 . ?e_1 <pred:name> \"Virginia Woolf\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1993-01-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3411",
    "input_seq": "What province in China is the twinned administrative body of Odense?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Odense\" .   }"
  },
  {
    "qid": "train_3412",
    "input_seq": "What industry is associated with the platform of Marvel vs. Capcom 2: New Age of Heroes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e_1 <platform> ?e . ?e_1 <pred:name> \"Marvel vs. Capcom 2: New Age of Heroes\" .   }"
  },
  {
    "qid": "train_3413",
    "input_seq": "Does Montgomery County (whose FIPS 6-4 for US counties is 42091) or Butler County (whose area is 2058 square kilometers) have the larger land area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Montgomery County\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"42091\" . } UNION { ?e <pred:name> \"Butler County\" . ?e <area> ?pv_2 . ?pv_2 <pred:unit> \"square kilometre\" . ?pv_2 <pred:value> \"2058\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3414",
    "input_seq": "Which person's ISNI is 0000 0001 2031 8591?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2031 8591\" .  }"
  },
  {
    "qid": "train_3415",
    "input_seq": "How was it determined that Mendocino County has a population of 87841?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mendocino County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"87841\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_3416",
    "input_seq": "How much music was not created in 1979?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1979 ) .  }"
  },
  {
    "qid": "train_3417",
    "input_seq": "Where was Swept Away published on 2003-06-19?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Swept Away\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2003-06-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3418",
    "input_seq": "How many Protestantisms are set up in Detroit (which is the formation location of Stevie Wonder) and began after 1863?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Detroit\" . ?e_2 <location_of_formation> ?e_1 . ?e_2 <pred:name> \"Stevie Wonder\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1863 ) .  }"
  },
  {
    "qid": "train_3419",
    "input_seq": "Which of the French regions that started in 1972 is the smallest in area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"former French region\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:year> 1972 . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3420",
    "input_seq": "How long is the movie titled Hamilton?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hamilton\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_3421",
    "input_seq": "What is the exploitation visa number of Anna Karenina (the one whose release region is United States of America)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Anna Karenina\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <exploitation_visa_number> ?pv .  }"
  },
  {
    "qid": "train_3422",
    "input_seq": "Which person's Twitter username is Bitchuation (the subscription number of this statement is 21250)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Bitchuation\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"21250\"^^xsd:double .  }"
  },
  {
    "qid": "train_3423",
    "input_seq": "Is the official website of the House of Saxe-Coburg and Gotha http://www.sachsen-coburg-gotha.de/?",
    "target_seq": "ASK { ?e <pred:name> \"House of Saxe-Coburg and Gotha\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sachsen-coburg-gotha.de/\" .  }"
  },
  {
    "qid": "train_3425",
    "input_seq": "Is the birth name of a person that is not the same as Joe Walsh, citizen of the UK, equal to Virginia Cathryn Rowlands ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <different_from> ?e_1 . ?e_1 <pred:name> \"Joe Walsh\" . ?e_1 <country_of_citizenship> ?e_2 . ?e_2 <pred:name> \"United Kingdom\" .  ?e <birth_name> ?pv . ?pv <pred:value> \"Virginia Cathryn Rowlands\" .  }"
  },
  {
    "qid": "train_3426",
    "input_seq": "The 2002 award nomination for Melissa Etheridge ranks just below how many awards?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <next_higher_rank> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"award\" . ?e_2 <nominated_for> ?e_1 . ?e_2 <pred:name> \"Melissa Etheridge\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2002 .   }"
  },
  {
    "qid": "train_3427",
    "input_seq": "What point in time did Harold Faltermeyer receive the Grammy Award for Best Score Soundtrack for Visual Media?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harold Faltermeyer\" . ?e_2 <pred:name> \"Grammy Award for Best Score Soundtrack for Visual Media\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3428",
    "input_seq": "What is David Banner's (famous for Crunk) association to record production?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"David Banner\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"Crunk\" . ?e_2 <pred:name> \"record producer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3429",
    "input_seq": "Was An Alan Smithee Film: Burn Hollywood Burn published before 2011?",
    "target_seq": "ASK { ?e <pred:name> \"An Alan Smithee Film: Burn Hollywood Burn\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2011 ) .  }"
  },
  {
    "qid": "train_3430",
    "input_seq": "Which French region with a population other than 20000 has the most weddings per year?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"20000\"^^xsd:double ) . ?e <annual_number_of_weddings> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3431",
    "input_seq": "Was the member of Coventry City F.C. (the end time of this statement is 1976-01-01) not born in 1975?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Coventry City F.C.\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <end_time> ?qpv . ?qpv <pred:date> \"1976-01-01\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1975 ) .  }"
  },
  {
    "qid": "train_3432",
    "input_seq": "What is the title of Wag the Dog?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Wag the Dog\" .  }"
  },
  {
    "qid": "train_3433",
    "input_seq": "Of constitutional monarchies in the World Trade Organization, which possesses the highest real GDP rate of growth?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"constitutional monarchy\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"World Trade Organization\" .  ?e <real_gross_domestic_product_growth_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3434",
    "input_seq": "Is the elevation(above sea level) of the city that is the birthplace of James Mason (the one that uses the language Irish) greater than 50 foot ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"James Mason\" . ?e_1 <languages_spoken,_written_or_signed> ?e_2 . ?e_2 <pred:name> \"Irish\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"foot\" . ?pv <pred:value> ?v . FILTER ( ?v > \"50\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3435",
    "input_seq": "What is the official website of the movie titled Almost Famous?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Almost Famous\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3437",
    "input_seq": "How is Charles Boyer who plays guitar related to Montreal?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Charles Boyer\" . ?e_1 <instrument> ?e_3 . ?e_3 <pred:name> \"guitar\" . ?e_2 <pred:name> \"Montreal\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3438",
    "input_seq": "Who was taller, Jackie Robinson (the one whose ISNI is 0000 0000 8137 088X) or Christopher Reeve?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jackie Robinson\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8137 088X\" . } UNION { ?e <pred:name> \"Christopher Reeve\" . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3439",
    "input_seq": "How is the Rotherham designated by WOEID 33591 connected to the UK?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rotherham\" . ?e_1 <WOEID> ?pv . ?pv <pred:value> \"33591\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3440",
    "input_seq": "What is the connection between Star Trek (the one whose narrative location is Riverside) to Eric Bana?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Star Trek\" . ?e_1 <narrative_location> ?e_3 . ?e_3 <pred:name> \"Riverside\" . ?e_2 <pred:name> \"Eric Bana\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3441",
    "input_seq": "Was the person with the official website richardwright.net born post-1921 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://richardwright.net/\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1921 ) .  }"
  },
  {
    "qid": "train_3442",
    "input_seq": "What person was born before 1940 and has an ISNI of 0000 0001 1044 7015?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1940 ) . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1044 7015\" .  }"
  },
  {
    "qid": "train_3443",
    "input_seq": "How many students does the higher education institution that is located in Boca Raton have?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Boca Raton\" .  ?e <students_count> ?pv .  }"
  },
  {
    "qid": "train_3444",
    "input_seq": "How many mountain ranges are in the Appalachian Mountains or have the Adirondack Mountains as their \"child\"?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" .  { ?e <mountain_range> ?e_1 . ?e_1 <pred:name> \"Appalachian Mountains\" .  } UNION { ?e_1 <mountain_range> ?e . ?e_1 <pred:name> \"Adirondack Mountains\" .  } }"
  },
  {
    "qid": "train_3445",
    "input_seq": "Did the person in Tombstone die before 2012?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <present_in_work> ?e_1 . ?e_1 <pred:name> \"Tombstone\" .  ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2012 ) .  }"
  },
  {
    "qid": "train_3446",
    "input_seq": "How is You Only Live Twice whose exploitation visa number is 33590 related to Kyushu?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"You Only Live Twice\" . ?e_1 <exploitation_visa_number> ?pv . ?pv <pred:value> \"33590\" . ?e_2 <pred:name> \"Kyushu\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3447",
    "input_seq": "What is the birth name of the human that was nominated for a Golden Globe Award for Best Screenplay in 1982?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Golden Globe Award for Best Screenplay\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1982 . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_3448",
    "input_seq": "When was the population of the democracy that was the country having the 1992 Winter Olympics 58557072?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e_1 <country> ?e . ?e_1 <pred:name> \"1992 Winter Olympics\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"58557072\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  }
]