[
  {
    "qid": "train_409",
    "input_seq": "Is 0000 0001 1057 4188 the ISNI of the person who was nominated for the AACTA Award for Best Actress in a Leading Role for Home Song Stories?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"AACTA Award for Best Actress in a Leading Role\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"The Home Song Stories\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1057 4188\" .  }"
  },
  {
    "qid": "train_410",
    "input_seq": "What language is used on the official website of the university attended by Andrea Martin (the one that is educated at Emerson College) at  http://www.emerson.edu?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Andrea Martin\" . ?e_1 <educated_at> ?e_2 . ?e_2 <pred:name> \"Emerson College\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emerson.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_411",
    "input_seq": "Does Ryan Seacrest or Jacob Gedleyihlekisa Zuma have the lower personal net worth?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ryan Seacrest\" .  } UNION { ?e <pred:name> \"Jacob Gedleyihlekisa Zuma\" .  } ?e <net_worth> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_412",
    "input_seq": "What is the relationship between Lon Chaney and Lon Chaney Jr.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lon Chaney\" . ?e_2 <pred:name> \"Lon Chaney Jr.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_413",
    "input_seq": "When was the population of Sonoma County 484698?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sonoma County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"484698\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_414",
    "input_seq": "What is the street address of California State University's headquarters in Fresno, which has the postal code 93747?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"California State University, Fresno\" . ?e_2 <pred:name> \"Fresno\" . ?e_2 <postal_code> ?pv . ?pv <pred:value> \"93747\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <located_at_street_address_(DEPRECATED)> ?qpv .  }"
  },
  {
    "qid": "train_415",
    "input_seq": "What is the subject of a statement that Doctor Zhivago, published on 5th October 1966, received Academy Award for Best Writing, Adapted Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Doctor Zhivago\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1966-10-05\"^^xsd:date . ?e_2 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_416",
    "input_seq": "Which soccer club is represented by the English-language website www.revolutionsoccer.net ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.revolutionsoccer.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .  }"
  },
  {
    "qid": "train_417",
    "input_seq": "Is ARR111 the Caverphone for the female given name that uses the Finnish language?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"female given name\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"Finnish\" .  ?e <Caverphone> ?pv . ?pv <pred:value> \"ARR111\" .  }"
  },
  {
    "qid": "train_418",
    "input_seq": "What person has the ISNI 0000 0001 2023 4240?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2023 4240\" .  }"
  },
  {
    "qid": "train_419",
    "input_seq": "How many of Canada's provinces are located in or next to the Pacific Ocean and are different from Quebec City?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Canada\" . ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:name> \"Pacific Ocean\" .  ?e <different_from> ?e_2 . ?e_2 <pred:name> \"Quebec City\" .  }"
  },
  {
    "qid": "train_420",
    "input_seq": "Does France or Namibia have a higher retirement age?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"France\" .  } UNION { ?e <pred:name> \"Namibia\" .  } ?e <retirement_age> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_421",
    "input_seq": "Which area is smaller, Klamath County or Jackson County (the one that shares border with Klamath County)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Klamath County\" .  } UNION { ?e <pred:name> \"Jackson County\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Klamath County\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_422",
    "input_seq": "Which has fewer employees, Procter & Gamble or United States Department of the Treasury?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Procter & Gamble\" .  } UNION { ?e <pred:name> \"United States Department of the Treasury\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_423",
    "input_seq": "When was British Army member Jack Thompson born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jack Thompson\" . ?e <military_branch> ?e_1 . ?e_1 <pred:name> \"British Army\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_424",
    "input_seq": "Who had less children, Christopher Reeve or Matthew Modine?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Christopher Reeve\" .  } UNION { ?e <pred:name> \"Matthew Modine\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_425",
    "input_seq": "Is Roger Taylor (whose height is 183 centimeters) or Mark Bresciano shorter in height?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Roger Taylor\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"183\"^^xsd:double . } UNION { ?e <pred:name> \"Mark Bresciano\" . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_426",
    "input_seq": "When did the public university that is the employer of Ralph Vaughan Williams begin?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public university\" . ?e_1 <employer> ?e . ?e_1 <pred:name> \"Ralph Vaughan Williams\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_427",
    "input_seq": "When was Golden Lion founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Golden Lion\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_428",
    "input_seq": "What is the topic of the statement that Pakistan has a diplomatic relationship with Morocco whose citizens are the Marocchino people?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pakistan\" . ?e_2 <pred:name> \"Morocco\" . ?e_2 <demonym> ?pv . ?pv <pred:value> \"marocchino\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_429",
    "input_seq": "tell me the one with the smaller elevation (over sea level), Ballarat or Harare",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ballarat\" .  } UNION { ?e <pred:name> \"Harare\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_430",
    "input_seq": "How is The Lives of a Bengal Lancer related to Charles Lang?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Lives of a Bengal Lancer\" . ?e_2 <pred:name> \"Charles Lang\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_431",
    "input_seq": "How many animated films have the official website http://movies.disney.com/chicken-little or are narrated by Laurence Fishburne?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://movies.disney.com/chicken-little\" .  } UNION { ?e <narrator> ?e_1 . ?e_1 <pred:name> \"Laurence Fishburne\" .  } }"
  },
  {
    "qid": "train_432",
    "input_seq": "Of the colleges and universities in the US that count as the education place of Lawrence Bender, when were they established ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"colleges and universities in the United States\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Lawrence Bender\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_433",
    "input_seq": "Is Wanted published on 2009-01-01 or Showgirls longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wanted\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"Showgirls\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_434",
    "input_seq": "What is the duration for Heroes (the one whose genre is comedy-drama)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Heroes\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"comedy-drama\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_435",
    "input_seq": "How many art movements have an end time after 1750 and a Dewey Decimal Classification of 759.0663?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1750 ) . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"759.0663\" .  }"
  },
  {
    "qid": "train_436",
    "input_seq": "What is the birth date for the person who is a voice actor of Pocahontas (the one whose publication date is 1995-06-23) (the character role of this statement is Ben)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Pocahontas\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1995-06-23\"^^xsd:date . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Ben\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_437",
    "input_seq": "In what way is the city of London, which is served by Heathrow Airport, related to the writer Tom McCarthy?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tom McCarthy\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"writer\" . ?e_2 <pred:name> \"London\" . ?e_4 <place_served_by_transport_hub> ?e_2 . ?e_4 <pred:name> \"Heathrow Airport\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_438",
    "input_seq": "How many singles have won the award for which Mark Knopfler was a nominee?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <award_received> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"award\" . ?e_2 <nominated_for> ?e_1 . ?e_2 <pred:name> \"Mark Knopfler\" .   }"
  },
  {
    "qid": "train_439",
    "input_seq": "Which movie is titled Hudson Hawk?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Hudson Hawk\" .  }"
  },
  {
    "qid": "train_440",
    "input_seq": "Which visual artwork has the official website http://mrinalsen.org/genesis.htm and gained the exploitation visa number 61155 in 1986?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://mrinalsen.org/genesis.htm\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"61155\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:year> 1986 .  }"
  },
  {
    "qid": "train_441",
    "input_seq": "Is David Letterman or Diane Sawyer personally worth more than the other?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"David Letterman\" .  } UNION { ?e <pred:name> \"Diane Sawyer\" .  } ?e <net_worth> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_442",
    "input_seq": "Whose pseudonym is Boz?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Boz\" .  }"
  },
  {
    "qid": "train_443",
    "input_seq": "Is Shopgirl or Mulan, which clocks in at 113 minutes, the longer of the two?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Shopgirl\" . } UNION { ?e <pred:name> \"Mulan\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"113\"^^xsd:double . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_444",
    "input_seq": "Tell me the relationship between Don DeLillo and J. G. Ballard",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Don DeLillo\" . ?e_2 <pred:name> \"J. G. Ballard\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_445",
    "input_seq": "What does Finland have to do with Swedish?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Finland\" . ?e_2 <pred:name> \"Swedish\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_447",
    "input_seq": "Does the website www.miramax.com/movie/doubt represent the TV series titled Project Runway ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Project Runway\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.miramax.com/movie/doubt\" .  }"
  },
  {
    "qid": "train_448",
    "input_seq": "What legislative term does the United States Congress follow whose start time is on 2009-01-03?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"legislative term\" . ?e <followed_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"United States Congress\" . ?e_1 <start_time> ?pv . ?pv <pred:date> \"2009-01-03\"^^xsd:date .   }"
  },
  {
    "qid": "train_449",
    "input_seq": "The community college with ISNI # 0000 0004 0401 5568 is represented in which language on its official website, www.pasadena.edu?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"community college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0401 5568\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.pasadena.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_450",
    "input_seq": "What is the subject of the statement that South Africa has a diplomatic relationship with Bulgaria?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"South Africa\" . ?e_2 <pred:name> \"Bulgaria\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_451",
    "input_seq": "How many MTV Movie Awards were received by Mark Ruffalo or nominated to Robert Pattinson?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Movie Awards\" .  { ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Mark Ruffalo\" .  } UNION { ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Robert Pattinson\" .  } }"
  },
  {
    "qid": "train_452",
    "input_seq": "What is the legislative body of the political party that has a member named Suresh Gopi and representatives in an organization/legislature numbering 117?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e_1 <member_of_political_party> ?e . ?e_1 <pred:name> \"Suresh Gopi\" .  ?e <number_of_representatives_in_an_organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_representatives_in_an_organization/legislature> ; <pred:fact_t> ?pv ] <legislative_body> ?qpv .  }"
  },
  {
    "qid": "train_453",
    "input_seq": "What is the release date of the visual artwork titled Rabindranath Tagore?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Rabindranath Tagore\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_454",
    "input_seq": "Which person's ISNI is 0000 0001 1616 4796?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1616 4796\" .  }"
  },
  {
    "qid": "train_455",
    "input_seq": "Does Umbria or Abruzzo have more area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Umbria\" .  } UNION { ?e <pred:name> \"Abruzzo\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_456",
    "input_seq": "How many kinds of musicians are designated by ROME Occupation Code (v3) L1101 or ISCO occupation code 2453?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musician\" .  { ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1101\" .  } UNION { ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2453\" .  } }"
  },
  {
    "qid": "train_457",
    "input_seq": "When did Ethan Hawke become Uma Thurman's husband?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ethan Hawke\" . ?e_2 <pred:name> \"Uma Thurman\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_458",
    "input_seq": "When did Ben Cross get educated at Royal Academy of Dramatic Art?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ben Cross\" . ?e_2 <pred:name> \"Royal Academy of Dramatic Art\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_459",
    "input_seq": "Is http://www.sfsite.com/~silverag/turtledove.html the official website for Harry Turtledove?",
    "target_seq": "ASK { ?e <pred:name> \"Harry Turtledove\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sfsite.com/~silverag/turtledove.html\" .  }"
  },
  {
    "qid": "train_460",
    "input_seq": "How many record labels began outside of 1980 or includes the record label Nuclear Blast?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1980 ) .  } UNION { ?e <record_label> ?e_1 . ?e_1 <pred:name> \"Nuclear Blast\" .  } }"
  },
  {
    "qid": "train_461",
    "input_seq": "How are Lost and the Lost cast member Jeremy Davies related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lost\" . ?e_2 <pred:name> \"Jeremy Davies\" . ?e_3 <cast_member> ?e_2 . ?e_3 <pred:name> \"Lost\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_462",
    "input_seq": "Which show has fewer episodes, Twin Peaks (the one whose number of seasons is 1) or WCW Monday Nitro?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Twin Peaks\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1\"^^xsd:double . } UNION { ?e <pred:name> \"WCW Monday Nitro\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_463",
    "input_seq": "Does Grove Street Cemetery have a NRHP reference number equal to 82001281?",
    "target_seq": "ASK { ?e <pred:name> \"Grove Street Cemetery\" . ?e <NRHP_reference_number> ?pv . ?pv <pred:value> \"82001281\" .  }"
  },
  {
    "qid": "train_464",
    "input_seq": "Which one, Monroe County (the one that shares border with Ontario County) or Erie County (the one whose population is 922578), has less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Monroe County\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Ontario County\" . } UNION { ?e <pred:name> \"Erie County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"922578\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_465",
    "input_seq": "Is 4000000074545870 the TOID of King's Lynn and West Norfolk?",
    "target_seq": "ASK { ?e <pred:name> \"King's Lynn and West Norfolk\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074545870\" .  }"
  },
  {
    "qid": "train_466",
    "input_seq": "Which Pennsylvania city whose population is not 670000000 has the lowest elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of Pennsylvania\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"670000000\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_467",
    "input_seq": "When did Lost in Translation get nominated for Golden Globe Award for Best Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lost in Translation\" . ?e_2 <pred:name> \"Golden Globe Award for Best Screenplay\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_468",
    "input_seq": "How many governorships belong to the country Peru or the USA?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"Peru\" .  } UNION { ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  } }"
  },
  {
    "qid": "train_469",
    "input_seq": "Is the person with the CANTIC-ID of a11709984 have the Twitter username MarthaPlimpton?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11709984\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"MarthaPlimpton\" .  }"
  },
  {
    "qid": "train_470",
    "input_seq": "What is the number of conservatories whose students number is not equal to 66000 or that is named after Nikolai Rimsky-Korsakov ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" .  { ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"66000\"^^xsd:double ) .  } UNION { ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Nikolai Rimsky-Korsakov\" .  } }"
  },
  {
    "qid": "train_471",
    "input_seq": "Milla Jovovich plays what character on The Fifth Element, which also includes Gary Oldman as a cast member?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Fifth Element\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Gary Oldman\" . ?e_2 <pred:name> \"Milla Jovovich\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_472",
    "input_seq": "How many officials are a part of United States Cabinet and have the official website of http://www.pm.gc.ca/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"United States Cabinet\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.pm.gc.ca/\" .  }"
  },
  {
    "qid": "train_473",
    "input_seq": "Of democracies belonging to the European Union, which possesses the lowest total reserves amount?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"European Union\" .  ?e <total_reserves> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_474",
    "input_seq": "Where was released the fill that followed Transformers: Revenge of the Fallen (the one nominated for MTV Movie Award for Best Jaw Dropping Moment) in 2011-06-23?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e_1 <followed_by> ?e . ?e_1 <pred:name> \"Transformers: Revenge of the Fallen\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"MTV Movie Award for Best Jaw Dropping Moment\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2011-06-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_475",
    "input_seq": "What is the action video whose narrative location was in France?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"France\" .  ?e <genre> ?e_2 . ?e_2 <pred:name> \"action game\" .  }"
  },
  {
    "qid": "train_476",
    "input_seq": "What is the character role of Paul McCartney in  Yellow Submarine (the one whose release region is France)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Yellow Submarine\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"France\" . ?e_2 <pred:name> \"Paul McCartney\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_477",
    "input_seq": "Asteras Tripoli F.C. is related in what way to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Asteras Tripoli F.C.\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_478",
    "input_seq": "What was the time of dissolution of the agency that published Batman Forever on 1995-01-01?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e_1 <publisher> ?e . ?e_1 <pred:name> \"Batman Forever\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }"
  },
  {
    "qid": "train_479",
    "input_seq": "How many medications are the treatment of the the infectious disease that causes the death of Patty Duke?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e_1 <drug_used_for_treatment> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"infectious disease\" . ?e_2 <cause_of_death> ?e_1 . ?e_2 <pred:name> \"Patty Duke\" .   }"
  },
  {
    "qid": "train_480",
    "input_seq": "When was the association football club, whose official website is https://cponline.pw/es/, founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://cponline.pw/es/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_481",
    "input_seq": "The public office with the native label Governor of Texas is represented on its official website, www.governor.state.tx.us, in which tongue?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public office\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Governor of Texas\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.governor.state.tx.us/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_482",
    "input_seq": "What is the connection between 2046 to Zhang Ziyi?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2046\" . ?e_2 <pred:name> \"Zhang Ziyi\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_483",
    "input_seq": "Is the ISNI of the person with the Instagram username of michaelstipe 0000 0001 0663 7289 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"michaelstipe\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0663 7289\" .  }"
  },
  {
    "qid": "train_484",
    "input_seq": "What is the relationship between The Devil Wears Prada (the one whose ISBN-10 is 84-01-37869-9) to novel?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Devil Wears Prada\" . ?e_1 <ISBN-10> ?pv . ?pv <pred:value> \"84-01-37869-9\" . ?e_2 <pred:name> \"novel\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_485",
    "input_seq": "How many actors are sketch comedians and are matched to ROME Occupation Code (v3) L1204?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" . ?e <field_of_this_occupation> ?e_1 . ?e_1 <pred:name> \"sketch comedy\" .  ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1204\" .  }"
  },
  {
    "qid": "train_486",
    "input_seq": "Was the produced by Sammo Hung published more recently than 1921 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Sammo Hung\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1921 ) .  }"
  },
  {
    "qid": "train_487",
    "input_seq": "What country does the headquarters of Royal College of Music in London (the one that is the working location of Douglas Haig, 1st Earl Haig) belong to ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Royal College of Music\" . ?e_2 <pred:name> \"London\" . ?e_3 <work_location> ?e_2 . ?e_3 <pred:name> \"Douglas Haig, 1st Earl Haig\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_488",
    "input_seq": "Vicky Cristina Barcelona is the namesake for how many TV episodes released post-1990?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Vicky Cristina Barcelona\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1990 ) .  }"
  },
  {
    "qid": "train_489",
    "input_seq": "Which area is smaller, Isfahan or Townsville?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Isfahan\" .  } UNION { ?e <pred:name> \"Townsville\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_490",
    "input_seq": "Does folic acid or L-phenylalanine have less mass?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"folic acid\" .  } UNION { ?e <pred:name> \"L-phenylalanine\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  }
]