[
  {
    "qid": "train_653",
    "input_seq": "Was it costlier to make American Psycho or the work titled Lemony Snicket's A Series of Unfortunate Events?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"American Psycho\" . } UNION { ?e <pred:name> \"Lemony Snicket's A Series of Unfortunate Events\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Lemony Snicket's A Series of Unfortunate Events\" . } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_654",
    "input_seq": "How many sounds have an inception time that is not in 1948 or have an inception time that is after 1960?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1948 ) .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1960 ) .  } }"
  },
  {
    "qid": "train_655",
    "input_seq": "Is the postal code of Casablanca (the one whose ISO 3166-2 code is MA-CAS) 60079, 60085 or 60087?",
    "target_seq": "ASK { ?e <pred:name> \"Casablanca\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"MA-CAS\" . ?e <postal_code> ?pv . ?pv <pred:value> \"60079, 60085, 60087\" .  }"
  },
  {
    "qid": "train_656",
    "input_seq": "How many superheroes we know whose catalog code is Bruce_Banner_(Earth-616) or that serve as the basis for  Superman IV: The Quest for Peace    ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" .  { ?e <catalog_code> ?pv . ?pv <pred:value> \"Bruce_Banner_(Earth-616)\" .  } UNION { ?e_1 <based_on> ?e . ?e_1 <pred:name> \"Superman IV: The Quest for Peace\" .  } }"
  },
  {
    "qid": "train_657",
    "input_seq": "What is the native language name of Hal Mohr?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hal Mohr\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_658",
    "input_seq": "What is the connection between Jung Sung-ryong to Suwon Samsung Bluewings?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jung Sung-ryong\" . ?e_2 <pred:name> \"Suwon Samsung Bluewings\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_659",
    "input_seq": "Is the ISNI equal to 0000 0001 2130 5709 for the human whose date of death is on 2006-05-30?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"2006-05-30\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2130 5709\" .  }"
  },
  {
    "qid": "train_660",
    "input_seq": "Who is Stanley Tucci's brother-in-law?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <relative> ?e . ?e_1 <pred:name> \"Stanley Tucci\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <relative> ; <pred:fact_t> ?e ] <type_of_kinship> ?qpv . ?qpv <pred:value> \"brother-in-law\" .  }"
  },
  {
    "qid": "train_661",
    "input_seq": "What is the birth date of the person employed in Havana, Tijuana's administrative body twin?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <work_location> ?e_1 . ?e_1 <pred:name> \"Havana\" . ?e_1 <twinned_administrative_body> ?e_2 . ?e_2 <pred:name> \"Tijuana\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_662",
    "input_seq": "Which city with under 15000000 population has the official website http://www.districtabidjan.ci/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.districtabidjan.ci/\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"15000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_663",
    "input_seq": "What poetries are the genre of Leonard Cohen and the genre of John Cale?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"poetry\" . ?e_1 <genre> ?e . ?e_1 <pred:name> \"Leonard Cohen\" .  ?e_2 <genre> ?e . ?e_2 <pred:name> \"John Cale\" .  }"
  },
  {
    "qid": "train_664",
    "input_seq": "What is the beginning date that the United States of America contains the Idaho administrative division whose nickname is Gem State?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Idaho\" . ?e_2 <nickname> ?pv . ?pv <pred:value> \"Gem State\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_665",
    "input_seq": "How many Oregon counties have a population size below 1400000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"1400000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_666",
    "input_seq": "Which has fewer people, Brandenburg (the one whose area is 27612 square kilometre) or Sonora?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brandenburg\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"27612\"^^xsd:double . } UNION { ?e <pred:name> \"Sonora\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_667",
    "input_seq": "What is the title of Walk Hard: The Dewey Cox Story?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Walk Hard: The Dewey Cox Story\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_668",
    "input_seq": "Is the TOID  of the town that borders Reading 4000000074568680 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Reading\" . ?e_1 <capital_of> ?e_2 . ?e_2 <pred:name> \"Berkshire\" .  ?e <TOID> ?pv . ?pv <pred:value> \"4000000074568680\" .  }"
  },
  {
    "qid": "train_669",
    "input_seq": "Of Washington counties bordering Kitsap County, which occupies the most area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Kitsap County\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_670",
    "input_seq": "Does Brunswick whose local area code is 912 or Santa Clara have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brunswick\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"912\" . } UNION { ?e <pred:name> \"Santa Clara\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_671",
    "input_seq": "What is the connection between the United States Air Force Academy and El Paso County (where the population is 636878)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"United States Air Force Academy\" . ?e_2 <pred:name> \"El Paso County\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"636878\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_672",
    "input_seq": "Is the Black and White version of Gangs of New York the same as The Big Lebowski?",
    "target_seq": "ASK { ?e <pred:name> \"Gangs of New York\" . ?e <color> ?e_1 . ?e_1 <pred:name> \"black-and-white\" .  ?e <title> ?pv . ?pv <pred:value> \"The Big Lebowski\" .  }"
  },
  {
    "qid": "train_673",
    "input_seq": "Was Nancy Cartwright (the one whose ISNI is 0000 0001 1559 5623) born after 1917?",
    "target_seq": "ASK { ?e <pred:name> \"Nancy Cartwright\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1559 5623\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1917 ) .  }"
  },
  {
    "qid": "train_674",
    "input_seq": "When did the independent city whose ISNI is 0000 0004 0390 9412 have a population of 22597?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0390 9412\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"22597\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_675",
    "input_seq": "How is Christopher Nolan who died on 2009-02-20 related to writer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Christopher Nolan\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"2009-02-20\"^^xsd:date . ?e_2 <pred:name> \"writer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_676",
    "input_seq": "Who was the winner of an award given to ALi Larter, called MTV Movie Award for Best Fight ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ali Larter\" . ?e_2 <pred:name> \"MTV Movie Award for Best Fight\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <winner> ?qpv .  }"
  },
  {
    "qid": "train_677",
    "input_seq": "Does Tuolumne County or Humboldt County have the smaller land area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tuolumne County\" .  } UNION { ?e <pred:name> \"Humboldt County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_678",
    "input_seq": "Who has more children, Nikolai Rimsky-Korsakov or Grover Cleveland?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nikolai Rimsky-Korsakov\" .  } UNION { ?e <pred:name> \"Grover Cleveland\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_679",
    "input_seq": "What is the Twitter username of the ice hockey team whose official website is http://bruins.nhl.com/ (the language of this statement is English)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ice hockey team\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://bruins.nhl.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_680",
    "input_seq": "Which disease has UMLS CUI as C0017168 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0017168\" .  }"
  },
  {
    "qid": "train_681",
    "input_seq": "What is the connection between Twister (the one whose official website is http://www.movies.warnerbros.com/twister) to Jeremy Davies (the one that is a cast member of Dogville)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Twister\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.movies.warnerbros.com/twister\" . ?e_2 <pred:name> \"Jeremy Davies\" . ?e_3 <cast_member> ?e_2 . ?e_3 <pred:name> \"Dogville\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_682",
    "input_seq": "How is Anita Baker related to soul music?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Anita Baker\" . ?e_2 <pred:name> \"soul music\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_683",
    "input_seq": "I'd like to know the number of legislative terms that are followed by 35th Canadian Parliament or Donald M Payne participated in.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"legislative term\" .  { ?e <followed_by> ?e_1 . ?e_1 <pred:name> \"35th Canadian Parliament\" .  } UNION { ?e <participant> ?e_1 . ?e_1 <pred:name> \"Donald M. Payne\" .  } }"
  },
  {
    "qid": "train_684",
    "input_seq": "Which movie is longer, The Guns of Navarone or Jay and Silent Bob Strike Back?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Guns of Navarone\" .  } UNION { ?e <pred:name> \"Jay and Silent Bob Strike Back\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_685",
    "input_seq": "What is the ISNI of the person whose CANTIC-ID is a10408836?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a10408836\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_686",
    "input_seq": "When did the sovereign state with INSEE countries and foreign territories code 99336 have a population size of 1,490,842?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <INSEE_countries_and_foreign_territories_code> ?pv_1 . ?pv_1 <pred:value> \"99336\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1490842\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_687",
    "input_seq": "tell me the date of birth for the person who has an ISNI of 0000 0001 1436 599X",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1436 599X\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_688",
    "input_seq": "At what point in time is 206512 the population of the Oregon county with FIPS 6-4 (US counties) 41029?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"41029\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"206512\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_689",
    "input_seq": "What language is associated with the official website http://www.tonyawards.com/en_US/index.html of the theatre award for which Sean Hayes was a nominee in 2010?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Sean Hayes\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:year> 2010 . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tonyawards.com/en_US/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_690",
    "input_seq": "When was the person whose official website is http://www.madinsanity.com born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.madinsanity.com\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_691",
    "input_seq": "Which zip code is assigned to the New England Conservatory of Music?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"New England Conservatory of Music\" . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_692",
    "input_seq": "Of all the anime that do not have 8000 episodes, which has the most episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"8000\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_693",
    "input_seq": "How many cities ISNI is 0000 0004 0635 5291 at New York?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0635 5291\" .  }"
  },
  {
    "qid": "train_694",
    "input_seq": "What is the connection between Jenna Bush Hager to teacher?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jenna Bush Hager\" . ?e_2 <pred:name> \"teacher\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_695",
    "input_seq": "Does someone associated with the notable work titled American History X have a Twitter account named tomscott?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <notable_work> ?e_1 . ?e_1 <pred:name> \"American History X\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"tomscott\" .  }"
  },
  {
    "qid": "train_696",
    "input_seq": "Which is shorter, Midnight in the Garden of Good and Evil or Sergeant York?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Midnight in the Garden of Good and Evil\" .  } UNION { ?e <pred:name> \"Sergeant York\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_697",
    "input_seq": "Which has the largest vertical depth among the seas whose vertical depth is not 580 metres?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <vertical_depth> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"580\"^^xsd:double ) . ?e <vertical_depth> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_698",
    "input_seq": "Which one of rivers, whose discharge is less or more than 6,900 cubic meters per second, has the largest watershed area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <discharge> ?pv_1 . ?pv_1 <pred:unit> \"cubic metre per second\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"6900\"^^xsd:double ) . ?e <watershed_area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_699",
    "input_seq": "Is the dissolution date of the sovereign state that is followed by Russian Soviet Federative Socialist Republic (the one that is a part of Soviet Union), before 1931 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <follows> ?e . ?e_1 <pred:name> \"Russian Soviet Federative Socialist Republic\" . ?e_2 <has_part> ?e_1 . ?e_2 <pred:name> \"Soviet Union\" .  ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1931 ) .  }"
  },
  {
    "qid": "train_700",
    "input_seq": "Which one, Taxi (the one whose producer is James L. Brooks) or Search for Tomorrow, has the greater number of seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Taxi\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"James L. Brooks\" .   } UNION { ?e <pred:name> \"Search for Tomorrow\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_701",
    "input_seq": "Is the population greater than 97000 (in the determination method of demographic balance) for the county of New York that is named after James Madison (who has the occupation of writer)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"James Madison\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"writer\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"97000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv . ?qpv <pred:value> \"demographic balance\" .  }"
  },
  {
    "qid": "train_702",
    "input_seq": "Is the Fred Thompson employed in Washington, D.C. or Kristen Stewart shorter than the other?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fred Thompson\" . ?e <work_location> ?e_1 . ?e_1 <pred:name> \"Washington, D.C.\" .   } UNION { ?e <pred:name> \"Kristen Stewart\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_703",
    "input_seq": "Which movie is titled Blow?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Blow\" .  }"
  },
  {
    "qid": "train_704",
    "input_seq": "Which is the record label of the person whose LINE is 0000 0001 1312 8108?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e_1 <record_label> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1312 8108\" .   }"
  },
  {
    "qid": "train_705",
    "input_seq": "Is there a person with a death date of 1812-04-20 and an ISNI number of 0000 0000 6317?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1812-04-20\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 6317 8800\" .  }"
  },
  {
    "qid": "train_706",
    "input_seq": "How many positions have the Twitter username of FLOTUS or are said to be the same as president (the one that is the position of Donald M. Payne)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" .  { ?e <Twitter_username> ?pv . ?pv <pred:value> \"FLOTUS\" .  } UNION { ?e_1 <said_to_be_the_same_as> ?e . ?e_1 <pred:name> \"president\" . ?e_2 <position_held> ?e_1 . ?e_2 <pred:name> \"Donald M. Payne\" .  } }"
  },
  {
    "qid": "train_707",
    "input_seq": "How many episodes in the TV series based on Rush Hour (the one whose publication date is 1999-03-25)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"Rush Hour\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1999-03-25\"^^xsd:date . ?e <number_of_episodes> ?pv .  }"
  },
  {
    "qid": "train_708",
    "input_seq": "What is the character role of Milla Jovovich in Resident Evil (the one whose release region is South Korea)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Resident Evil\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"South Korea\" . ?e_2 <pred:name> \"Milla Jovovich\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_709",
    "input_seq": "When ddi Guildford, having an OS grid reference of TQ0105550700, have a population of 146100?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Guildford\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ0105550700\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"146100\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_710",
    "input_seq": "At what point in time is 20971901273.271 United States dollars the nominal GDP of the sovereign state that shares the Algeria–Tunisia border with Tunisia?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Tunisia\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"Algeria–Tunisia border\" . ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"20971901273.271\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_711",
    "input_seq": "What state is located in or next to the sea that is located on a North Sea terrain feature?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sea\" . ?e_1 <located_on_terrain_feature> ?e_2 . ?e_2 <pred:name> \"North Sea\" .   }"
  },
  {
    "qid": "train_712",
    "input_seq": "How is dyslexia related to Pablo Picasso?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"dyslexia\" . ?e_2 <pred:name> \"Pablo Picasso\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_713",
    "input_seq": "Is the population lower in Modesto or Denton?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Modesto\" .  } UNION { ?e <pred:name> \"Denton\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_714",
    "input_seq": "Which movie is shorter, The Amazing Spider-Man (the one whose release region is United States of America) or The Adventures of Ford Fairlane?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Amazing Spider-Man\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"The Adventures of Ford Fairlane\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_715",
    "input_seq": "Which person was born 6th September 1893 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1893-09-06\"^^xsd:date .  }"
  },
  {
    "qid": "train_716",
    "input_seq": "When did the Bahamas, with a GDP of 573400000 USD, become Nassau's country ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nassau\" . ?e_2 <pred:name> \"Bahamas\" . ?e_2 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"573400000\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_717",
    "input_seq": "Is the official website of the United States city that began in 1771 http://www.niagarafalls.ca/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1771 . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.niagarafalls.ca/\" .  }"
  },
  {
    "qid": "train_718",
    "input_seq": "Was the activity whose official website is http://www.footballconference.co.uk not founded in 2003?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.footballconference.co.uk\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2003 ) .  }"
  },
  {
    "qid": "train_719",
    "input_seq": "How was the total fertility rate of 5.478 determined for Guinea-Bissau?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Guinea-Bissau\" . ?e <total_fertility_rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.478\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <total_fertility_rate> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_720",
    "input_seq": "Did the television series whose official website is http://www.cwtv.com/shows/dynasty/ start after 1996?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cwtv.com/shows/dynasty/\" . ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1996 ) .  }"
  },
  {
    "qid": "train_721",
    "input_seq": "What is the work period start of the person that produced Eat Pray Love?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <producer> ?e . ?e_1 <pred:name> \"Eat Pray Love\" .  ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_722",
    "input_seq": "Is Earth (released 1998-01-01) or Night at the Museum: Battle of the Smithsonian (starring Dick Van Dyke) longer in duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Earth\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"Night at the Museum: Battle of the Smithsonian\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Dick Van Dyke\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_723",
    "input_seq": "What is the ISNI of the person whose Twitter username is IamLaceyChabert (the subscription number of this statement is 197526)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"IamLaceyChabert\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"197526\"^^xsd:double . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_724",
    "input_seq": "Leonard Nimoy is cast in which role on Star Trek Ⅳ: The Voyage Home?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Star Trek Ⅳ: The Voyage Home\" . ?e_2 <pred:name> \"Leonard Nimoy\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_725",
    "input_seq": "What is the connection between Fred Zinnemann to London (the one that is the headquarter location of London School of Economics)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fred Zinnemann\" . ?e_2 <pred:name> \"London\" . ?e_3 <headquarters_location> ?e_2 . ?e_3 <pred:name> \"London School of Economics\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_726",
    "input_seq": "How many woodwind instruments whose Hornbostel-Sachs classification is 422.212-71 or whose famous people is John Coltrane?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"woodwind instrument\" .  { ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.212-71\" .  } UNION { ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"John Coltrane\" .  } }"
  },
  {
    "qid": "train_727",
    "input_seq": "Which organization has the official website of http://www.afdb.org/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.afdb.org/\" .  }"
  },
  {
    "qid": "train_728",
    "input_seq": "What is the relationship between Made in Dagenham and Andrew Lincoln?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Made in Dagenham\" . ?e_2 <pred:name> \"Andrew Lincoln\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_729",
    "input_seq": "How close is Inyo county to San Bernardino county?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Inyo County\" . ?e_2 <pred:name> \"San Bernardino County\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_730",
    "input_seq": "How many football positions are related to the sport of Jack Thompson who was born on 1956-05-18?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football position\" . ?e <sport> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"type of sport\" . ?e_2 <sport> ?e_1 . ?e_2 <pred:name> \"Jack Thompson\" . ?e_2 <date_of_birth> ?pv . ?pv <pred:date> \"1956-05-18\"^^xsd:date .   }"
  },
  {
    "qid": "train_731",
    "input_seq": "Which person's sport number is 29?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <sport_number> ?pv . ?pv <pred:value> \"29\" .  }"
  },
  {
    "qid": "train_732",
    "input_seq": "Is Lionel Messi's ISNI code 0000 0004 0700 8697 ?",
    "target_seq": "ASK { ?e <pred:name> \"Lionel Messi\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0700 8697\" .  }"
  }
]