[
  {
    "qid": "train_3285",
    "input_seq": "What is the number of Screen Actors Guilt Awards that is won by the person with the official website http://www.gandolfini.com",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Screen Actors Guild Award\" . ?e <winner> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.gandolfini.com\" .   }"
  },
  {
    "qid": "train_3286",
    "input_seq": "How is Cebu City related to a mayor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cebu City\" . ?e_2 <pred:name> \"mayor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3287",
    "input_seq": "Is the population for the city of the United States of America whose official website is http://www.moline.il.us not eaqual to 5700?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.moline.il.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"5700\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3288",
    "input_seq": "Ghost Rider, originating in the USA, has what link to Texas, with the demonym Tejano?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ghost Rider\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Texas\" . ?e_2 <demonym> ?pv . ?pv <pred:value> \"Tejano\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3289",
    "input_seq": "How are Bulworth and Don Cheadle related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bulworth\" . ?e_2 <pred:name> \"Don Cheadle\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3290",
    "input_seq": "When was Cory Monteith the SAG Award winner for Outstanding Performance by an Ensemble in a Comedy Series?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series\" . ?e_2 <pred:name> \"Cory Monteith\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3291",
    "input_seq": "Which person won the Academy Award for Best Supporting Actor for work on The Usual Suspects?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Usual Suspects\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <winner> ?qpv .  }"
  },
  {
    "qid": "train_3292",
    "input_seq": "What work did Harold Perrineau receive a Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series for?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harold Perrineau\" . ?e_2 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3293",
    "input_seq": "Did the person whose ISNI is 0000 0001 1875 4925 die after 1978?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1875 4925\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1978 ) .  }"
  },
  {
    "qid": "train_3294",
    "input_seq": "What number of women's given names use English or have Lotte as a nickname?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"female given name\" .  { ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" .  } UNION { ?e <nickname> ?pv . ?pv <pred:value> \"Lotte\" .  } }"
  },
  {
    "qid": "train_3295",
    "input_seq": "At what point in time is 29298 the population of the administrative territorial entity that shares a border with Kanawha County?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Kanawha County\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29298\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3296",
    "input_seq": "How many symptoms are caused by the therapy that is a risk factor of anemia?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e <has_cause> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"therapy\" . ?e_1 <risk_factor> ?e_2 . ?e_2 <pred:name> \"anemia\" .   }"
  },
  {
    "qid": "train_3297",
    "input_seq": "As of 1903, what city in the US is the headquarter of Seventh-day Adventist Church?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <headquarters_location> ?e . ?e_1 <pred:name> \"Seventh-day Adventist Church\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:year> 1903 .  }"
  },
  {
    "qid": "train_3298",
    "input_seq": "Which movie is shorter, Striptease or Days of Heaven?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Striptease\" .  } UNION { ?e <pred:name> \"Days of Heaven\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3299",
    "input_seq": "What has The Help (the one whose release region is Chile) in common with Jessica Chastain?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Help\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Chile\" . ?e_2 <pred:name> \"Jessica Chastain\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3300",
    "input_seq": "What agent has the motto text Just Do It?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <motto_text> ?pv . ?pv <pred:value> \"Just Do It\" .  }"
  },
  {
    "qid": "train_3301",
    "input_seq": "Does Indiana Jones and the Kingdom of the Crystal Skull or To Rome with Love have the lower box office?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Indiana Jones and the Kingdom of the Crystal Skull\" .  } UNION { ?e <pred:name> \"To Rome with Love\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3302",
    "input_seq": "Was Nancy Pelosi born in a year other than 1902 ?",
    "target_seq": "ASK { ?e <pred:name> \"Nancy Pelosi\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1902 ) .  }"
  },
  {
    "qid": "train_3303",
    "input_seq": "What is the relationship between the Second Crusade and the Byzantine Empire?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Second Crusade\" . ?e_2 <pred:name> \"Byzantine Empire\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3304",
    "input_seq": "Which is shorter: The Notebook at 109 minutes or Kick-Ass, nominated for a BIFA Award for Best British Independent Film?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Notebook\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"109\"^^xsd:double . } UNION { ?e <pred:name> \"Kick-Ass\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BIFA Award for Best British Independent Film\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3305",
    "input_seq": "Which census designated place has the largest elevation above sea level that is less than 300 meters?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"census-designated place\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"300\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3306",
    "input_seq": "When was the person who directed Nine Lives (the one that origins from France) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"Nine Lives\" . ?e_1 <country_of_origin> ?e_2 . ?e_2 <pred:name> \"France\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3307",
    "input_seq": "Which movie is shorter, Apache (the one that has Burt Lancaster as a cast member) or Hamlet (the one whose composer is Ennio Morricone)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Apache\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Burt Lancaster\" .   } UNION { ?e <pred:name> \"Hamlet\" . ?e <composer> ?e_2 . ?e_2 <pred:name> \"Ennio Morricone\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3308",
    "input_seq": "What is Lena Olin's relation with Stockholm?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lena Olin\" . ?e_2 <pred:name> \"Stockholm\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3309",
    "input_seq": "How many research scientists practice in the field of mathematics under the umbrella of economics?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" . ?e_1 <practiced_by> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"mathematics\" . ?e_1 <part_of> ?e_2 . ?e_2 <pred:name> \"economics\" .   }"
  },
  {
    "qid": "train_3310",
    "input_seq": "How many subscribers do the Kansas City Royals have under their Twitter username Royals?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kansas City Royals\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Royals\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3311",
    "input_seq": "What is the connection between On Golden Pond (the one whose publication date is 2001-01-01) to Julie Andrews?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"On Golden Pond\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2001-01-01\"^^xsd:date . ?e_2 <pred:name> \"Julie Andrews\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3312",
    "input_seq": "The Japanese prefecture designated by Corporate Number (Japan) 2000020080004 borders how many other Japanese prefectures?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"prefecture of Japan\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"prefecture of Japan\" . ?e_1 <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"2000020080004\" .   }"
  },
  {
    "qid": "train_3313",
    "input_seq": "Which has a greater duration, Twister (whose official website is http://www.movies.warnerbros.com/twister) or Mr. Nobody?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Twister\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.movies.warnerbros.com/twister\" . } UNION { ?e <pred:name> \"Mr. Nobody\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3314",
    "input_seq": "How is Timeline (the one whose narrative location is Dordogne) connected to Dordogne?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Timeline\" . ?e_1 <narrative_location> ?e_3 . ?e_3 <pred:name> \"Dordogne\" . ?e_2 <pred:name> \"Dordogne\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3315",
    "input_seq": "Which has higher elevation above sea level, Erie or Chester (the one whose area is 15.554672 square kilometre)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Erie\" . } UNION { ?e <pred:name> \"Chester\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"15.554672\"^^xsd:double . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3316",
    "input_seq": "What person's CANTIC-ID is a11883145 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11883145\" .  }"
  },
  {
    "qid": "train_3317",
    "input_seq": "Is the population of the Florida county having the Dewey Decimal Classification 2--75922 over 1.5 (the census is this statement's determination method)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Florida\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--75922\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1.5\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv . ?qpv <pred:value> \"census\" .  }"
  },
  {
    "qid": "train_3318",
    "input_seq": "Is the Wikimedia language code of Thai sco?",
    "target_seq": "ASK { ?e <pred:name> \"Thai\" . ?e <Wikimedia_language_code> ?pv . ?pv <pred:value> \"sco\" .  }"
  },
  {
    "qid": "train_3319",
    "input_seq": "Does the US state with a FIPS 5-2 alpha code (US states) of VT have an time of inception later than 1813?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <FIPS_5-2_alpha_code_(US_states)> ?pv_1 . ?pv_1 <pred:value> \"VT\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1813 ) .  }"
  },
  {
    "qid": "train_3321",
    "input_seq": "How was it determined that Los Angeles County has a population of 10170292?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Los Angeles County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10170292\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_3322",
    "input_seq": "What capital's native name is Сарајево?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <native_label> ?pv . ?pv <pred:value> \"Сарајево\" .  }"
  },
  {
    "qid": "train_3323",
    "input_seq": "Hal B. Wallis is related in what way to the role of film producer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hal B. Wallis\" . ?e_2 <pred:name> \"film producer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3324",
    "input_seq": "Who is heavier, Chris Pronger or Ki Sung-yueng?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chris Pronger\" .  } UNION { ?e <pred:name> \"Ki Sung-yueng\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3325",
    "input_seq": "For what work was Zach Galifianakis given a MTV Movie Award for Best Comedic Performance?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Movie Award for Best Comedic Performance\" . ?e_2 <pred:name> \"Zach Galifianakis\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3326",
    "input_seq": "What is the connection between New York City to Oslo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New York City\" . ?e_2 <pred:name> \"Oslo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3327",
    "input_seq": "Regarding the visual artwork that features Merle Haggard in its cast and that was published on 1997-12-25, where did it get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Merle Haggard\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1997-12-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3328",
    "input_seq": "What is the relationship between the Grammy Award for Best New Age Album and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grammy Award for Best New Age Album\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3329",
    "input_seq": "Among the Netherlands municipalities which are a Gelderland administrative division, which one has the largest percent of water area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"municipality of the Netherlands\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Gelderland\" .  ?e <water_as_percent_of_area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3330",
    "input_seq": "What is the connection between Peterborough (the one whose area is 58.4 square kilometre) to Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peterborough\" . ?e_1 <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"58.4\"^^xsd:double . ?e_2 <pred:name> \"Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3331",
    "input_seq": "What is the connection between Charles Sanders Peirce to logic?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Charles Sanders Peirce\" . ?e_2 <pred:name> \"logic\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3332",
    "input_seq": "What is the relationship between Roots (the one that has the record label Roadrunner Records) and groove metal?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roots\" . ?e_1 <record_label> ?e_3 . ?e_3 <pred:name> \"Roadrunner Records\" . ?e_2 <pred:name> \"groove metal\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3333",
    "input_seq": "Was the film Blades of Glory released in Germany in 2008?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Blades of Glory\" . ?e <publication_date> ?pv . ?pv <pred:year> 2008 . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_3334",
    "input_seq": "Since when Northern Territories border Nunavut ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Northwest Territories\" . ?e_2 <pred:name> \"Nunavut\" . ?e_1 <shares_border_with> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3335",
    "input_seq": "Who is the person who attended Stuyvesant High School and has ISNI 0000 0000 8121 8765?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"Stuyvesant High School\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8121 8765\" .  }"
  },
  {
    "qid": "train_3336",
    "input_seq": "What is the relationship between Batman (the one whose distributor is 20th Century Fox) to Nelson Riddle?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Batman\" . ?e_1 <distributor> ?e_3 . ?e_3 <pred:name> \"20th Century Fox\" . ?e_2 <pred:name> \"Nelson Riddle\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3337",
    "input_seq": "Is the running time longer for Chicago, in black-and-white, or Jaws, BAFTA Best Film nominee?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chicago\" . ?e <color> ?e_1 . ?e_1 <pred:name> \"black-and-white\" .   } UNION { ?e <pred:name> \"Jaws\" . ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"BAFTA Award for Best Film\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3338",
    "input_seq": "What language is used in  http://windows.microsoft.com/ru-RU/windows7/products/home, the official website for a software that came after Windows Vista ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <follows> ?e_1 . ?e_1 <pred:name> \"Windows Vista\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://windows.microsoft.com/ru-RU/windows7/products/home\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3340",
    "input_seq": "For the person with the doubles record of 755–440, to which sport does his/her ranking of 24 belong?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <doubles_record> ?pv_1 . ?pv_1 <pred:value> \"755–440\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"24\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <sport> ?qpv .  }"
  },
  {
    "qid": "train_3341",
    "input_seq": "What is the connection between The Vow (the one whose original language is English) to Toronto?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Vow\" . ?e_1 <original_language_of_film_or_TV_show> ?e_3 . ?e_3 <pred:name> \"English\" . ?e_2 <pred:name> \"Toronto\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3342",
    "input_seq": "What play is titled Rent and received a Tony Award for Best Musical?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <title> ?pv . ?pv <pred:value> \"Rent\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Tony Award for Best Musical\" .  }"
  },
  {
    "qid": "train_3343",
    "input_seq": "Does the person who is the presenter of the 73rd Academy Awards, have an ISNI equal to 0000 0000 7704 1944?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <presenter> ?e . ?e_1 <pred:name> \"73rd Academy Awards\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7704 1944\" .  }"
  },
  {
    "qid": "train_3344",
    "input_seq": "Which has fewer people, Marietta or Tampa?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Marietta\" .  } UNION { ?e <pred:name> \"Tampa\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3345",
    "input_seq": "Tell me the one with the larger area, Clinton County (which is located in Ohio) or Stark County.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Clinton County\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Ohio\" .   } UNION { ?e <pred:name> \"Stark County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3346",
    "input_seq": "Tell me the person whose date of birth is in 1923 and genre is country music",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"country music\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> 1923 .  }"
  },
  {
    "qid": "train_3347",
    "input_seq": "Which music genre includes the human whose CANTIC-ID is a11042485?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music genre\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <CANTIC-ID> ?pv . ?pv <pred:value> \"a11042485\" .   }"
  },
  {
    "qid": "train_3348",
    "input_seq": "Which is longer, San Francisco which is designed by Cedric Gibbons or Twilight whose release region is Panama?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"San Francisco\" . ?e <production_designer> ?e_1 . ?e_1 <pred:name> \"Cedric Gibbons\" .   } UNION { ?e <pred:name> \"Twilight\" . ?e <film_release_region> ?e_2 . ?e_2 <pred:name> \"Panama\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3349",
    "input_seq": "Name the birth date which pertains to the renowned saxophonist Tom Scott.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tom Scott\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"saxophone\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3350",
    "input_seq": "Is 314.122-4 the Hornbostel-Sachs classification for the guitar used by John Williams (whose Libris-URI is b8nrv79v00ndvzn)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e_1 <instrument> ?e . ?e_1 <pred:name> \"John Williams\" . ?e_1 <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"b8nrv79v00ndvzn\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"314.122-4\" .  }"
  },
  {
    "qid": "train_3351",
    "input_seq": "How many subscribers does Limp Bizkit, with Twitter username limpbizkit, have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Limp Bizkit\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"limpbizkit\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3352",
    "input_seq": "Does the Eastman School of Music or Juilliard School have more students?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Eastman School of Music\" .  } UNION { ?e <pred:name> \"Juilliard School\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3353",
    "input_seq": "Which one has the smallest area among the counties of Washington whose population is less than 6100000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"6100000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3354",
    "input_seq": "Which movie is titled The Good Shepherd?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"The Good Shepherd\" .  }"
  },
  {
    "qid": "train_3355",
    "input_seq": "Where was the English version of The Crucible published on 1997-02-20?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"The Crucible\" . ?e_1 <language_of_work_or_name> ?e_2 . ?e_2 <pred:name> \"English\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1997-02-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3356",
    "input_seq": "Did someone with ISNI # 0000 0001 1256 9518 remain in space for other than 15,800 total minutes ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1256 9518\" . ?e <time_in_space> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"15800\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3357",
    "input_seq": "Which is shorter, Around the World in 80 Days whose official website is http://disney.go.com/disneyvideos/liveaction/80days/main_flash.html or Beauty and the Beast whose Instagram username is beautyandthebeast?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Around the World in 80 Days\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://disney.go.com/disneyvideos/liveaction/80days/main_flash.html\" . } UNION { ?e <pred:name> \"Beauty and the Beast\" . ?e <Instagram_username> ?pv_2 . ?pv_2 <pred:value> \"beautyandthebeast\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3358",
    "input_seq": "For the film that received an Academy Award for Best Picture (the subject of this statement is 20th Academy Awards), what is its name in kana for its title of 紳士協定?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Picture\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"20th Academy Awards\" . ?e <title> ?pv . ?pv <pred:value> \"紳士協定\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <name_in_kana> ?qpv .  }"
  },
  {
    "qid": "train_3359",
    "input_seq": "Who is the director of All That Jazz who has an ISNI 0000 0001 0870 8837?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"All That Jazz\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0870 8837\" .  }"
  },
  {
    "qid": "train_3360",
    "input_seq": "How many Primetime Emmy Awards have an inception time that is not in 1951?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1951 ) .  }"
  },
  {
    "qid": "train_3361",
    "input_seq": "Is 0000 0001 0261 2519 the ISNI for the person whose father is Richard Harris (who was nominated for a Golden Raspberry Award for Worst Actor)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <father> ?e_1 . ?e_1 <pred:name> \"Richard Harris\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Golden Raspberry Award for Worst Actor\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0261 2519\" .  }"
  },
  {
    "qid": "train_3362",
    "input_seq": "What quantity of researchers are designated by ROME Occupation Code (v3) K2402 or Dewey Decimal code 004.092?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" .  { ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"K2402\" .  } UNION { ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"004.092\" .  } }"
  },
  {
    "qid": "train_3363",
    "input_seq": "Which movie is longer, The Runaways or Taxi (the one whose narrative location is Marseille)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Runaways\" .  } UNION { ?e <pred:name> \"Taxi\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Marseille\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3364",
    "input_seq": "What is the beginning date that Melbourne (whose pronunciation audio is En-au-Melbourne.oga) is the twinned administrative body of Milan (whose postal code is 20142)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Melbourne\" . ?e_1 <pronunciation_audio> ?pv . ?pv <pred:value> \"En-au-Melbourne.oga\" . ?e_2 <pred:name> \"Milan\" . ?e_2 <postal_code> ?pv_1 . ?pv_1 <pred:value> \"20142\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3365",
    "input_seq": "Which FIPS 10-4 (countries and regions) code identifies Saskatchewan, of the official website www.saskatchewan.ca?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Saskatchewan\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.saskatchewan.ca/\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }"
  }
]