[
  {
    "qid": "train_4350",
    "input_seq": "Is the clock time longer for Robin Hood: Prince of Thieves or The Muppets?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Robin Hood: Prince of Thieves\" .  } UNION { ?e <pred:name> \"The Muppets\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4351",
    "input_seq": "What is the connection between Sean Hayes to Tony Award for Best Actor in a Musical?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sean Hayes\" . ?e_2 <pred:name> \"Tony Award for Best Actor in a Musical\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4352",
    "input_seq": "What number of animated film produced by Walt Disney Pictures?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Walt Disney Pictures\" .   }"
  },
  {
    "qid": "train_4353",
    "input_seq": "Which has higher elevation above sea level, Toronto or Kabul (the one whose WOEID is 1922738)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Toronto\" . } UNION { ?e <pred:name> \"Kabul\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1922738\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4354",
    "input_seq": "What is the free software copyleft licence for Java (the one whose official website is https://www.oracle.com/java/)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"free software copyleft license\" . ?e_1 <license> ?e . ?e_1 <pred:name> \"Java\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"https://www.oracle.com/java/\" .  ?e_2 <license> ?e . ?e_2 <pred:name> \"Linux\" .  }"
  },
  {
    "qid": "train_4355",
    "input_seq": "How is Delaware County, population 47980, related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Delaware County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"47980\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4356",
    "input_seq": "What is the number of museum whose architectural style is Georgian architecture ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <architectural_style> ?e_1 . ?e_1 <pred:name> \"Georgian architecture\" .   }"
  },
  {
    "qid": "train_4357",
    "input_seq": "What is the PermID of the university whose street address is 400 S Orange Ave, South Orange, NJ, 07079-2697?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <located_at_street_address> ?pv_1 . ?pv_1 <pred:value> \"400 S Orange Ave, South Orange, NJ, 07079-2697\" . ?e <PermID> ?pv .  }"
  },
  {
    "qid": "train_4358",
    "input_seq": "As of 1893, who was the the defender in the Manchester United F.C.?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <position_played_on_team_/_speciality> ?e_1 . ?e_1 <pred:name> \"defender\" .  ?e <member_of_sports_team> ?e_2 . ?e_2 <pred:name> \"Manchester United F.C.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv . ?qpv <pred:year> 1893 .  }"
  },
  {
    "qid": "train_4359",
    "input_seq": "What person has the Libris-URI mkz26705481v3vx and is a participant in the North African Campaign?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"mkz26705481v3vx\" . ?e_1 <participant> ?e . ?e_1 <pred:name> \"North African Campaign\" .  }"
  },
  {
    "qid": "train_4360",
    "input_seq": "Who was nominated for an Academy Award for Best Writing, Original Screenplay for their work on Breaking Away?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Breaking Away\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Original Screenplay\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_4361",
    "input_seq": "Which language is associated with http://www.gouv.qc.ca/, the official website of the province of Canada whose male demonym is Québécois?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Canada\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Québécois\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv_1 ] <applies_to_part> ?qpv_1 . ?qpv_1 <pred:value> \"male\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.gouv.qc.ca/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4362",
    "input_seq": "Which higher education institution is the education place of the person whose Twitter username is MaryLynnRajskub ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <educated_at> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"MaryLynnRajskub\" .   }"
  },
  {
    "qid": "train_4363",
    "input_seq": "Did the Primetime Emmy Award for Outstanding Writing for a Miniseries, Movie or a Dramatic Special begin outside of 1791?",
    "target_seq": "ASK { ?e <pred:name> \"Primetime Emmy Award for Outstanding Writing for a Miniseries, Movie or a Dramatic Special\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1791 ) .  }"
  },
  {
    "qid": "train_4364",
    "input_seq": "In the American file The Three Musketeeers what role did cast member Orlando Bloom play?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Three Musketeers\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Orlando Bloom\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4365",
    "input_seq": "What is the United States city that contains the public learning institution of the United States whose postal code is 21402-5000?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"public educational institution of the United States\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"21402-5000\" .   }"
  },
  {
    "qid": "train_4366",
    "input_seq": "What start time pertains to Tuvalu, which belongs to the Asian Development Bank and which has a population of 9808?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tuvalu\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9808\"^^xsd:double . ?e_2 <pred:name> \"Asian Development Bank\" . ?e_1 <member_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4367",
    "input_seq": "Which film has the higher box office, The Nutty Professor (whose production company is Imagine Entertainment) or Thunderball (that received the 38th Academy Award)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Nutty Professor\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Imagine Entertainment\" .   } UNION { ?e <pred:name> \"Thunderball\" . ?e <award_received> ?e_2 . ?e_2 <pred:name> \"38th Academy Awards\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4368",
    "input_seq": "When did Frank Tashlin stop working for Columbia Pictures?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Frank Tashlin\" . ?e_2 <pred:name> \"Columbia Pictures\" . ?e_1 <employer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <employer> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4369",
    "input_seq": "What is the Giphy username of Epic Records?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Epic Records\" . ?e <Giphy_username> ?pv .  }"
  },
  {
    "qid": "train_4370",
    "input_seq": "Tell me the award class that uses the Swedish language",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of award\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"Swedish\" .   }"
  },
  {
    "qid": "train_4371",
    "input_seq": "Does the University of Lancaster or the University of Queensland have a larger student body?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Lancaster\" .  } UNION { ?e <pred:name> \"University of Queensland\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4372",
    "input_seq": "Which has more episodes, Planet of the Apes (the one whose number of seasons is 1) or Working Girl (the one that is originally aired on NBC)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Planet of the Apes\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1\"^^xsd:double . } UNION { ?e <pred:name> \"Working Girl\" . ?e <original_network> ?e_1 . ?e_1 <pred:name> \"NBC\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4373",
    "input_seq": "What is the connection between Wonder Woman (the one whose exploitation visa number is 146745) to Chris Pine?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wonder Woman\" . ?e_1 <exploitation_visa_number> ?pv . ?pv <pred:value> \"146745\" . ?e_2 <pred:name> \"Chris Pine\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4374",
    "input_seq": "Was the University of Oxford college with ARCHON code 786 founded on 1841-03-31 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"786\" . ?e <inception> ?pv . ?pv <pred:date> \"1841-03-31\"^^xsd:date .  }"
  },
  {
    "qid": "train_4375",
    "input_seq": "What is the connection between Crash (the one that has Daniel Dae Kim as a cast member) to Bob Yari?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Crash\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Daniel Dae Kim\" . ?e_2 <pred:name> \"Bob Yari\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4376",
    "input_seq": "How many works in writing were published earlier than 1999?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1999 ) .  }"
  },
  {
    "qid": "train_4377",
    "input_seq": "Is the street address of the higher education institution that is the education place of John Ford (who was educated at the University of Tulsa) equal to College Road / Western Road?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"John Ford\" . ?e_1 <educated_at> ?e_2 . ?e_2 <pred:name> \"University of Tulsa\" .  ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"College Road / Western Road\" .  }"
  },
  {
    "qid": "train_4378",
    "input_seq": "What Illinois county's official website is http://www.co.mchenry.il.us and country is the United States of America?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.mchenry.il.us\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_4379",
    "input_seq": "What does Sussex County (whose population is 197145) have to do with the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sussex County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"197145\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4380",
    "input_seq": "Which group of organisms known by one specific common name whose heart rate is not 270 beats per minute has the lowest heart rate?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group of organisms known by one particular common name\" . ?e <heart_rate> ?pv_1 . ?pv_1 <pred:unit> \"beats per minute\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"270\"^^xsd:double ) . ?e <heart_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4381",
    "input_seq": "What is the street address of Brown University's headquarter in Providence (the one that is the capital of Providence County)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brown University\" . ?e_2 <pred:name> \"Providence\" . ?e_3 <capital> ?e_2 . ?e_3 <pred:name> \"Providence County\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <located_at_street_address> ?qpv .  }"
  },
  {
    "qid": "train_4382",
    "input_seq": "What is the Munzinger IBA for Ang Lee?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ang Lee\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_4383",
    "input_seq": "How much software from brave is on https://www.apple.com/in/ios/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.apple.com/in/ios/\" . ?e <snap_package> ?pv_1 . ?pv_1 <pred:value> \"brave\" .  }"
  },
  {
    "qid": "train_4384",
    "input_seq": "Tell me the postal code of the University of Manitoba's headquarters in Winnipeg.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"University of Manitoba\" . ?e_2 <pred:name> \"Winnipeg\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_4385",
    "input_seq": "How is New England connected to Rhode Island?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New England\" . ?e_2 <pred:name> \"Rhode Island\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4386",
    "input_seq": "Among the animes whose start time is outside of 2005, which has the smallest number of episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 2005 ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4387",
    "input_seq": "Which has a greater heart rate, a chicken (with a heart rate of 275 beats per minute) or a goat?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"chicken\" . ?e <heart_rate> ?pv_1 . ?pv_1 <pred:unit> \"beats per minute\" . ?pv_1 <pred:value> \"275\"^^xsd:double . } UNION { ?e <pred:name> \"goat\" . } ?e <heart_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4388",
    "input_seq": "What is the Twitter username of X-Men (the one whose official website is http://www.x-menmovies.com/)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"X-Men\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.x-menmovies.com/\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_4389",
    "input_seq": "Which movie is shorter, Husbands and Wives or U-571?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Husbands and Wives\" .  } UNION { ?e <pred:name> \"U-571\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4390",
    "input_seq": "Which person is a voice actor for Mickey's Magical Christmas: Snowed in at the House of Mouse (the character role of this statement is Daisy Duck)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Mickey's Magical Christmas: Snowed in at the House of Mouse\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Daisy Duck\" .  }"
  },
  {
    "qid": "train_4391",
    "input_seq": "What symptom has the UMLS CUI of C0003123?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0003123\" .  }"
  },
  {
    "qid": "train_4392",
    "input_seq": "How is Josh Weinstein related to the United States?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Josh Weinstein\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4393",
    "input_seq": "Among the island whose population is greater than 520000, which one has the smallest area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"520000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4394",
    "input_seq": "When did William Howard Taft die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"William Howard Taft\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_4395",
    "input_seq": "For the statement that Scent of a Woman got a Golden Globe Best Screenplay prize and a Best Actor Oscar, what is the subject?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Scent of a Woman\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Golden Globe Award for Best Screenplay\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4396",
    "input_seq": "What is the relationship between The Twilight Zone (the one that has Rod Serling as an executive producer) and United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Twilight Zone\" . ?e_1 <executive_producer> ?e_3 . ?e_3 <pred:name> \"Rod Serling\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4397",
    "input_seq": "Which human, in 1994, won the film award that is won by John Gielgud?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film award\" . ?e_1 <winner> ?e_2 . ?e_2 <pred:name> \"John Gielgud\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 1994 .  }"
  },
  {
    "qid": "train_4398",
    "input_seq": "What is the connection between Kid Cudi to alternative hip hop?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kid Cudi\" . ?e_2 <pred:name> \"alternative hip hop\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4399",
    "input_seq": "Among the states of Germany, which have military conflicts with the Kingdom of Great Britain, which has the largest elevation (above sea level)?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e_1 <military_conflicts> ?e . ?e_1 <pred:name> \"Kingdom of Great Britain\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4400",
    "input_seq": "Is the Twitter username of the person with the ISNI of 0000 0001 1442 6609 girls HBO?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1442 6609\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"girlsHBO\" .  }"
  },
  {
    "qid": "train_4401",
    "input_seq": "What is the date of birth of the person with ISNI 0000 0000 6302 4051?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 6302 4051\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4402",
    "input_seq": "What United States city is the capital of the New York county whose FIPS 6-4 for US counties is 36027?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <capital> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"county of New York\" . ?e_1 <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"36027\" .   }"
  },
  {
    "qid": "train_4403",
    "input_seq": "What does S.K. Sturm Graz have to do with the color white?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"S.K. Sturm Graz\" . ?e_2 <pred:name> \"white\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4404",
    "input_seq": "What s th title of the film released after 1914 in the United States of America and directed by Preston Sturges?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1914 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Preston Sturges\" .  }"
  },
  {
    "qid": "train_4405",
    "input_seq": "What entertainment was published on 2009-07-31?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-07-31\"^^xsd:date .  }"
  },
  {
    "qid": "train_4406",
    "input_seq": "Is Blade Runner or We Have a Pope the shorter work?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Blade Runner\" .  } UNION { ?e <pred:name> \"We Have a Pope\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4407",
    "input_seq": "Is the population less for Sarajevo, which is the twinned administrative body of Stockholm, or Jaipur?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sarajevo\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Stockholm\" .   } UNION { ?e <pred:name> \"Jaipur\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4408",
    "input_seq": "How many mathematics either have the field of UMLS CUI of C0681932 or are a part of Philadelphia (the one that uses the language English)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematics\" .  { ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0681932\" .  } UNION { ?e <part_of> ?e_1 . ?e_1 <pred:name> \"Philadelphia\" . ?e_1 <language_of_work_or_name> ?e_2 . ?e_2 <pred:name> \"English\" .  } }"
  },
  {
    "qid": "train_4409",
    "input_seq": "Is the official website of the The Bourne Supremacy equal to http://www.lornemichaels.com/?",
    "target_seq": "ASK { ?e <pred:name> \"The Bourne Supremacy\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.lornemichaels.com/\" .  }"
  },
  {
    "qid": "train_4410",
    "input_seq": "Which one has more weight between Oscar (the one whose height is 185 centimeters) or Johnny Green (the one that is a member of New York Knicks)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Oscar\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"185\"^^xsd:double . } UNION { ?e <pred:name> \"Johnny Green\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"New York Knicks\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4411",
    "input_seq": "How many matches has Alex Manninger played/races/starts as a member of FC Augsburg?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Alex Manninger\" . ?e_2 <pred:name> \"FC Augsburg\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_4412",
    "input_seq": "What person born in Walsall has the postal code of WS1?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Walsall\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"WS1\" .   }"
  },
  {
    "qid": "train_4413",
    "input_seq": "Who has more children, Evan Rachel Wood or Cynthia Watros?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Evan Rachel Wood\" .  } UNION { ?e <pred:name> \"Cynthia Watros\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4414",
    "input_seq": "What is the connection between Mako (the one that died from esophageal cancer) to The Sand Pebbles?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mako\" . ?e_1 <cause_of_death> ?e_3 . ?e_3 <pred:name> \"esophageal cancer\" . ?e_2 <pred:name> \"The Sand Pebbles\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4415",
    "input_seq": "Alex Manninger had how many match appearances as a member of Juventus F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Alex Manninger\" . ?e_2 <pred:name> \"Juventus F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_4416",
    "input_seq": "What is the native language name of the person whose ISNI is 0000 0000 8384 9536?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8384 9536\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_4417",
    "input_seq": "What is the ISNI of Jude Law?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jude Law\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4418",
    "input_seq": "When did a city in Slovenia (since 25th June 1991) stopped using Лайбах as the official name ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Slovenia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <country> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:date> \"1991-06-25\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Лайбах\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4419",
    "input_seq": "Which person's ISNI is 0000 0001 1667 3574 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1667 3574\" .  }"
  },
  {
    "qid": "train_4420",
    "input_seq": "What is the OCLC control number of the written work, The Lorax?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Lorax\" . ?e <OCLC_control_number> ?pv .  }"
  },
  {
    "qid": "train_4421",
    "input_seq": "What is the relationship between James Brown (the one whose date of death is 1992-04-11) and Baylor University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"James Brown\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"1992-04-11\"^^xsd:date . ?e_2 <pred:name> \"Baylor University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4422",
    "input_seq": "What was ParaNorman (nominated for an Academy Award for Best Animated Feature) about?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"ParaNorman\" . ?e_2 <pred:name> \"Academy Award for Best Animated Feature\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4423",
    "input_seq": "Regarding the person born on 1936-08-28 when did he or she die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1936-08-28\"^^xsd:date . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_4424",
    "input_seq": "How many republics have had military conflicts with the Soviet Union?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <military_conflicts> ?e_1 . ?e_1 <pred:name> \"Soviet Union\" .   }"
  },
  {
    "qid": "train_4425",
    "input_seq": "Among African National Congress and Kuomintang which has less member count?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"African National Congress\" .  } UNION { ?e <pred:name> \"Kuomintang\" .  } ?e <member_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4426",
    "input_seq": "what is the publication date of the video game whose Nintendo GameID is RSBP01?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"RSBP01\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_4427",
    "input_seq": "When was the movie from Switzerland assigned exploitation visa number 61155?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Switzerland\" .  ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"61155\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4428",
    "input_seq": "What is the official website of the Grammy Award which originated in 1958?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Grammy Award\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1958 . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4429",
    "input_seq": "Who has Twitter username Bryan_Batt and was born in New Orleans which is the twinned administrative body of Caracas?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Bryan_Batt\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"New Orleans\" . ?e_1 <twinned_administrative_body> ?e_2 . ?e_2 <pred:name> \"Caracas\" .  }"
  },
  {
    "qid": "train_4430",
    "input_seq": "Which movie is longer, Superman II: The Richard Donner Cut or The Country Girl?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Superman II: The Richard Donner Cut\" .  } UNION { ?e <pred:name> \"The Country Girl\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]