[
  {
    "qid": "train_1055",
    "input_seq": "Which one, Star Wars: The Clone Wars (the one that has Simon Pegg as a voice actor) or Robot Chicken, has greater duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Wars: The Clone Wars\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Simon Pegg\" .   } UNION { ?e <pred:name> \"Robot Chicken\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1056",
    "input_seq": "What is the connection between Hamlet (whose release region is in Berlin) and Leipzig?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hamlet\" . ?e_1 <place_of_publication> ?e_3 . ?e_3 <pred:name> \"Berlin\" . ?e_2 <pred:name> \"Leipzig\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1057",
    "input_seq": "How many Wisconsin counties whose population is not 170000000 or that contain the administrative division La Crosse?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Wisconsin\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"170000000\"^^xsd:double ) .  } UNION { ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"La Crosse\" .  } }"
  },
  {
    "qid": "train_1058",
    "input_seq": "What is the number of classes of award whose official website is http://www.bafta.org/ ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of award\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.bafta.org/\" .  }"
  },
  {
    "qid": "train_1059",
    "input_seq": "Which Munzinger IBA corresponds to someone with ISNI # 0000 0001 1475 3714?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1475 3714\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_1060",
    "input_seq": "Is 0000 0001 1437 7210 the ISNI for Jeremy Davies whose profession is actor?",
    "target_seq": "ASK { ?e <pred:name> \"Jeremy Davies\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"actor\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1437 7210\" .  }"
  },
  {
    "qid": "train_1061",
    "input_seq": "Which high school with other than 80000 students has the fewest of them?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"80000\"^^xsd:double ) . ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1062",
    "input_seq": "What is the connection between The Andy Griffith Show to Ron Howard (the one that was nominated for BAFTA Award for Best Film)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Andy Griffith Show\" . ?e_2 <pred:name> \"Ron Howard\" . ?e_2 <nominated_for> ?e_3 . ?e_3 <pred:name> \"BAFTA Award for Best Film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1063",
    "input_seq": "What ceremonial county of England is the birthplace of the person with ISNI 0000 0001 1617 2382?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1617 2382\" .   }"
  },
  {
    "qid": "train_1064",
    "input_seq": "How is El Paso County (population 645439) related to Douglas County (PermID 4296109570)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"El Paso County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"645439\"^^xsd:double . ?e_2 <pred:name> \"Douglas County\" . ?e_2 <PermID> ?pv_1 . ?pv_1 <pred:value> \"4296109570\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1065",
    "input_seq": "The Patrick Doyle born in 1892 died on which date?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Patrick Doyle\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:year> 1892 . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1066",
    "input_seq": "What album of a band, cast in Night at the Museum: Battle of the Smithsonian (the one that has Owen Wilson as a cast member), do we know ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <performer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"band\" . ?e_3 <cast_member> ?e_1 . ?e_3 <pred:name> \"Night at the Museum: Battle of the Smithsonian\" . ?e_3 <cast_member> ?e_4 . ?e_4 <pred:name> \"Owen Wilson\" .   }"
  },
  {
    "qid": "train_1067",
    "input_seq": "Who weighs less, Landon Donovan or Kobe Bryant?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Landon Donovan\" .  } UNION { ?e <pred:name> \"Kobe Bryant\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1068",
    "input_seq": "How is Thomas Hobbes linked to Hertford College?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thomas Hobbes\" . ?e_2 <pred:name> \"Hertford College\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1069",
    "input_seq": "Which New Jersey city whose population is not 3200 has the highest elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"3200\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1070",
    "input_seq": "What is the official website of the movie whose script was written by Clive Owen?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Clive Owen\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1071",
    "input_seq": "At what point in time was the population 9694 for the sovereign state that is the country for sport of Tuvalu national football team?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <country_for_sport> ?e . ?e_1 <pred:name> \"Tuvalu national football team\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9694\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1072",
    "input_seq": "When was the person whose BMLO is l0924 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <BMLO> ?pv_1 . ?pv_1 <pred:value> \"l0924\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1073",
    "input_seq": "Which one, 16 Blocks or Sky Captain and the World of Tomorrow, has less duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"16 Blocks\" .  } UNION { ?e <pred:name> \"Sky Captain and the World of Tomorrow\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1074",
    "input_seq": "Among these two, Seychelles or Eswatini which one has few majority age",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Seychelles\" .  } UNION { ?e <pred:name> \"Eswatini\" .  } ?e <age_of_majority> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1075",
    "input_seq": "What is the connection between The Weather Man to Greece?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Weather Man\" . ?e_2 <pred:name> \"Greece\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1076",
    "input_seq": "Was the film titled London duration shorter than 270 minute?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"London\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v < \"270\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1077",
    "input_seq": "Did a person, whose ISNI is 0000 0000 8096 0714, die on 27th July 2003 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8096 0714\" . ?e <date_of_death> ?pv . ?pv <pred:date> \"2003-07-27\"^^xsd:date .  }"
  },
  {
    "qid": "train_1078",
    "input_seq": "What visual artwork differ from The End of the Affair (the one that was nominated for BAFTA Award for Best Actress in a Leading Role) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <different_from> ?e_1 . ?e_1 <pred:name> \"The End of the Affair\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"BAFTA Award for Best Actress in a Leading Role\" .   }"
  },
  {
    "qid": "train_1079",
    "input_seq": "How many American football teams are headquartered in Houston (capital of Harris County) or use http://www.neworleanssaints.com as the official website ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" .  { ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Houston\" . ?e_1 <capital_of> ?e_2 . ?e_2 <pred:name> \"Harris County\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.neworleanssaints.com\" .  } }"
  },
  {
    "qid": "train_1080",
    "input_seq": "Where was the visual artwork American History X, with a publication date is 1999-02-25, published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"American History X\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-02-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1081",
    "input_seq": "What is the Munzinger IBA of Jack Lemmon?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jack Lemmon\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_1082",
    "input_seq": "How many theater awards were received by the person that has an ISNI of 0000 0001 1507 2371?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <award_received> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1507 2371\" .   }"
  },
  {
    "qid": "train_1083",
    "input_seq": "How many people were either born before 1967 or won the Academy Award for Best Original Song?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" .  { ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1967 ) .  } UNION { ?e_1 <winner> ?e . ?e_1 <pred:name> \"Academy Award for Best Original Song\" .  } }"
  },
  {
    "qid": "train_1084",
    "input_seq": "Who is the spouse of the person with ISNI 0000 0000 7367 0348 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <spouse> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7367 0348\" .   }"
  },
  {
    "qid": "train_1085",
    "input_seq": "In 2005, what activity had the review score of 6/10?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <review_score> ?pv . ?pv <pred:value> \"6/10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <review_score> ; <pred:fact_t> ?pv ] <publication_date> ?qpv . ?qpv <pred:year> 2005 .  }"
  },
  {
    "qid": "train_1086",
    "input_seq": "Where was a movie called My Big Fat Greek Wedding published on 23rd January 2003 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"My Big Fat Greek Wedding\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2003-01-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1087",
    "input_seq": "What is cast member Brad Pitt's character role in Interview with the Vampire (whose genre is film based on literature)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Interview with the Vampire\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"film based on literature\" . ?e_2 <pred:name> \"Brad Pitt\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1088",
    "input_seq": "Which has a shorter duration, Breaking and Entering or Flash Gordon, published 1980-12-05?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Breaking and Entering\" . } UNION { ?e <pred:name> \"Flash Gordon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1980-12-05\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1089",
    "input_seq": "When was the organization whose ISNI is 0000 0001 1312 9741 founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1312 9741\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1090",
    "input_seq": "What is the running time of the movie titled Harry Potter and the Philosopher's Stone?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Harry Potter and the Philosopher's Stone\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1091",
    "input_seq": "The demonym Prince-Édouardien applies to which part of Prince Edward Island?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Prince Edward Island\" . ?e <demonym> ?pv . ?pv <pred:value> \"Prince-Édouardien\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_1092",
    "input_seq": "How many sounds have the subreddit drone or a creation date other than 1943?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1943 ) .  } UNION { ?e <subreddit> ?pv . ?pv <pred:value> \"drone\" .  } }"
  },
  {
    "qid": "train_1093",
    "input_seq": "How is Corey Burton related to voice actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Corey Burton\" . ?e_2 <pred:name> \"voice actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1094",
    "input_seq": "Does Morgan Creek Productions have an official website equal to http://www.basil-poledouris.com ?",
    "target_seq": "ASK { ?e <pred:name> \"Morgan Creek Productions\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.basil-poledouris.com\" .  }"
  },
  {
    "qid": "train_1095",
    "input_seq": "How many democracies are followed by South Korea and are the lowest point of the Atlantic Ocean?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <followed_by> ?e_1 . ?e_1 <pred:name> \"South Korea\" .  ?e <lowest_point> ?e_2 . ?e_2 <pred:name> \"Atlantic Ocean\" .  }"
  },
  {
    "qid": "train_1096",
    "input_seq": "How many subscribers does Jackie Chan's Twitter, EyeOfJackieChan, have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Jackie Chan\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"EyeOfJackieChan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1097",
    "input_seq": "What is the official website of Camden County?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Camden County\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1098",
    "input_seq": "What visual artwork is titled Everyone Says I Love You?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Everyone Says I Love You\" .  }"
  },
  {
    "qid": "train_1099",
    "input_seq": "What person has the date of birth 1956-04-03?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1956-04-30\"^^xsd:date .  }"
  },
  {
    "qid": "train_1100",
    "input_seq": "Who was the director of.photography of a movie that received  Academy Award for Best Actor (the winner of this statement is John Wayne)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director_of_photography> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Actor\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_3 ] <winner> ?qpv . ?qpv <pred:value> \"John Wayne\" .   }"
  },
  {
    "qid": "train_1101",
    "input_seq": "Which is larger in terms of area: Hidalgo County, or Dallas County (population 2,513,054)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hidalgo County\" . } UNION { ?e <pred:name> \"Dallas County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2513054\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1103",
    "input_seq": "What Illinois county has the captital of Springfield (the one whose inception time is 1821-04-10) and has the capital of Springfield (the one whose inception time is 1821-04-10)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Springfield\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1821-04-10\"^^xsd:date .  ?e_2 <capital_of> ?e . ?e_2 <pred:name> \"Springfield\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-04-10\"^^xsd:date .  }"
  },
  {
    "qid": "train_1104",
    "input_seq": "When The Contender, published on 2002-06-27, was up for an Academy Award for Best Actress, who was the nominated performer?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Contender\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2002-06-27\"^^xsd:date . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1105",
    "input_seq": "Where was the visual artwork directed by Buck Henry published on 1978-10-26?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Buck Henry\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1978-10-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1106",
    "input_seq": "Is he official website of Academy Awards ceremony, that took place on 24th February 2008, http://www.oscars.org/80academyawards ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <point_in_time> ?pv_1 . ?pv_1 <pred:date> \"2008-02-24\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.oscars.org/80academyawards/\" .  }"
  },
  {
    "qid": "train_1107",
    "input_seq": "What is the official website of the American football team headquartered in Baltimore?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Baltimore\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1108",
    "input_seq": "Is In & Out or Thirteen Days longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"In & Out\" .  } UNION { ?e <pred:name> \"Thirteen Days\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1109",
    "input_seq": "When did a metropolitan borough, different from Sheffield (the twin town of Bochum) reach the population of 569,700 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e_1 <different_from> ?e . ?e_1 <pred:name> \"Sheffield\" . ?e_1 <twinned_administrative_body> ?e_2 . ?e_2 <pred:name> \"Bochum\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"569700\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1110",
    "input_seq": "Is the date of birth for the person with an ISNI equal to 0000 0000 0146 3737 after 1925?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 0146 3737\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1925 ) .  }"
  },
  {
    "qid": "train_1111",
    "input_seq": "How is keyboard instrument related to Bo Diddley?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"keyboard instrument\" . ?e_2 <pred:name> \"Bo Diddley\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1112",
    "input_seq": "Regarding Ice Cube when is the work period (start) for him or her?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ice Cube\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_1113",
    "input_seq": "How is Saw which was nominated for a MTV Movie Award for Best Scared-As-S**t Performance related to Italy?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saw\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"MTV Movie Award for Best Scared-As-S**t Performance\" . ?e_2 <pred:name> \"Italy\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1114",
    "input_seq": "Among the chemical compounds colored white, which has the smallest melting point?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <color> ?e_1 . ?e_1 <pred:name> \"white\" .  ?e <melting_point> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1115",
    "input_seq": "How many people subscribe to the activity that is a subsidiary of Warner Bros. and has a Twitter username of DCComics?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e_1 <subsidiary> ?e . ?e_1 <pred:name> \"Warner Bros.\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"DCComics\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1116",
    "input_seq": "What is the postal code of Midland (the one whose official website is http://www.midland-mi.org/)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Midland\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.midland-mi.org/\" . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_1117",
    "input_seq": "Is the Amazon author page of the producer of Selma, which casted Oprah Winfrey,  B000APVLWQ ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <producer> ?e . ?e_1 <pred:name> \"Selma\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Oprah Winfrey\" .  ?e <Amazon_author_page> ?pv . ?pv <pred:value> \"B000APVLWQ\" .  }"
  },
  {
    "qid": "train_1118",
    "input_seq": "How is Franlin County of North Carolina related to North Carolina?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Franklin County\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_3 . ?e_3 <pred:name> \"North Carolina\" . ?e_2 <pred:name> \"North Carolina\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1119",
    "input_seq": "What end time applies to the partnership of Sam Shepard and Jessica Lange?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jessica Lange\" . ?e_2 <pred:name> \"Sam Shepard\" . ?e_1 <partner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <partner> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_1120",
    "input_seq": "How many American football teams are in the country of United States of America and have the official website http://gofrogs.cstv.com/sports/m-footbl/tcu-m-footbl-body.html?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://gofrogs.cstv.com/sports/m-footbl/tcu-m-footbl-body.html\" .  }"
  },
  {
    "qid": "train_1121",
    "input_seq": "Which movie is longer, Sun (the one whose publication date is 1929-01-01) or 2012?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sun\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1929-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"2012\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1122",
    "input_seq": "How is Split, officially named Split, related to Dover, of the Twitter handle VisitDover?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Split\" . ?e_1 <official_name> ?pv . ?pv <pred:value> \"Split\" . ?e_2 <pred:name> \"Dover\" . ?e_2 <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"VisitDover\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1123",
    "input_seq": "Who is shorter, Michael O'Neill (the one whose height is 180 centimetre) or Jack Kemp?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Michael O'Neill\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"180\"^^xsd:double . } UNION { ?e <pred:name> \"Jack Kemp\" . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1124",
    "input_seq": "What language is associated with the subreddit Android for the operating system that is the platform of Star Trek: The Next Generation that is released for Xbox 360?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"operating system\" . ?e_1 <platform> ?e . ?e_1 <pred:name> \"Star Trek: The Next Generation\" . ?e_1 <platform> ?e_2 . ?e_2 <pred:name> \"Xbox 360\" .  ?e <subreddit> ?pv . ?pv <pred:value> \"Android\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1125",
    "input_seq": "How many Texas counties have a population that is under 370000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"370000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1126",
    "input_seq": "What association football club has the Twitter username anorthosisfc?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"anorthosisfc\" . ?e <sport> ?e_1 . ?e_1 <pred:name> \"association football\" .  }"
  },
  {
    "qid": "train_1127",
    "input_seq": "What language is associated with the creative work at http://www.cityofmuncie.com/, the official website for Muncie?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Muncie\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofmuncie.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1128",
    "input_seq": "Which has more people, Joplin or San Bernardino?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Joplin\" .  } UNION { ?e <pred:name> \"San Bernardino\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1129",
    "input_seq": "Which city has less land area, Jalandhar or Charlottetown?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jalandhar\" .  } UNION { ?e <pred:name> \"Charlottetown\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1130",
    "input_seq": "Which was the 35th edition of the Academy Awards event?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <edition_number> ?pv . ?pv <pred:value> \"35\" .  }"
  },
  {
    "qid": "train_1131",
    "input_seq": "What is the connection between A Very Long Engagement to Jodie Foster?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Very Long Engagement\" . ?e_2 <pred:name> \"Jodie Foster\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1132",
    "input_seq": "In what country was Tyrone Power (the one that has the occupation of military officer) when he died in Madrid?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tyrone Power\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"military officer\" . ?e_2 <pred:name> \"Madrid\" . ?e_1 <place_of_death> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_death> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_1133",
    "input_seq": "What is the connection between Gary Summers to Gary (the one that is the given name of Gary Lucchesi)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gary Summers\" . ?e_2 <pred:name> \"Gary\" . ?e_3 <given_name> ?e_2 . ?e_3 <pred:name> \"Gary Lucchesi\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1134",
    "input_seq": "Was the person with ISNI 0000 0000 8093 249X born on 1973-09-26?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8093 249X\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1973-09-26\"^^xsd:date .  }"
  },
  {
    "qid": "train_1135",
    "input_seq": "What number of French regions have a population smaller than 8900?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"8900\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1136",
    "input_seq": "Which university is in the city with the native label Aberdeen?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city\" . ?e_1 <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aberdeen\" .   }"
  },
  {
    "qid": "train_1137",
    "input_seq": "What is the connection between The Heiress to Academy Award for Best Cinematography?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Heiress\" . ?e_2 <pred:name> \"Academy Award for Best Cinematography\" . ?e_1 ?p ?e_2 .  }"
  }
]