[
  {
    "qid": "train_1883",
    "input_seq": "Who earned an Academy Award Best Director nomination for the literature-based film Love Story ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Love Story\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"film based on literature\" . ?e_2 <pred:name> \"Academy Award for Best Director\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_1884",
    "input_seq": "What is the official opening date of the award whose official website is http://www.profootballhof.com (the language of this statement is English)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.profootballhof.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <date_of_official_opening> ?pv .  }"
  },
  {
    "qid": "train_1885",
    "input_seq": "Is the date of birth of the human whose Libris-URI is qn245xx81xspc2r before 1972?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"qn245xx81xspc2r\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1972 ) .  }"
  },
  {
    "qid": "train_1886",
    "input_seq": "Who has less mass, Ben Foster who was born in Royal Leamington Spa, or Mark Johnson, who is related to ice hockey?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ben Foster\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Royal Leamington Spa\" .   } UNION { ?e <pred:name> \"Mark Johnson\" . ?e <sport> ?e_2 . ?e_2 <pred:name> \"ice hockey\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1887",
    "input_seq": "What has Paul Dini to do with Paul Feig?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paul Dini\" . ?e_2 <pred:name> \"Paul\" . ?e_3 <given_name> ?e_2 . ?e_3 <pred:name> \"Paul Feig\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1888",
    "input_seq": "Did someone with CANTIC-ID a11988046 die later than 1944 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11988046\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1944 ) .  }"
  },
  {
    "qid": "train_1889",
    "input_seq": "Which Ohio county is designated by FIPS 6-4 (US counties) code 39081?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ohio\" . ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"39081\" .  }"
  },
  {
    "qid": "train_1890",
    "input_seq": "Who is a person who won Independent Spirit Award for Best Male Lead, for playing in the movie Pulp Fiction?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pulp Fiction\" . ?e_2 <pred:name> \"Independent Spirit Award for Best Male Lead\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <winner> ?qpv .  }"
  },
  {
    "qid": "train_1891",
    "input_seq": "When was the single with lyrics by Lady Gaga published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <lyrics_by> ?e_1 . ?e_1 <pred:name> \"Lady Gaga\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_1892",
    "input_seq": "What is Robert Byrd's link to American University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Robert Byrd\" . ?e_2 <pred:name> \"American University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1893",
    "input_seq": "What is the connection between The Rules of Attraction to Ireland (the one whose population is 4398942)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Rules of Attraction\" . ?e_2 <pred:name> \"Ireland\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4398942\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1894",
    "input_seq": "How many theatrical genres whose number of seasons is less than 55?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"55\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1895",
    "input_seq": "Who is taller, Nana Patekar or Ryan Reynolds?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nana Patekar\" .  } UNION { ?e <pred:name> \"Ryan Reynolds\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1896",
    "input_seq": "Is the ISNI of the rock band that sets up in Canada 0000 0001 1512 2084 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Canada\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1512 2084\" .  }"
  },
  {
    "qid": "train_1897",
    "input_seq": "Which national soccer team was ranked at 164 in 2009?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"164\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2009 .  }"
  },
  {
    "qid": "train_1898",
    "input_seq": "Which movie is shorter, Shakespeare in Love or The Messenger: The Story of Joan of Arc?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Shakespeare in Love\" .  } UNION { ?e <pred:name> \"The Messenger: The Story of Joan of Arc\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1899",
    "input_seq": "How many children does the person whose ISNI is 0000 0001 1478 5927 have?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1478 5927\" . ?e <number_of_children> ?pv .  }"
  },
  {
    "qid": "train_1900",
    "input_seq": "How long is the movie, Bleach: The DiamondDust Rebellion?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bleach: The DiamondDust Rebellion\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1901",
    "input_seq": "How many collages and universities inside the U.S, whose Twitter username is NC State and that founds Association of American Universities.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"colleges and universities in the United States\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"NCState\" . ?e <found> ?e_1 . ?e_1 <pred:name> \"Association of American Universities\" .  }"
  },
  {
    "qid": "train_1902",
    "input_seq": "Does the organization that's the producer of The CW have an operating income exceeding 26700000000000 in South Korean won ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <product_or_material_produced> ?e_1 . ?e_1 <pred:name> \"The CW\" .  ?e <operating_income> ?pv . ?pv <pred:unit> \"South Korean won\" . ?pv <pred:value> ?v . FILTER ( ?v > \"26700000000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1904",
    "input_seq": "Which movie is shorter, Chronicle or Silkwood?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chronicle\" .  } UNION { ?e <pred:name> \"Silkwood\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1905",
    "input_seq": "When was the official name of Chennai Мадрас until?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Chennai\" . ?e <official_name> ?pv . ?pv <pred:value> \"Мадрас\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_1906",
    "input_seq": "How is Vinod Khanna related to people of Indian descent?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vinod Khanna\" . ?e_2 <pred:name> \"Indian people\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1907",
    "input_seq": "Where exactly is  Mississippi (the one whose population is 2009821) located, relative to Mississipp River, if we know it is in or next to it?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mississippi\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2009821\"^^xsd:double . ?e_2 <pred:name> \"Mississippi River\" . ?e_1 <located_in_or_next_to_body_of_water> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_or_next_to_body_of_water> ; <pred:fact_t> ?e_2 ] <direction_relative_to_location> ?qpv .  }"
  },
  {
    "qid": "train_1908",
    "input_seq": "What is the ISNI of a person whose official website is http://www.richardchamberlain.net?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.richardchamberlain.net\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1909",
    "input_seq": "Is the ISNI of the African, Caribbean and Pacific Group of States 0000 0004 4902 0432?",
    "target_seq": "ASK { ?e <pred:name> \"African, Caribbean and Pacific Group of States\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 4902 0432\" .  }"
  },
  {
    "qid": "train_1910",
    "input_seq": "Does the town with the OS grid reference of TQ335925 have a TOID of 4000000074343646 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ335925\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074343646\" .  }"
  },
  {
    "qid": "train_1911",
    "input_seq": "What is the character role of Woody Harrelson in The Hunger Games?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Hunger Games\" . ?e_2 <pred:name> \"Woody Harrelson\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1912",
    "input_seq": "Where did Lucky Numbers which was published on 2001-05-17 get published",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lucky Numbers\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-05-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1913",
    "input_seq": "When did Matthew McConaughey earn an MTV Movie Award for Best Breakthrough Performance?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Movie Award for Best Breakthrough Performance\" . ?e_2 <pred:name> \"Matthew McConaughey\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1914",
    "input_seq": "How is Lyndon B. Johnson related to President of the United States?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lyndon B. Johnson\" . ?e_2 <pred:name> \"President of the United States\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1915",
    "input_seq": "What liberal arts college is located in the country that has the same form of government as the country where the Airports Authority of India is located?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"liberal arts college\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"form of government\" . ?e_3 <country> ?e_1 . ?e_3 <pred:name> \"Airports Authority of India\" .   }"
  },
  {
    "qid": "train_1916",
    "input_seq": "How many genres are present at the website http://harvardlampoon.com/ with Iconclass notation 49M321",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://harvardlampoon.com/\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"49M321\" .  }"
  },
  {
    "qid": "train_1917",
    "input_seq": "Senna was published in which location on 2011-05-12?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Senna\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-05-12\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1918",
    "input_seq": "When was Edward Carfagno born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Edward Carfagno\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1919",
    "input_seq": "CANTIC-ID a10443824 identifies which person?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10443824\" .  }"
  },
  {
    "qid": "train_1920",
    "input_seq": "What is the relation between Buffy the Vampire Slayer (the one released in 1997) with Alyson Hannigan?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Buffy the Vampire Slayer\" . ?e_1 <publication_date> ?pv . ?pv <pred:year> 1997 . ?e_2 <pred:name> \"Alyson Hannigan\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1921",
    "input_seq": "What is the relationship between Meridian (the one whose postal code is 39301–39307) and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Meridian\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"39301–39307\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1922",
    "input_seq": "How was the population figure of 106153 ascertained for the city whose WOEID is 1103368?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1103368\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"106153\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1923",
    "input_seq": "What language is associated with the official website http://www.subr.edu for the land-grant university having the ISNI 0000 0004 0386 0655?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0386 0655\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.subr.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1924",
    "input_seq": "What is the connection between Love Actually to Chiwetel Ejiofor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Love Actually\" . ?e_2 <pred:name> \"Chiwetel Ejiofor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1925",
    "input_seq": "What is the beginning date that Calvados is situated in Normandy (that replaces Upper Normandy)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Calvados\" . ?e_2 <pred:name> \"Normandy\" . ?e_2 <replaces> ?e_3 . ?e_3 <pred:name> \"Upper Normandy\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1926",
    "input_seq": "What is the time point of the state of the United States whose demonym is Oregonian which population is 1768687?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Oregonian\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1768687\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1927",
    "input_seq": "When did the Florida county that contains St. Petersburg have a population of 949827?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Florida\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"St. Petersburg\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"949827\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1928",
    "input_seq": "How many ethnic communities are in a sovereign state whose ITU letter code is USA ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic community\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <ITU_letter_code> ?pv . ?pv <pred:value> \"USA\" .   }"
  },
  {
    "qid": "train_1929",
    "input_seq": "Which is the shortest among the feature films that mainly depict time travel?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"time travel\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1930",
    "input_seq": "What is the connection between Lincoln University to Chester County?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lincoln University\" . ?e_2 <pred:name> \"Chester County\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1931",
    "input_seq": "Which performed worse at the box office: Waterworld, composed by James Newton Howard, or The Dark Knight, an Academy Award nominee for Best Supporting Actor?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Waterworld\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"James Newton Howard\" .   } UNION { ?e <pred:name> \"The Dark Knight\" . ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1932",
    "input_seq": "Which is longer, Restless produced by Sony Pictures Classics or Groundhog Day?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Restless\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Sony Pictures Classics\" .   } UNION { ?e <pred:name> \"Groundhog Day\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1933",
    "input_seq": "How is Pat Garrett and Billy the Kid related to Bruce Dern?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pat Garrett and Billy the Kid\" . ?e_2 <pred:name> \"Bruce Dern\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1934",
    "input_seq": "What film was published in 1982 and has Eileen Atkins as a cast member?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv . ?pv <pred:year> 1982 . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Eileen Atkins\" .  }"
  },
  {
    "qid": "train_1935",
    "input_seq": "Roots, with Forest Whitaker as a cast member, is related in what way to Jonathan Rhys Meyers?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roots\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Forest Whitaker\" . ?e_2 <pred:name> \"Jonathan Rhys Meyers\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1936",
    "input_seq": "How many Protestantisms' countries are the sovereign state whose nominal GDP is equal to 4043901818.18182 U.S. dollars (the point in time of this statement is 1965-01-01)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"4043901818.18182\"^^xsd:double . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"1965-01-01\"^^xsd:date .   }"
  },
  {
    "qid": "train_1937",
    "input_seq": "What is the eMedicine for the disease that has Crohn's disease as one risk factor?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e_1 <risk_factor> ?e . ?e_1 <pred:name> \"Crohn's disease\" .  ?e <eMedicine> ?pv .  }"
  },
  {
    "qid": "train_1938",
    "input_seq": "What is the connection between Madurai to India (the one that is the origin country of Enthiran)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Madurai\" . ?e_2 <pred:name> \"India\" . ?e_3 <country_of_origin> ?e_2 . ?e_3 <pred:name> \"Enthiran\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1939",
    "input_seq": "What is the height of Chris Martin whose occupation is songwriter?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Martin\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"songwriter\" .  ?e <height> ?pv .  }"
  },
  {
    "qid": "train_1940",
    "input_seq": "What is the box office of the movie produced by Denzel Washington?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Denzel Washington\" .  ?e <box_office> ?pv .  }"
  },
  {
    "qid": "train_1941",
    "input_seq": "The kind of sport designated by OSM Tag:sport=soccer is the subject of which TV movie?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <main_subject> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"type of sport\" . ?e_1 <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:sport=soccer\" .   }"
  },
  {
    "qid": "train_1942",
    "input_seq": "How many video game developers have an inception time after 1983 or belong to the industry of video game industry?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1983 ) .  } UNION { ?e <industry> ?e_1 . ?e_1 <pred:name> \"video game industry\" .  } }"
  },
  {
    "qid": "train_1943",
    "input_seq": "Is the official website of the association football club that has a subscription number of 3803 under the Twitter username VaduzFC equal to http://www.fcvaduz.li/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"VaduzFC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"3803\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.fcvaduz.li/\" .  }"
  },
  {
    "qid": "train_1944",
    "input_seq": "What is the date of birth of a person that was given Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role in 1996 ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1996 . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1945",
    "input_seq": "The Washington County that borders Loudoun County is represented in which language at its official website, www.washco-md.net?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Washington County\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Loudoun County\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.washco-md.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1946",
    "input_seq": "How is American Zoetrope designated by ISNI?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"American Zoetrope\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1947",
    "input_seq": "Mrs. Parker and the Vicious Circle has what connection to Martha Plimpton?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mrs. Parker and the Vicious Circle\" . ?e_2 <pred:name> \"Martha Plimpton\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1948",
    "input_seq": "When was Upstairs, Downstairs nominated for a Primetime Emmy for Outstanding Supporting Actress in a Drama Series?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Upstairs, Downstairs\" . ?e_2 <pred:name> \"Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1949",
    "input_seq": "Which has more students, the Royal Academy of Music or Glasgow School of Art?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Royal Academy of Music\" .  } UNION { ?e <pred:name> \"Glasgow School of Art\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1950",
    "input_seq": "The pope is officially represented by which website?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"pope\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1951",
    "input_seq": "How many fictional professionals are a relative of Michelangelo (who has the occupation of ninja)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fictional profession\" . ?e_1 <relative> ?e . ?e_1 <pred:name> \"Michelangelo\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"ninja\" .   }"
  },
  {
    "qid": "train_1952",
    "input_seq": "What is the official website for FC Chornomorets Odesa?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"FC Chornomorets Odesa\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1953",
    "input_seq": "The person with ISNI number 0000 0001 1452 4057 claims how many followers for their Twitter account name, SunielVShetty?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1452 4057\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SunielVShetty\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1954",
    "input_seq": "Is Unstoppable the title of P.S. I Love You (the one whose ISWC is T-010.163.293-2)?",
    "target_seq": "ASK { ?e <pred:name> \"P.S. I Love You\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-010.163.293-2\" . ?e <title> ?pv . ?pv <pred:value> \"Unstoppable\" .  }"
  },
  {
    "qid": "train_1955",
    "input_seq": "What is the postal code of Utah State University's headquarter location is Logan (the one whose inception time is 1859)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Utah State University\" . ?e_2 <pred:name> \"Logan\" . ?e_2 <inception> ?pv . ?pv <pred:year> 1859 . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_1956",
    "input_seq": "Who has a lesser number of children, Brandy Norwood or Christina Ricci?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brandy Norwood\" .  } UNION { ?e <pred:name> \"Christina Ricci\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1957",
    "input_seq": "What number of business school's official website is http://mitsloan.mit.edu?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business school\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://mitsloan.mit.edu\" .  }"
  },
  {
    "qid": "train_1958",
    "input_seq": "What is the relation correlation of Great Expectations whose start date is 1999-04-12 with Ioan Gruffudd?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Great Expectations\" . ?e_1 <start_time> ?pv . ?pv <pred:date> \"1999-04-12\"^^xsd:date . ?e_2 <pred:name> \"Ioan Gruffudd\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1959",
    "input_seq": "What is the inception time of the movement in the art world that started prior to 1857?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 < 1857 ) . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1960",
    "input_seq": "Which person has the CANTIC-ID a10438944?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10438944\" .  }"
  },
  {
    "qid": "train_1961",
    "input_seq": "Was the person whose ISNI is 0000 0000 6573 3644 born before 1957?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 6573 3644\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1957 ) .  }"
  },
  {
    "qid": "train_1962",
    "input_seq": "When was Axl Rose born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Axl Rose\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1963",
    "input_seq": "Is Salem the title of the movie that won at the 2000 Cannes Film Festival for Best Actress ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Cannes Film Festival Award for Best Actress\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2000 . ?e <title> ?pv . ?pv <pred:value> \"Salem\" .  }"
  },
  {
    "qid": "train_1964",
    "input_seq": "What is the connection between Shakespeare in Love to John Madden (the one that is educated at University of Cambridge)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shakespeare in Love\" . ?e_2 <pred:name> \"John Madden\" . ?e_2 <educated_at> ?e_3 . ?e_3 <pred:name> \"University of Cambridge\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1965",
    "input_seq": "Which placer is larger in size, Madison County (the one that is an administrative division of North Carolina) or Franklin County (the one whose population is 63710)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Madison County\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"North Carolina\" . } UNION { ?e <pred:name> \"Franklin County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"63710\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]