[
  {
    "qid": "train_3700",
    "input_seq": "Which movie has a larger GDP (PPP), Mozambique or Sudan?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mozambique\" .  } UNION { ?e <pred:name> \"Sudan\" .  } ?e <GDP_(PPP)> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3701",
    "input_seq": "Which has less GDP (PPP), Saudi Arabia or Uruguay?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Saudi Arabia\" .  } UNION { ?e <pred:name> \"Uruguay\" .  } ?e <GDP_(PPP)> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3702",
    "input_seq": "Out of the People's Republic of China or Mongolia, which has a smaller GDP per capita?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"People's Republic of China\" .  } UNION { ?e <pred:name> \"Mongolia\" .  } ?e <nominal_GDP_per_capita> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3703",
    "input_seq": "How is Kevin Corrigan related to the Lee Strasberg Theatre and Film Institute?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kevin Corrigan\" . ?e_2 <pred:name> \"Lee Strasberg Theatre and Film Institute\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3704",
    "input_seq": "Is The Contender (the one that has Saul Rubinek as a cast member) longer than 30 minutes?",
    "target_seq": "ASK { ?e <pred:name> \"The Contender\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Saul Rubinek\" .  ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v > \"30\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3705",
    "input_seq": "Which award  was received by the person whose Twitter username is chriscerf ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e_1 <award_received> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"chriscerf\" .   }"
  },
  {
    "qid": "train_3706",
    "input_seq": "When did the band form that's ISNI is 0000 0001 1526 5624 ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1526 5624\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3707",
    "input_seq": "Which movie is shorter, Tinker Tailor Soldier Spy (the one that was nominated for BAFTA Award for Best Adapted Screenplay) or The Impossible?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tinker Tailor Soldier Spy\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Adapted Screenplay\" .   } UNION { ?e <pred:name> \"The Impossible\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3708",
    "input_seq": "What was the nominee of The Insider that was nominated for the Academy Award for Best Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Insider\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_3709",
    "input_seq": "What is the ISNI for Ricky Nelson?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ricky Nelson\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3710",
    "input_seq": "Which movie is shorter, Godzilla (the one whose production company is Tōhō) or Natural Born Killers?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Godzilla\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Tōhō\" .   } UNION { ?e <pred:name> \"Natural Born Killers\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3711",
    "input_seq": "Is a10919934 the CANTIC-ID of the person who has notable work in The Tourist?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <notable_work> ?e_1 . ?e_1 <pred:name> \"The Tourist\" .  ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10919934\" .  }"
  },
  {
    "qid": "train_3712",
    "input_seq": "When was U2 inducted in the Rock and Roll Hall of Fame?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"U2\" . ?e_2 <pred:name> \"Rock and Roll Hall of Fame\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3713",
    "input_seq": "I need to know the duration of Rocky V.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rocky V\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_3714",
    "input_seq": "Tell me the relationship between Searching for Debra Winter and Frances McDormand.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Searching for Debra Winger\" . ?e_2 <pred:name> \"Frances McDormand\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3715",
    "input_seq": "When is the publication date for the visual art work Jack London?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Jack London\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_3716",
    "input_seq": "What language is associated with the creative work at http://www.scottcountyiowa.com, the official website of Scott County which has population of 165224?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Scott County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"165224\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.scottcountyiowa.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3717",
    "input_seq": "In which language is Ridgefield's official website at www.ridgefieldct.org?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ridgefield\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ridgefieldct.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3718",
    "input_seq": "Is the height of a person, whose weight is 248 pounds, more than 1.6 meters ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <mass> ?pv_1 . ?pv_1 <pred:unit> \"pound\" . ?pv_1 <pred:value> \"248\"^^xsd:double . ?e <height> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3719",
    "input_seq": "Between Rivers Cuomo or Cheech Marin, who has more kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rivers Cuomo\" .  } UNION { ?e <pred:name> \"Cheech Marin\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3720",
    "input_seq": "For the person with ISNI is 0000 0001 1586 3149  what is their Munzinger IBA?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1586 3149\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_3721",
    "input_seq": "What is the relationship between The Girl with the Dragon Tattoo (the one whose publication date is 2012-01-12) and Donald Sumpter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Girl with the Dragon Tattoo\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2012-01-12\"^^xsd:date . ?e_2 <pred:name> \"Donald Sumpter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3722",
    "input_seq": "Which Twitter handle belongs to the basketball team headquartered in Oklahoma City?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Oklahoma City\" .  ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_3723",
    "input_seq": "How is Seattle native Jerry Lewis related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jerry Lewis\" . ?e_1 <place_of_birth> ?e_3 . ?e_3 <pred:name> \"Seattle\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3724",
    "input_seq": "Was dance-pop created in a year other than 1961 ?",
    "target_seq": "ASK { ?e <pred:name> \"dance-pop\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1961 ) .  }"
  },
  {
    "qid": "train_3725",
    "input_seq": "What amount of video game consoles had unit sales below 65000000 and a username on Twitter of PlayStation_jp?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"PlayStation_jp\" . ?e <units_sold> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"65000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3726",
    "input_seq": "How is Republican Party member Colin Powell related to the Order of the Star of Romania?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Colin Powell\" . ?e_1 <member_of_political_party> ?e_3 . ?e_3 <pred:name> \"Republican Party\" . ?e_2 <pred:name> \"Order of the Star of Romania\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3727",
    "input_seq": "Which company has fewer employees, HAL Laboratory or FromSoftware?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"HAL Laboratory\" .  } UNION { ?e <pred:name> \"FromSoftware\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3728",
    "input_seq": "Which movie is shorter, The Great Gatsby (featuring Carey Mulligan) or The Fugitive (published 1947-01-01)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Great Gatsby\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Carey Mulligan\" . } UNION { ?e <pred:name> \"The Fugitive\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1947-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3729",
    "input_seq": "I want to know the relationship between Ted Kennedy (who participated in 103rd United States Congress) to politician.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ted Kennedy\" . ?e_3 <participant> ?e_1 . ?e_3 <pred:name> \"103rd United States Congress\" . ?e_2 <pred:name> \"politician\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3730",
    "input_seq": "What is the ISNI for the person who is a voice actor for The Three Musketeers, which started 1987-10-09?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"The Three Musketeers\" . ?e_1 <start_time> ?pv_1 . ?pv_1 <pred:date> \"1987-10-09\"^^xsd:date . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3731",
    "input_seq": "What is the official website of a band whose subreddit is Genesis?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Genesis\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3732",
    "input_seq": "How does Bobby Deol relate to Bobby (the one whose native label is Bobby)    ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bobby Deol\" . ?e_2 <pred:name> \"Bobby\" . ?e_2 <native_label> ?pv . ?pv <pred:value> \"Bobby\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3733",
    "input_seq": "What is the pseudonym for the person whose ISNI is 0000 0001 1859 4933?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1859 4933\" . ?e <pseudonym> ?pv .  }"
  },
  {
    "qid": "train_3734",
    "input_seq": "Does Coimbatore or Jeddah have less population?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Coimbatore\" .  } UNION { ?e <pred:name> \"Jeddah\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3735",
    "input_seq": "Is Penelope Wilton's ISNI 0000 0003 5388 2812?",
    "target_seq": "ASK { ?e <pred:name> \"Penelope Wilton\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 5388 2812\" .  }"
  },
  {
    "qid": "train_3736",
    "input_seq": "Does Star Trek: The Animated Series or Top Chef have the less number of episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Trek: The Animated Series\" .  } UNION { ?e <pred:name> \"Top Chef\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3737",
    "input_seq": "Charles Laughton attended the Royal Academy of Dramatic Art as a student until which date?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Charles Laughton\" . ?e_2 <pred:name> \"Royal Academy of Dramatic Art\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3738",
    "input_seq": "What is the size of Montevideo?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Montevideo\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_3739",
    "input_seq": "When did the ceremonial county of England that has the captital Durham (the one that is the capital of County Durham) have a population of 855900?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Durham\" . ?e_2 <capital> ?e_1 . ?e_2 <pred:name> \"County Durham\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"855900\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3740",
    "input_seq": "What is the name of the national association football team known as Selección de fútbol de Ecuador?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <official_name> ?pv . ?pv <pred:value> \"Selección de fútbol de Ecuador\" .  }"
  },
  {
    "qid": "train_3741",
    "input_seq": "Does Earth (the one whose original language is Russian), have its publication date after 1923?",
    "target_seq": "ASK { ?e <pred:name> \"Earth\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"Russian\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1923 ) .  }"
  },
  {
    "qid": "train_3742",
    "input_seq": "Which film is titled Ironclad?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Ironclad\" .  }"
  },
  {
    "qid": "train_3744",
    "input_seq": "What is the the pseudonym of the game developer that started in 1988 and ended in 2016?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:year> 2016 . ?e <inception> ?pv . ?pv <pred:year> 1988 . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <pseudonym> ?qpv .  }"
  },
  {
    "qid": "train_3745",
    "input_seq": "What is the relationship between pop music to Kelly Osbourne?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"pop music\" . ?e_2 <pred:name> \"Kelly Osbourne\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3746",
    "input_seq": "How is Google (the one whose programming language is C++) connected to C?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Google\" . ?e_1 <programming_language> ?e_3 . ?e_3 <pred:name> \"C++\" . ?e_2 <pred:name> \"C\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3747",
    "input_seq": "tell me the person that has a Twitter username JuddApatow and who has an ISNI of 0000 0001 2146 3336",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"JuddApatow\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2146 3336\" .  }"
  },
  {
    "qid": "train_3748",
    "input_seq": "Which area is larger, Greene County (the one whose population is 283870) or Cache County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Greene County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"283870\"^^xsd:double . } UNION { ?e <pred:name> \"Cache County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3749",
    "input_seq": "When did the World Trade Organization have 640 employees?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"World Trade Organization\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"640\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3750",
    "input_seq": "Was University of Tehran not founded in 1580?",
    "target_seq": "ASK { ?e <pred:name> \"University of Tehran\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1580 ) .  }"
  },
  {
    "qid": "train_3751",
    "input_seq": "Which US city is associated with zip code 46203?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv . ?pv <pred:value> \"46203\" .  }"
  },
  {
    "qid": "train_3752",
    "input_seq": "Which human plays the bass guitar instrument and has an ISNI of 0000 0000 7115 0912?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <instrument> ?e_1 . ?e_1 <pred:name> \"bass guitar\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7115 0912\" .  }"
  },
  {
    "qid": "train_3753",
    "input_seq": "How many subscribers does the person setting up in Indianapolis with the Twitter username of KennyEdmonds have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Indianapolis\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"KennyEdmonds\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3754",
    "input_seq": "What number of studio albums are titled Peter Gabriel or features Sufjan Stevens as a performer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"studio album\" .  { ?e <title> ?pv . ?pv <pred:value> \"Peter Gabriel\" .  } UNION { ?e <performer> ?e_1 . ?e_1 <pred:name> \"Sufjan Stevens\" .  } }"
  },
  {
    "qid": "train_3755",
    "input_seq": "When did the record label whose dissolution date is on 1979-01-01 dissolve?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1979-01-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }"
  },
  {
    "qid": "train_3756",
    "input_seq": "What is the character role of Tom Hollander in John Adams (the one that has Laura Linney as a cast member)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"John Adams\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Laura Linney\" . ?e_2 <pred:name> \"Tom Hollander\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3757",
    "input_seq": "The visual artwork whose official website is http://www.miramax.com/movie/pulp-fiction was released on 1994-11-03 in what location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.miramax.com/movie/pulp-fiction\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1994-11-03\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3758",
    "input_seq": "When did the person whose name in native language is William A. Horning die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"William A. Horning\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_3759",
    "input_seq": "Is the date of death after 1870 for the person that won the Filmfare Award for Best Actor (the award-winning work of this statement is Aandhi)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Filmfare Award for Best Actor\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"Aandhi\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1870 ) .  }"
  },
  {
    "qid": "train_3760",
    "input_seq": "Which website represents the soccer club that goes by dierotenbullen on Instagram?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"dierotenbullen\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3761",
    "input_seq": "When was Ronald Reagan diagnosed the medical condition Alzheimer's disease?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ronald Reagan\" . ?e_2 <pred:name> \"Alzheimer's disease\" . ?e_1 <medical_condition> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <medical_condition> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3762",
    "input_seq": "Does the Isle of Wight have the ISO 3166-2 code of GB-IOW?",
    "target_seq": "ASK { ?e <pred:name> \"Isle of Wight\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-IOW\" .  }"
  },
  {
    "qid": "train_3763",
    "input_seq": "What is the connection between Star Wars: The Clone Wars (the one that has David Tennant as a voice actor) to Michael York (the one whose CANTIC-ID is a10180011)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Star Wars: The Clone Wars\" . ?e_1 <voice_actor> ?e_3 . ?e_3 <pred:name> \"David Tennant\" . ?e_2 <pred:name> \"Michael York\" . ?e_2 <CANTIC-ID> ?pv . ?pv <pred:value> \"a10180011\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3764",
    "input_seq": "When did the 60th edition of the Primetime Emmy Awards take place?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"60th Primetime Emmy Awards\" . ?e <point_in_time> ?pv .  }"
  },
  {
    "qid": "train_3765",
    "input_seq": "West Side Story with offical website http://www.westsidestory.com was not started in 1994 was it?",
    "target_seq": "ASK { ?e <pred:name> \"West Side Story\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.westsidestory.com\" . ?e <date_of_first_performance> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1994 ) .  }"
  },
  {
    "qid": "train_3766",
    "input_seq": "What is the relationship between the 2005 NFL Draft to University of Alabama at Birmingham?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2005 NFL Draft\" . ?e_2 <pred:name> \"University of Alabama at Birmingham\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3767",
    "input_seq": "What is the connection between David Brown (the one whose birth name is David Alistair Brown) to Burton Albion F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"David Brown\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"David Alistair Brown\" . ?e_2 <pred:name> \"Burton Albion F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3768",
    "input_seq": "Which has the smallest mass among the chemical compounds whose color is white?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <color> ?e_1 . ?e_1 <pred:name> \"white\" .  ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3770",
    "input_seq": "How many sciences have the Iconclass notation 49H1?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"49H1\" .  }"
  },
  {
    "qid": "train_3771",
    "input_seq": "What is the connection between Alabama (the one that is the filming location of Borat) to Shelby County (the one whose official website is http://www.shelbycountyalabama.com)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alabama\" . ?e_3 <filming_location> ?e_1 . ?e_3 <pred:name> \"Borat\" . ?e_2 <pred:name> \"Shelby County\" . ?e_2 <official_website> ?pv . ?pv <pred:value> \"http://www.shelbycountyalabama.com\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3772",
    "input_seq": "Name the IPTC Newscode applicable to the academic discipline that is an aspect of social science.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"social science\" .  ?e <IPTC_Newscode> ?pv .  }"
  },
  {
    "qid": "train_3773",
    "input_seq": "Is the Hornbostel-Sachs classification of a baritone saxophone 422.22?",
    "target_seq": "ASK { ?e <pred:name> \"baritone saxophone\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.22\" .  }"
  },
  {
    "qid": "train_3774",
    "input_seq": "Nino Rota was nominee of which award class in 1976?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Nino Rota\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 1976 .  }"
  },
  {
    "qid": "train_3775",
    "input_seq": "Which higher education institution has ISNI 0000 0001 2180 1673?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2180 1673\" .  }"
  },
  {
    "qid": "train_3776",
    "input_seq": "Morgan Freeman is cast as which character on Evan Almighty?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Evan Almighty\" . ?e_2 <pred:name> \"Morgan Freeman\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3777",
    "input_seq": "When was the person with ISNI 0000 0000 7824 2430 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7824 2430\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3778",
    "input_seq": "Where was Conspiracy Theory published on 1997-11-06?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Conspiracy Theory\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1997-11-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3779",
    "input_seq": "How many Grammy Awards were created in a year other than 1990 or are related to the post-metal genre?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Grammy Award\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1990 ) .  } UNION { ?e <award_disciplines_or_subjects> ?e_1 . ?e_1 <pred:name> \"post-metal\" .  } }"
  },
  {
    "qid": "train_3780",
    "input_seq": "What is the subject of the statement that The Girl with the Dragon Tattoo (that received an Academy Award for Best Film Editing) was nominated for an Academy Award for Best Film Editing?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Girl with the Dragon Tattoo\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Film Editing\" . ?e_2 <pred:name> \"Academy Award for Best Film Editing\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3781",
    "input_seq": "Does the human other than Andrea Martin (the one who works as a composer), have an ISNI of 0000 0001 0720 9454?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <different_from> ?e_1 . ?e_1 <pred:name> \"Andrea Martin\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"composer\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0720 9454\" .  }"
  },
  {
    "qid": "train_3782",
    "input_seq": "What is the academic degree of both Joan Rivers (the academic major of this statement is anthropology) and Stephen Hawking?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic degree\" . ?e_1 <academic_degree> ?e . ?e_1 <pred:name> \"Joan Rivers\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <academic_degree> ; <pred:fact_t> ?e ] <academic_major> ?qpv . ?qpv <pred:value> \"anthropology\" . ?e_2 <academic_degree> ?e . ?e_2 <pred:name> \"Stephen Hawking\" .  }"
  },
  {
    "qid": "train_3783",
    "input_seq": "Was Pete Seeger born after 1866?",
    "target_seq": "ASK { ?e <pred:name> \"Pete Seeger\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1866 ) .  }"
  },
  {
    "qid": "train_3784",
    "input_seq": "Of all the landforms with a population with a fertility rate lower than 5.7, which has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <total_fertility_rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"5.7\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3785",
    "input_seq": "How is Lund University related to Lund ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lund University\" . ?e_2 <pred:name> \"Lund\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3786",
    "input_seq": "Is R. Kelly or US citizen Jennifer Hale a parent to more kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"R. Kelly\" .  } UNION { ?e <pred:name> \"Jennifer Hale\" . ?e <country_of_citizenship> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3787",
    "input_seq": "Which area is smaller, Cumberland County (the one whose FIPS 6-4 (US counties) is 37051) or Buncombe County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cumberland County\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"37051\" . } UNION { ?e <pred:name> \"Buncombe County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3788",
    "input_seq": "How many softwares are either a model item software or came after Windows XP?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" .  { ?e_1 <model_item> ?e . ?e_1 <pred:name> \"software\" .  } UNION { ?e <follows> ?e_1 . ?e_1 <pred:name> \"Windows XP\" .  } }"
  }
]