[
  {
    "qid": "train_4517",
    "input_seq": "Is the life expectancy of the administrative territorial entity whose percent of water area is equal to 81.67 percentage not equal to 13.8 years in 2002?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <water_as_percent_of_area> ?pv_1 . ?pv_1 <pred:unit> \"percentage\" . ?pv_1 <pred:value> \"81.67\"^^xsd:double . ?e <life_expectancy> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> ?v . FILTER ( ?v != \"13.8\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <life_expectancy> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2002 .  }"
  },
  {
    "qid": "train_4518",
    "input_seq": "Is the smaller area occupied by Kyoto or by Adelaide (local dialing code 08831)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kyoto\" . } UNION { ?e <pred:name> \"Adelaide\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"08831\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4519",
    "input_seq": "Does the national-association football team with the native name, Selección de fútbol de Colombia, have a ranking lower than 200 (the point in time is 1996-04-24)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Selección de fútbol de Colombia\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"200\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"1996-04-24\"^^xsd:date .  }"
  },
  {
    "qid": "train_4520",
    "input_seq": "What is the ISNI of the person who is the voice actor of Bedknobs and Broomsticks?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Bedknobs and Broomsticks\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4521",
    "input_seq": "How is Jennifer Aniston associated with Sherman Oaks?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jennifer Aniston\" . ?e_2 <pred:name> \"Sherman Oaks\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4522",
    "input_seq": "What county of Alabama has an estimated population not equal to 4400000 which shares a border with Mobile County?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Alabama\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"4400000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv . ?qpv <pred:value> \"estimation process\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Mobile County\" .  }"
  },
  {
    "qid": "train_4523",
    "input_seq": "Which area is smaller, Mexico City or Rome (the one whose postal code is 00118–00199)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mexico City\" . } UNION { ?e <pred:name> \"Rome\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"00118–00199\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4524",
    "input_seq": "Which person is a member of Clyde F.C. (the start time of this statement is 1930)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Clyde F.C.\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1930 .  }"
  },
  {
    "qid": "train_4525",
    "input_seq": "How many albums have the person whose official website is http://www.roddenberry.com/ as a performer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <performer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.roddenberry.com/\" .   }"
  },
  {
    "qid": "train_4526",
    "input_seq": "What does Leeds (the twinned administrative body of Hangzhou) have to do with Hangzhou?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Leeds\" . ?e_3 <twinned_administrative_body> ?e_1 . ?e_3 <pred:name> \"Hangzhou\" . ?e_2 <pred:name> \"Hangzhou\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4527",
    "input_seq": "Who is taller, Rita Hayworth or Chris Killen?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rita Hayworth\" .  } UNION { ?e <pred:name> \"Chris Killen\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4528",
    "input_seq": "How many filmmaking occupations usually have Belgium as a property?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"filmmaking occupation\" . ?e <properties_for_this_type> ?e_1 . ?e_1 <pred:name> \"Belgium\" .   }"
  },
  {
    "qid": "train_4529",
    "input_seq": "When did Pamela Anderson and Tommy Lee (the one that is famous for nu metal) get married?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pamela Anderson\" . ?e_2 <pred:name> \"Tommy Lee\" . ?e_3 <famous_people> ?e_2 . ?e_3 <pred:name> \"nu metal\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4530",
    "input_seq": "What number of occupations are Juliette Binoche's  or include winger, which is related to the sport of ice hockey?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" .  { ?e <has_part> ?e_1 . ?e_1 <pred:name> \"winger\" . ?e_1 <sport> ?e_2 . ?e_2 <pred:name> \"ice hockey\" .  } UNION { ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Juliette Binoche\" .  } }"
  },
  {
    "qid": "train_4531",
    "input_seq": "How many academic degrees whose abbreviation is M.A.?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic degree\" . ?e <short_name> ?pv . ?pv <pred:value> \"M.A.\" .  }"
  },
  {
    "qid": "train_4532",
    "input_seq": "What is the release date of the television series episode that has an actor named Charlie Cox whose date of birth is 1982-12-15?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Charlie Cox\" . ?e_1 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1982-12-15\"^^xsd:date . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_4533",
    "input_seq": "What is the edition number of 55th Academy Awards ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"55th Academy Awards\" . ?e <edition_number> ?pv .  }"
  },
  {
    "qid": "train_4534",
    "input_seq": "What character does Kenneth Branagh play in Shackleton?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Shackleton\" . ?e_2 <pred:name> \"Kenneth Branagh\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4535",
    "input_seq": "The film titled Blazing Saddles was publicly released on 1974-12-20 in what location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Blazing Saddles\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1974-12-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4536",
    "input_seq": "What does Looney Tunes: Back in Action (which uses the English language) have to do with Electronic Arts?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Looney Tunes: Back in Action\" . ?e_1 <language_of_work_or_name> ?e_3 . ?e_3 <pred:name> \"English\" . ?e_2 <pred:name> \"Electronic Arts\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4537",
    "input_seq": "Which person's birth date is on 1985-08-06?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1985-08-06\"^^xsd:date .  }"
  },
  {
    "qid": "train_4538",
    "input_seq": "What does Joan Baez have to do with musician?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Joan Baez\" . ?e_2 <pred:name> \"musician\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4539",
    "input_seq": "Is the season count lower for Fox Broadcasting Company's production of 24 or for Hollyoaks?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"24\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Fox Broadcasting Company\" .   } UNION { ?e <pred:name> \"Hollyoaks\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4540",
    "input_seq": "Does Lower Normandy or Picardy have the larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lower Normandy\" .  } UNION { ?e <pred:name> \"Picardy\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4541",
    "input_seq": "What is the official website of Stephen King (the one whose Instagram username is stephenking)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Stephen King\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"stephenking\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4542",
    "input_seq": "Was John Swartzwelder born after 1932?",
    "target_seq": "ASK { ?e <pred:name> \"John Swartzwelder\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1932 ) .  }"
  },
  {
    "qid": "train_4543",
    "input_seq": "What are the number of video games followed by Guitar Hero 5 or whose official website is http://www.disney.com/carsvideogames ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" .  { ?e_1 <follows> ?e . ?e_1 <pred:name> \"Guitar Hero 5\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.disney.com/carsvideogames\" .  } }"
  },
  {
    "qid": "train_4544",
    "input_seq": "What is the ISNI of Pete Docter?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pete Docter\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4545",
    "input_seq": "What is the Canadian city whose official name is City of Surrey?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Canada\" .  ?e <official_name> ?pv . ?pv <pred:value> \"City of Surrey\" .  }"
  },
  {
    "qid": "train_4546",
    "input_seq": "In what country is Ventura, whose postal code is 93003?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ventura\" . ?e <postal_code> ?pv . ?pv <pred:value> \"93003\" . [ <pred:fact_h> ?e ; <pred:fact_r> <postal_code> ; <pred:fact_t> ?pv ] <country> ?qpv .  }"
  },
  {
    "qid": "train_4547",
    "input_seq": "Does the TV series directed by Diane Keaton have more than 0 episodes ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Diane Keaton\" .  ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"0\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4548",
    "input_seq": "Is Buddy Guy's date of birth before 1974?",
    "target_seq": "ASK { ?e <pred:name> \"Buddy Guy\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1974 ) .  }"
  },
  {
    "qid": "train_4549",
    "input_seq": "Which one has more people living in the rural areas, Uttarakhand (the one whose male population is 5137773) or Gujarat (the one whose official website is http://www.gujaratindia.com/)    ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Uttarakhand\" . ?e <male_population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5137773\"^^xsd:double . } UNION { ?e <pred:name> \"Gujarat\" . ?e <official_website> ?pv_2 . ?pv_2 <pred:value> \"http://www.gujaratindia.com/\" . } ?e <rural_population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4550",
    "input_seq": "What person has a famous work titled Women in Love whose genre is novel?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <notable_work> ?e_1 . ?e_1 <pred:name> \"Women in Love\" . ?e_1 <genre> ?e_2 . ?e_2 <pred:name> \"novel\" .   }"
  },
  {
    "qid": "train_4551",
    "input_seq": "Was Louis C.K. born before 1895?",
    "target_seq": "ASK { ?e <pred:name> \"Louis C.K.\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1895 ) .  }"
  },
  {
    "qid": "train_4552",
    "input_seq": "What major did Joe Walsh, the radio personality, have at the University of Iowa?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Joe Walsh\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"radio personality\" . ?e_2 <pred:name> \"University of Iowa\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <academic_major> ?qpv .  }"
  },
  {
    "qid": "train_4553",
    "input_seq": "How is Almost Famous connected to the BAFTA Award for Best Sound?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Almost Famous\" . ?e_2 <pred:name> \"BAFTA Award for Best Sound\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4555",
    "input_seq": "At what point in time is 2581643 the population of Chittagong?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Chittagong\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2581643\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4556",
    "input_seq": "When was born the person that is a member of Bristol City F.C. (the number of goals of this statement is 35)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Bristol City F.C.\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <number_of_points/goals/set_scored> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"35\"^^xsd:double . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4557",
    "input_seq": "Which movie cost less to make, Anaconda or Batman Begins (the one that is written by Bill Finger)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Anaconda\" .  } UNION { ?e <pred:name> \"Batman Begins\" . ?e <after_a_work_by> ?e_1 . ?e_1 <pred:name> \"Bill Finger\" .   } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4558",
    "input_seq": "When was the death of the Victoria whose monogram is Royal Monogram of Queen Victoria of Great Britain.svg?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Victoria\" . ?e <monogram> ?pv_1 . ?pv_1 <pred:value> \"Royal Monogram of Queen Victoria of Great Britain.svg\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_4559",
    "input_seq": "When was the Jamaica national football team ranked 116?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Jamaica national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"116\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4560",
    "input_seq": "Which is longer, The English Patient or Havana published on 1990-01-01?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The English Patient\" . } UNION { ?e <pred:name> \"Havana\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4561",
    "input_seq": "For Mindscape (belongs to the software industry), what is the language for its intelligent official website,  https://web.archive.org/web/20071029004950/http://jeux.mindscape.com:80/Main/Default.aspx?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mindscape\" . ?e <industry> ?e_1 . ?e_1 <pred:name> \"software\" .  ?e <official_website> ?pv . ?pv <pred:value> \"https://web.archive.org/web/20071029004950/http://jeux.mindscape.com:80/Main/Default.aspx\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4562",
    "input_seq": "At what point in time is 721599 the population of the city that shares a border with Toronto?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Toronto\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"721599\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4563",
    "input_seq": "Does Man of Steel or The Prize have the longer runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Man of Steel\" .  } UNION { ?e <pred:name> \"The Prize\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4564",
    "input_seq": "Which has lower elevation above sea level, Coburg or Weimar?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Coburg\" .  } UNION { ?e <pred:name> \"Weimar\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4565",
    "input_seq": "What is the date of birth of the person who was nominated for the Grammy Award for Song of the Year in 2009?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Grammy Award for Song of the Year\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2009 . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4566",
    "input_seq": "For the geographic region that is the continent that Russian Soviet Federative Socialist Republic (the one that is the country of Riga) locates, what is the time point of its population is 1120000000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e_1 <continent> ?e . ?e_1 <pred:name> \"Russian Soviet Federative Socialist Republic\" . ?e_2 <country> ?e_1 . ?e_2 <pred:name> \"Riga\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1120000000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4567",
    "input_seq": "Does the sovereign state whose demonym is ليبي, have a population greater than 330000 (the point in time of this statement is 1996)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"ليبي\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"330000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 1996 .  }"
  },
  {
    "qid": "train_4568",
    "input_seq": "When did the county of Massachusetts whose Dewey Decimal Classification is 2--7447 have a population of 696023?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7447\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"696023\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4569",
    "input_seq": "Does pantothenic acid or L-Histidine have a higher melting point?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"pantothenic acid\" .  } UNION { ?e <pred:name> \"L-Histidine\" .  } ?e <melting_point> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4570",
    "input_seq": "What is the character role of Rosie O'Donnell, voice actor in Tarzan (the one published on 12th Nov 1999) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tarzan\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1999-11-12\"^^xsd:date . ?e_2 <pred:name> \"Rosie O'Donnell\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4571",
    "input_seq": "Which Ireland's county uses MH as its licence plate code ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ireland\" . ?e <licence_plate_code> ?pv . ?pv <pred:value> \"MH\" .  }"
  },
  {
    "qid": "train_4572",
    "input_seq": "Which TV series has the title Fear the Walking Dead?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv . ?pv <pred:value> \"Fear the Walking Dead\" .  }"
  },
  {
    "qid": "train_4573",
    "input_seq": "Is the date of birth for the human whose birth name is Hiram Ulysses Grant after 1999?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Hiram Ulysses Grant\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1999 ) .  }"
  },
  {
    "qid": "train_4574",
    "input_seq": "Which area is smaller, Ghent or Coimbatore district?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ghent\" .  } UNION { ?e <pred:name> \"Coimbatore district\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4575",
    "input_seq": "Which area is larger, Menlo Park or Lafayette (the one whose elevation (above sea level) is 211 metre)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Menlo Park\" . } UNION { ?e <pred:name> \"Lafayette\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"211\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4576",
    "input_seq": "Which movie is shorter, Kiki's Delivery Service or The Sound of Music (the one whose publication date is 1965-03-02)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kiki's Delivery Service\" . } UNION { ?e <pred:name> \"The Sound of Music\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1965-03-02\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4577",
    "input_seq": "How many Pennsylvania counties have population of 4000000, or population above 60000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4000000\"^^xsd:double .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"60000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_4578",
    "input_seq": "Which is 3rd in the series of American Pie movies that includes American Wedding?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <part_of_the_series> ?e_1 . ?e_1 <pred:name> \"American Pie\" . ?e_2 <part_of_the_series> ?e_1 . ?e_2 <pred:name> \"American Wedding\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_1 ] <series_ordinal> ?qpv . ?qpv <pred:value> \"3\" .  }"
  },
  {
    "qid": "train_4579",
    "input_seq": "What is the name of the person that died after 2011 and with Libris-URI vs69hcjd5550d4c?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2011 ) . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"vs69hcjd5550d4c\" .  }"
  },
  {
    "qid": "train_4580",
    "input_seq": "Is there less area in Kagoshima Prefecture or in Hiroshima Prefecture?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kagoshima Prefecture\" .  } UNION { ?e <pred:name> \"Hiroshima Prefecture\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4581",
    "input_seq": "Which movie titled क्वीन was filmed in Paris, where the euro is the form of currency?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"क्वीन\" . ?e <filming_location> ?e_1 . ?e_1 <pred:name> \"Paris\" . ?e_1 <currency> ?e_2 . ?e_2 <pred:name> \"euro\" .  }"
  },
  {
    "qid": "train_4582",
    "input_seq": "Which movie that mainly depicts American football has the longest runtime?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"American football\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4583",
    "input_seq": "At what time point did Pearl Jam (the one that received 1996 Grammy Awards) receive the Grammy Award for Best Hard Rock Performance?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pearl Jam\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"1996 Grammy Awards\" . ?e_2 <pred:name> \"Grammy Award for Best Hard Rock Performance\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4584",
    "input_seq": "What is the connection between The Whistleblower to Denmark?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Whistleblower\" . ?e_2 <pred:name> \"Denmark\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4585",
    "input_seq": "What number of unitary states have the IOC country code of FIJ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"unitary state\" . ?e <IOC_country_code> ?pv . ?pv <pred:value> \"FIJ\" .  }"
  },
  {
    "qid": "train_4586",
    "input_seq": "What theatre award was Debbie Reynolds nominated for?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Debbie Reynolds\" .   }"
  },
  {
    "qid": "train_4587",
    "input_seq": "How is Love Actually linked to the Golden Globe Award for Best Screenplay?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Love Actually\" . ?e_2 <pred:name> \"Golden Globe Award for Best Screenplay\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4588",
    "input_seq": "Where was Red Dragon (the one whose director of photography is Dante Spinotti) published on 2002-10-25 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Red Dragon\" . ?e <director_of_photography> ?e_1 . ?e_1 <pred:name> \"Dante Spinotti\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2002-10-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4589",
    "input_seq": "When was person whose Deutsche Synchronkartei actor-ID is 6976 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv_1 . ?pv_1 <pred:value> \"6976\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4590",
    "input_seq": "Which person's official website is http://www.albertbrooks.com/ and is ethnically Jewish?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.albertbrooks.com/\" . ?e <ethnic_group> ?e_1 . ?e_1 <pred:name> \"Jewish people\" .  }"
  },
  {
    "qid": "train_4591",
    "input_seq": "What higher education institution has street address 8000 Utopia Pky, Queens, NY, 11439?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <located_at_street_address> ?pv . ?pv <pred:value> \"8000 Utopia Pky, Queens, NY, 11439\" .  }"
  },
  {
    "qid": "train_4592",
    "input_seq": "How many people does the person with the official website of http://www.stevewinwood.com/ have under the Twitter username of SteveWinwood?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.stevewinwood.com/\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SteveWinwood\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4593",
    "input_seq": "Does Thousand Oaks or Albuquerque (whose Dewey Decimal Classification is 2--78961) have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Thousand Oaks\" . } UNION { ?e <pred:name> \"Albuquerque\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--78961\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4594",
    "input_seq": "What is the postal code for Chester (the one whose inception time is 1682)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chester\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1682 . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_4595",
    "input_seq": "Is the date of birth of the person having the ISNI 0000 0001 1652 1351 prior to 1943?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1652 1351\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1943 ) .  }"
  },
  {
    "qid": "train_4596",
    "input_seq": "Who's mass is greater between Mike Bryan and Hilary Duff?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mike Bryan\" .  } UNION { ?e <pred:name> \"Hilary Duff\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4597",
    "input_seq": "Which has fewer people, Oldham (the one whose population is 96555) or Harlow (the one that is the birthplace of Victoria Beckham)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Oldham\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"96555\"^^xsd:double . } UNION { ?e <pred:name> \"Harlow\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Victoria Beckham\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4598",
    "input_seq": "How many public educational institutions in the United States have an ISNI of 0000 0001 2296 3025 or have the postal code of 24450-0304?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public educational institution of the United States\" .  { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2296 3025\" .  } UNION { ?e <postal_code> ?pv . ?pv <pred:value> \"24450-0304\" .  } }"
  }
]