[
  {
    "qid": "train_2786",
    "input_seq": "How many island are an administrative division of Argentina?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Argentina\" .   }"
  },
  {
    "qid": "train_2787",
    "input_seq": "Which area is larger, Gila County or Pinal County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Gila County\" .  } UNION { ?e <pred:name> \"Pinal County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2788",
    "input_seq": "What is the connection between Donald Trump (the one that works in the location Falls Church) to Falls Church?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Donald Trump\" . ?e_1 <work_location> ?e_3 . ?e_3 <pred:name> \"Falls Church\" . ?e_2 <pred:name> \"Falls Church\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2789",
    "input_seq": "Between Wayne's World and Academy Award for best Director nominee Gone With the Wind, which one is shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wayne's World\" .  } UNION { ?e <pred:name> \"Gone with the Wind\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Director\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2790",
    "input_seq": "Does the person with the Twitter username of m_millsey, have ISNI 0000 0001 2270 6790?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"m_millsey\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2270 6790\" .  }"
  },
  {
    "qid": "train_2791",
    "input_seq": "What is the CANTIC-ID of the person that is the teacher of Friedrich Hayek?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <student_of> ?e . ?e_1 <pred:name> \"Friedrich Hayek\" .  ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_2792",
    "input_seq": "What is the connection between Monty Python and the Holy Grail and Denmark?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Monty Python and the Holy Grail\" . ?e_2 <pred:name> \"Denmark\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2793",
    "input_seq": "What is the connection between Howard the Duck (the one whose producer is Ian Bryce) to California (the one that is the narrative location of We Bought a Zoo)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Howard the Duck\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Ian Bryce\" . ?e_2 <pred:name> \"California\" . ?e_4 <narrative_location> ?e_2 . ?e_4 <pred:name> \"We Bought a Zoo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2794",
    "input_seq": "How many provinces of the Netherlands are in the continent of Eurasia and whose capital is Utrecht (the one whose CBS municipality code is 0344)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of the Netherlands\" . ?e <continent> ?e_1 . ?e_1 <pred:name> \"Eurasia\" .  ?e <capital> ?e_2 . ?e_2 <pred:name> \"Utrecht\" . ?e_2 <CBS_municipality_code> ?pv . ?pv <pred:value> \"0344\" .  }"
  },
  {
    "qid": "train_2795",
    "input_seq": "What is the relationship between guitar and Earl Scruggs?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"guitar\" . ?e_2 <pred:name> \"Earl Scruggs\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2796",
    "input_seq": "What film has the composer who is the person born in Thunder Bay (the one whose Statistics Canada Geographic code is 3558004)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <composer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <place_of_birth> ?e_2 . ?e_2 <pred:name> \"Thunder Bay\" . ?e_2 <Statistics_Canada_Geographic_code> ?pv . ?pv <pred:value> \"3558004\" .   }"
  },
  {
    "qid": "train_2797",
    "input_seq": "What is the relationship between The Treasure of the Sierra Madre and Mexico?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Treasure of the Sierra Madre\" . ?e_2 <pred:name> \"Mexico\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2798",
    "input_seq": "How many Christians have their headquarters in Takoma Park?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Takoma Park\" .   }"
  },
  {
    "qid": "train_2799",
    "input_seq": "What is the end time for Courteney Cox as Michael Keaton's partner?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Courteney Cox\" . ?e_2 <pred:name> \"Michael Keaton\" . ?e_1 <partner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <partner> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2800",
    "input_seq": "Does the city with postal code SN1 have other than 3000 inhabitants?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"SN1\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"3000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2801",
    "input_seq": "What is the work period (start) of the human that is a cast member of The Three Musketeers (which was published 1935-11-01)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"The Three Musketeers\" . ?e_1 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1935-11-01\"^^xsd:date . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_2802",
    "input_seq": "Which is longer, the Spanish version of The Proposal, or Master and Commander: The Far Side of the World?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Proposal\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"Spanish\" .   } UNION { ?e <pred:name> \"Master and Commander: The Far Side of the World\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2803",
    "input_seq": "Was the person with ISNI 0000 0001 1626 2142 born after 1889?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1626 2142\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1889 ) .  }"
  },
  {
    "qid": "train_2804",
    "input_seq": "Tim Roth is cast in what part of The Incredible Hulk, filmed at the University of Toronto?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Incredible Hulk\" . ?e_1 <filming_location> ?e_3 . ?e_3 <pred:name> \"University of Toronto\" . ?e_2 <pred:name> \"Tim Roth\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <part_of> ?qpv .  }"
  },
  {
    "qid": "train_2805",
    "input_seq": "Which has the most area among the New York counties whose population is less than 550000000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"550000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2806",
    "input_seq": "Who is taller, Omar Sharif or Emma Watson?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Omar Sharif\" .  } UNION { ?e <pred:name> \"Emma Watson\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2807",
    "input_seq": "What association football club contains the member Alex Manninger and uses the Italian-language official website http://www.robursiena.it ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Alex Manninger\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.robursiena.it\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"Italian\" .  }"
  },
  {
    "qid": "train_2808",
    "input_seq": "What is the Twitter username of the band the Peter Tork is in?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <has_part> ?e_1 . ?e_1 <pred:name> \"Peter Tork\" .  ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_2810",
    "input_seq": "What number of independent cities are located in the continent of Transylvania (the one that is the narrative location of Hotel Transylvania)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <continent> ?e_1 . ?e_1 <pred:name> \"Transylvania\" . ?e_2 <narrative_location> ?e_1 . ?e_2 <pred:name> \"Hotel Transylvania\" .   }"
  },
  {
    "qid": "train_2811",
    "input_seq": "Which area has higher population between Aspen and Waterbury?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Aspen\" .  } UNION { ?e <pred:name> \"Waterbury\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2812",
    "input_seq": "What is the relationship between the National Board of Review Award for Best Actress and Sally Field?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"National Board of Review Award for Best Actress\" . ?e_2 <pred:name> \"Sally Field\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2813",
    "input_seq": "Regarding Walter Murch, does he or she have an ISNI equal to 0000 0000 5430 5935 ?",
    "target_seq": "ASK { ?e <pred:name> \"Walter Murch\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 5430 5935\" .  }"
  },
  {
    "qid": "train_2814",
    "input_seq": "What is the population of the United States city whose land area is 209.876261square kilometers?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"209.876261\"^^xsd:double . ?e <population> ?pv .  }"
  },
  {
    "qid": "train_2815",
    "input_seq": "Which art school is the one where Robert de Niro, the one that died from cancer, studied before, and that was dissolved not in 1946?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art school\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1946 ) . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Robert De Niro\" . ?e_1 <cause_of_death> ?e_2 . ?e_2 <pred:name> \"cancer\" .  }"
  },
  {
    "qid": "train_2816",
    "input_seq": "What is Colorado Springs' population?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Colorado Springs\" . ?e <population> ?pv .  }"
  },
  {
    "qid": "train_2817",
    "input_seq": "Which movie is longer, George Washington (the one that is shot in North Carolina) or Spartacus (the one that has Ian McNeice as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"George Washington\" . ?e <filming_location> ?e_1 . ?e_1 <pred:name> \"North Carolina\" .   } UNION { ?e <pred:name> \"Spartacus\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Ian McNeice\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2818",
    "input_seq": "How many mountain ranges, located in a United States state, contain Ontario County?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"state of the United States\" . ?e_3 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_3 <pred:name> \"Ontario County\" .   }"
  },
  {
    "qid": "train_2819",
    "input_seq": "When did Shanxi reach the population of 36,5 million ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Shanxi\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"36500000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2820",
    "input_seq": "What is the character role of Frank Langella in Unknown (the one that has January Jones as a cast member)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Unknown\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"January Jones\" . ?e_2 <pred:name> \"Frank Langella\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2821",
    "input_seq": "What is United States of America citizen Michael Dobson's street address in Brooklyn (the birthplace of John Buscema)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Michael Dobson\" . ?e_1 <country_of_citizenship> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Brooklyn\" . ?e_4 <place_of_birth> ?e_2 . ?e_4 <pred:name> \"John Buscema\" . ?e_1 <residence> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <residence> ; <pred:fact_t> ?e_2 ] <located_at_street_address_(DEPRECATED)> ?qpv .  }"
  },
  {
    "qid": "train_2822",
    "input_seq": "For which project was Stephen Tobolowsky nominated for a Tony Award for Best Featured Actor in a Play?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Stephen Tobolowsky\" . ?e_2 <pred:name> \"Tony Award for Best Featured Actor in a Play\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2823",
    "input_seq": "Does Ontario County note have a population of 5.8 (the point in time of this statement is 2012-07-01)?",
    "target_seq": "ASK { ?e <pred:name> \"Ontario County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"5.8\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2012-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_2824",
    "input_seq": "Does Middlebury College or ETH Zurich have a smaller student body?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Middlebury College\" .  } UNION { ?e <pred:name> \"ETH Zurich\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2825",
    "input_seq": "How many medals are awarded for the field of number theory or were established later than 1862?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" .  { ?e <award_disciplines_or_subjects> ?e_1 . ?e_1 <pred:name> \"number theory\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1862 ) .  } }"
  },
  {
    "qid": "train_2826",
    "input_seq": "Which pain has the UMLS CUI of C0018681?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pain\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0018681\" .  }"
  },
  {
    "qid": "train_2827",
    "input_seq": "Which has the smallest area among the California counties whose population is not 8900000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"8900000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2828",
    "input_seq": "When did Led Zeppelin which includes Robert Plant receive a Grammy Lifetime Achievement Award?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Led Zeppelin\" . ?e_1 <has_part> ?e_3 . ?e_3 <pred:name> \"Robert Plant\" . ?e_2 <pred:name> \"Grammy Lifetime Achievement Award\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2829",
    "input_seq": "What Twitter handle belongs to the New York Islanders?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"New York Islanders\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_2830",
    "input_seq": "What television series has an original language of English and had Barry Pepper on its cast?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Barry Pepper\" .  }"
  },
  {
    "qid": "train_2831",
    "input_seq": "Tell me the record label that contains MGM records as part of it.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e_1 <part_of> ?e . ?e_1 <pred:name> \"MGM Records\" .   }"
  },
  {
    "qid": "train_2832",
    "input_seq": "What is the connection between Carrie (the one whose distributor is Sony Pictures) to teen film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Carrie\" . ?e_1 <distributor> ?e_3 . ?e_3 <pred:name> \"Sony Pictures\" . ?e_2 <pred:name> \"teen film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2833",
    "input_seq": "How is Robert Gates related to the USA?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Robert Gates\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2834",
    "input_seq": "What is the ISNI for the county of Michigan that Pontiac is located in?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Pontiac\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2835",
    "input_seq": "Which TV network owns the TV network represented online at www.abc.net.au/tv/channels/abc1.htm?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television network\" . ?e <owner_of> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"television network\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.abc.net.au/tv/channels/abc1.htm\" .   }"
  },
  {
    "qid": "train_2836",
    "input_seq": "What is the connection between Peter Sellers and the Academy Award for Best Live Action Short Film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peter Sellers\" . ?e_2 <pred:name> \"Academy Award for Best Live Action Short Film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2837",
    "input_seq": "What sport season was picked from the school with the higher education institution that has the ISNI of 0000 0000 9632 6718?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sports season\" . ?e <draft_pick_from_school> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"higher education institution\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9632 6718\" .   }"
  },
  {
    "qid": "train_2838",
    "input_seq": "Does Las Vegas, where Steve Gerber died, or Pensacola occupy a smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Las Vegas\" . ?e_1 <place_of_death> ?e . ?e_1 <pred:name> \"Steve Gerber\" .   } UNION { ?e <pred:name> \"Pensacola\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2839",
    "input_seq": "Did the person with ISNI 0000 0001 1475 3650 die before 2005?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1475 3650\" . ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2005 ) .  }"
  },
  {
    "qid": "train_2840",
    "input_seq": "How is Fiddler on the Roof titled?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fiddler on the Roof\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2841",
    "input_seq": "For the liberal-arts college that is Ry Cooder's school, what is the language associated with this creative work for its official website of http://www.reed.edu?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"liberal arts college\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Ry Cooder\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.reed.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2842",
    "input_seq": "What is the debut region of the visual artwork that received an Academy Award for Best Supporting Actress whose winner is Tilda Swinton and has the release date 2008-02-28?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actress\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <winner> ?qpv_1 . ?qpv_1 <pred:value> \"Tilda Swinton\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-02-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2843",
    "input_seq": "What is the connection between Republic of Venice to Italian?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Republic of Venice\" . ?e_2 <pred:name> \"Italian\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2844",
    "input_seq": "How many time zones have an offset of 10 hours or cover the country of Vanuatu?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"time zone\" .  { ?e <timezone_offset> ?pv . ?pv <pred:unit> \"hour\" . ?pv <pred:value> \"10\"^^xsd:double .  } UNION { ?e <country> ?e_1 . ?e_1 <pred:name> \"Vanuatu\" .  } }"
  },
  {
    "qid": "train_2845",
    "input_seq": "Regarding the religion that you can find at terrain feature Canada and that has an inception of -500 tell me what page(s) it is in.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <located_on_terrain_feature> ?e_1 . ?e_1 <pred:name> \"Canada\" .  ?e <inception> ?pv . ?pv <pred:year> -500 . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <page(s)> ?qpv .  }"
  },
  {
    "qid": "train_2846",
    "input_seq": "When did the first-level administrative country subdivision found in the country of the People's Republic of China gain the ISO 3166-2 code CN-XJ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"People's Republic of China\" .  ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"CN-XJ\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2847",
    "input_seq": "For the sovereign state whose demonym is vietnamita (the involved part of this statement is masculine singular), what is the time point for its inflation rate of 19.9 percentage?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"vietnamita\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv_1 ] <applies_to_part> ?qpv_1 . ?qpv_1 <pred:value> \"masculine singular\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"19.9\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2848",
    "input_seq": "After 1864 which among New York City has the largest population",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1864 ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2849",
    "input_seq": "Which one has fewer students between the University of Amsterdam and the University of Tehran?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Amsterdam\" .  } UNION { ?e <pred:name> \"University of Tehran\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2850",
    "input_seq": "How many awards events took place at a year pre-dating 2012?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award ceremony\" . ?e <point_in_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2012 ) .  }"
  },
  {
    "qid": "train_2851",
    "input_seq": "Among the rivers that have Canada as a basin country, which one has the largest discharge?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <basin_country> ?e_1 . ?e_1 <pred:name> \"Canada\" .  ?e <discharge> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2852",
    "input_seq": "Which has the smallest area among the Washington counties that border San Juan County that is an administrative division of Washington?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"San Juan County\" . ?e_2 <contains_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"Washington\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2853",
    "input_seq": "What colleges and universities in the U.S. are located in Nevada whose elevation above sea level is 1676 meters?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"colleges and universities in the United States\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Nevada\" . ?e_1 <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"1676\"^^xsd:double .   }"
  },
  {
    "qid": "train_2854",
    "input_seq": "Tell me when Henry Blank was born.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Henry Blanke\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2855",
    "input_seq": "Which is longer, Everyone Says I Love You or Luther produced by the Australian Broadcasting Corporation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Everyone Says I Love You\" .  } UNION { ?e <pred:name> \"Luther\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Australian Broadcasting Corporation\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2856",
    "input_seq": "What is the title of the movie published on 1938-12-16?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1938-12-16\"^^xsd:date . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2857",
    "input_seq": "What is the running time of Brothers whose production company is Columbia Pictures?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brothers\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Columbia Pictures\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_2858",
    "input_seq": "When did Mark Moses win a Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series\" . ?e_2 <pred:name> \"Mark Moses\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2859",
    "input_seq": "Tell me the one with the least elevation (over sea level) within the New Jersey city that has an inception time not in 1792.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 1792 ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2860",
    "input_seq": "Is the official website of the Academy Awards that was nominated to Kate Winslet at the 77th Academy Awards http://oscars.org/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Kate Winslet\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"77th Academy Awards\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://oscars.org/\" .  }"
  },
  {
    "qid": "train_2861",
    "input_seq": "What is Govinda's Instagram username?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Govinda\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_2862",
    "input_seq": "What is the FIPS 10-4 (countries and regions) for the first-level administrative country subdivision that surrounds the enclave Kuala Lumpur?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e_1 <enclave_within> ?e . ?e_1 <pred:name> \"Kuala Lumpur\" .  ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }"
  },
  {
    "qid": "train_2863",
    "input_seq": "During what time point was Sweeney Todd: The Demon Barber of Fleet Street (published in 1979) nominated for a Grammy Award for best musical theatre album?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Sweeney Todd: The Demon Barber of Fleet Street\" . ?e_1 <publication_date> ?pv . ?pv <pred:year> 1979 . ?e_2 <pred:name> \"Grammy Award for Best Musical Theater Album\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2864",
    "input_seq": "Was the association football club with the website of http://www.hif.se founded on 1885-12-28?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.hif.se\" . ?e <inception> ?pv . ?pv <pred:date> \"1885-12-28\"^^xsd:date .  }"
  },
  {
    "qid": "train_2865",
    "input_seq": "What is the OSM tag or key for the natural disaster that is studied by geology?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"natural disaster\" . ?e <studied_by> ?e_1 . ?e_1 <pred:name> \"geology\" .  ?e <OSM_tag_or_key> ?pv .  }"
  },
  {
    "qid": "train_2866",
    "input_seq": "What is the Twitter username for the band whose official website is http://thekinks.info?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://thekinks.info\" . ?e <Twitter_username> ?pv .  }"
  }
]