[
  {
    "qid": "train_4272",
    "input_seq": "What is the relation between Pas-de-Calais and Nord-Pas-de-Calais?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pas-de-Calais\" . ?e_2 <pred:name> \"Nord-Pas-de-Calais\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4273",
    "input_seq": "How is Rounder Records related to blues ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rounder Records\" . ?e_2 <pred:name> \"blues\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4274",
    "input_seq": "Hertha BSC has how many subscribers to its Twitter account name HerthaBSC?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hertha BSC\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"HerthaBSC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4275",
    "input_seq": "What is the official website of the state of India whose official name is Уттаранчал (the end time of this statement is 2006)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Уттаранчал\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv . ?qpv <pred:year> 2006 . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4276",
    "input_seq": "When did the  1985 Major League Baseball season take place?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"1985 Major League Baseball season\" . ?e <point_in_time> ?pv .  }"
  },
  {
    "qid": "train_4277",
    "input_seq": "What is the start date that Manchester (that is situated in Greater Manchester) is located in Greater Manchester?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Manchester\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_3 . ?e_3 <pred:name> \"Greater Manchester\" . ?e_2 <pred:name> \"Greater Manchester\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4278",
    "input_seq": "What are the number of video games that is designed by Steven Spielberg or whose publication date is in 2007 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" .  { ?e <designed_by> ?e_1 . ?e_1 <pred:name> \"Steven Spielberg\" .  } UNION { ?e <publication_date> ?pv . ?pv <pred:year> 2007 .  } }"
  },
  {
    "qid": "train_4279",
    "input_seq": "Tell me the one with the least area within the Italian province that is a Piedmont (the one with the capital Turin) administrative division.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Italy\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Piedmont\" . ?e_2 <capital_of> ?e_1 . ?e_2 <pred:name> \"Turin\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4280",
    "input_seq": "How many sports do we know How many sport whose OSM tag or key is Tag:sport=shooting or that are  practiced by graphic designer",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" .  { ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:sport=shooting\" .  } UNION { ?e <practiced_by> ?e_1 . ?e_1 <pred:name> \"graphic designer\" .  } }"
  },
  {
    "qid": "train_4281",
    "input_seq": "ISNI 0000 0001 0938 7748 represents which individual?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0938 7748\" .  }"
  },
  {
    "qid": "train_4282",
    "input_seq": "When did Venezuela have an inflation rate of 20.1 percentage?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Venezuela\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"20.1\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4283",
    "input_seq": "What is the connection between PFC Spartak Nalchik to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"PFC Spartak Nalchik\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4284",
    "input_seq": "Which of the cities in New Jersey that was founded after 1625 is the smallest in area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1625 ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4285",
    "input_seq": "Who is the reviewer of the 51st ranked national association football team that has Theofanis Gekas on it?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Theofanis Gekas\" .  ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"51\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <review_score_by> ?qpv .  }"
  },
  {
    "qid": "train_4286",
    "input_seq": "Is 00000015911 the Munsinger IBA of the person that's a part of The Mothers of Invention?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"The Mothers of Invention\" .  ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000015911\" .  }"
  },
  {
    "qid": "train_4287",
    "input_seq": "When was Willie Nelson nominated for a Grammy Award for Record of the Year?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Willie Nelson\" . ?e_2 <pred:name> \"Grammy Award for Record of the Year\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4288",
    "input_seq": "What is the subject of this statement: Northern Territory shares border with South Australia?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Northern Territory\" . ?e_2 <pred:name> \"South Australia\" . ?e_1 <shares_border_with> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4289",
    "input_seq": "What TV series started after 1901 and has an official website at https://www.cbs.com/shows/the_bold_and_the_beautiful/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.cbs.com/shows/the_bold_and_the_beautiful/\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:year> ?v . FILTER ( ?v > 1901 ) .  }"
  },
  {
    "qid": "train_4290",
    "input_seq": "What television series is derived from Charmed (the one whose number of episodes is 8) and has a number of seasons greater than 0?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"Charmed\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8\"^^xsd:double .  ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"0\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4291",
    "input_seq": "What person is a member of the association football club whose nickname is Οι σφήκες having scored 11 points?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"association football club\" . ?e_1 <nickname> ?pv . ?pv <pred:value> \"Οι σφήκες\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <number_of_points/goals/set_scored> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"11\"^^xsd:double .  }"
  },
  {
    "qid": "train_4292",
    "input_seq": "How was it determined that the Tunisia national football team is ranked 65?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Tunisia national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_4293",
    "input_seq": "Which area is smaller, Sardinia (the one that locates in the continent of Europe) or Maui?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sardinia\" . ?e <continent> ?e_1 . ?e_1 <pred:name> \"Europe\" .   } UNION { ?e <pred:name> \"Maui\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4294",
    "input_seq": "How is Taiwo Atieno related to Kidderminster Harriers F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Taiwo Atieno\" . ?e_2 <pred:name> \"Kidderminster Harriers F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4295",
    "input_seq": "Tell me the date of birth for the person with the CANTIC-ID of a12282339",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a12282339\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4296",
    "input_seq": "Which Wisconsin county shares a border with the Wisconsin county whose population is 74624?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Wisconsin\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"county of Wisconsin\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"74624\"^^xsd:double .   }"
  },
  {
    "qid": "train_4297",
    "input_seq": "When was Randy Jackson (the one that is a sibling of La Toya Jackson) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Randy Jackson\" . ?e_1 <sibling> ?e . ?e_1 <pred:name> \"La Toya Jackson\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4298",
    "input_seq": "What is the connection between John Davis (the one that is the member of political party Democratic Party) to Democratic Party?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Davis\" . ?e_1 <member_of_political_party> ?e_3 . ?e_3 <pred:name> \"Democratic Party\" . ?e_2 <pred:name> \"Democratic Party\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4299",
    "input_seq": "How is Guildford (with the official website of http://www.guildford.gov.uk) related to the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guildford\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.guildford.gov.uk\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4300",
    "input_seq": "Which human has the Deutsche Synchronkartei actor-ID of 7057?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv . ?pv <pred:value> \"7057\" .  }"
  },
  {
    "qid": "train_4301",
    "input_seq": "When was the MTV Video Music Award won by Missy Elliott in 2003 created?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e <winner> ?e_1 . ?e_1 <pred:name> \"Missy Elliott\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2003 . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4302",
    "input_seq": "Does Hornbostel-Sachs classify the electric guitar as 513 ?",
    "target_seq": "ASK { ?e <pred:name> \"electric guitar\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"513\" .  }"
  },
  {
    "qid": "train_4303",
    "input_seq": "How many people subscribe to Lacey Chabert, under the Twitter username of IamLaceyChabert?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lacey Chabert\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"IamLaceyChabert\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4304",
    "input_seq": "Does Hyde Park on Hudson or Gaslight have the longer runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hyde Park on Hudson\" .  } UNION { ?e <pred:name> \"Gaslight\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4305",
    "input_seq": "How is Moscow, official website www.moscow.id.us, related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Moscow\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.moscow.id.us/\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4306",
    "input_seq": "When did  Liev Schreiber become a partner of Naomi Watts?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Liev Schreiber\" . ?e_2 <pred:name> \"Naomi Watts\" . ?e_1 <partner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <partner> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4307",
    "input_seq": "What literary work has the official website http://www.prettylittleliars.com/ (this statement's language is English) and derives Pretty Little Liars (that is originally aired on Freeform)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.prettylittleliars.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"Pretty Little Liars\" . ?e_1 <original_network> ?e_2 . ?e_2 <pred:name> \"Freeform\" .  }"
  },
  {
    "qid": "train_4308",
    "input_seq": "When did David Sylvain's work period start?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"David Sylvian\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_4309",
    "input_seq": "tell me the ZIP code of Colorado College's headquarter location in Colorado Springs.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Colorado College\" . ?e_2 <pred:name> \"Colorado Springs\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_4310",
    "input_seq": "Which art movement was founded in 1910?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <inception> ?pv . ?pv <pred:year> 1910 .  }"
  },
  {
    "qid": "train_4311",
    "input_seq": "Show me the state that has diplomatic relationships with Libya (this statement has the subject Granada Libya relations).",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e_1 <diplomatic_relation> ?e . ?e_1 <pred:name> \"Libya\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Grenada–Libya relations\" .  }"
  },
  {
    "qid": "train_4312",
    "input_seq": "Is Abidjan or Seville lower in elevation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Abidjan\" .  } UNION { ?e <pred:name> \"Seville\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4313",
    "input_seq": "What's the relationship between Vanderbilt University and June Carter Cash?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"June Carter Cash\" . ?e_2 <pred:name> \"Vanderbilt University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4314",
    "input_seq": "Tell me the movie that got the award that has a start time other than 1960 (this statement's winner is Frank Sinatra).",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"award\" . ?e_1 <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1960 ) .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <winner> ?qpv . ?qpv <pred:value> \"Frank Sinatra\" .  }"
  },
  {
    "qid": "train_4315",
    "input_seq": "Which person's official website is http://www.jeffbeck.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.jeffbeck.com\" .  }"
  },
  {
    "qid": "train_4316",
    "input_seq": "Is Christopher Whitelaw Pine the native language version of Chris Pine's name ?",
    "target_seq": "ASK { ?e <pred:name> \"Chris Pine\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Christopher Whitelaw Pine\" .  }"
  },
  {
    "qid": "train_4317",
    "input_seq": "Anastasia, run-time 105 minutes, was nominated for an Academy Award for which Best Actress?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Anastasia\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"105\"^^xsd:double . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4318",
    "input_seq": "When was American English-language The Road the Locus Award nominee for Best Science Fiction Novel?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Road\" . ?e_1 <language_of_work_or_name> ?e_3 . ?e_3 <pred:name> \"American English\" . ?e_2 <pred:name> \"Locus Award for Best Science Fiction Novel\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4319",
    "input_seq": "Which one has more speakers, Korean or Filipino?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Filipino\" .  } UNION { ?e <pred:name> \"Korean\" .  } ?e <number_of_speakers> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4320",
    "input_seq": "Which area is smaller, Albany County or Orange County (the one whose population is 373443)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Albany County\" . } UNION { ?e <pred:name> \"Orange County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"373443\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4321",
    "input_seq": "Who is the person that influenced Amy Winehouse and that is famous for contemporary R&B?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <influenced_by> ?e . ?e_1 <pred:name> \"Amy Winehouse\" .  ?e_2 <famous_people> ?e . ?e_2 <pred:name> \"contemporary R&B\" .  }"
  },
  {
    "qid": "train_4322",
    "input_seq": "Does Thandie Newton or Pamela Anderson have more children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Thandie Newton\" .  } UNION { ?e <pred:name> \"Pamela Anderson\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4323",
    "input_seq": "Iron Sky and Walt Disney Studios Motion Pictures are related in what way?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Iron Sky\" . ?e_2 <pred:name> \"Walt Disney Studios Motion Pictures\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4324",
    "input_seq": "What is the scope of Anne Hathaway (who won a Broadcast Film Critics Association Award for Best Supporting Actress) as a performer with Catwoman (whose birth name is Selina Kyle)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Catwoman\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Selina Kyle\" . ?e_2 <pred:name> \"Anne Hathaway\" . ?e_3 <winner> ?e_2 . ?e_3 <pred:name> \"Broadcast Film Critics Association Award for Best Supporting Actress\" . ?e_1 <performer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <performer> ; <pred:fact_t> ?e_2 ] <of> ?qpv .  }"
  },
  {
    "qid": "train_4325",
    "input_seq": "Where was the film titled About Schmidt published on 2003-02-27?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"About Schmidt\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2003-02-27\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4326",
    "input_seq": "What is the ISNI assigned to the person who wrote the script for SpongeBob SquarePants?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"SpongeBob SquarePants\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4327",
    "input_seq": "What is Elizabeth Banks (the one that has the occupation of actor)'s relation with Jewish people ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Elizabeth Banks\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"actor\" . ?e_2 <pred:name> \"Jewish people\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4328",
    "input_seq": "Was Raj Kapoor's child born after 1912?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <child> ?e . ?e_1 <pred:name> \"Raj Kapoor\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1912 ) .  }"
  },
  {
    "qid": "train_4329",
    "input_seq": "How many popular famous musicians are KRS-One?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"popular music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"KRS-One\" .   }"
  },
  {
    "qid": "train_4330",
    "input_seq": "How is St. Louis County (official website http://www.stlouisco.com) related to Madison County (bordering St. Louis)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"St. Louis County\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.stlouisco.com\" . ?e_2 <pred:name> \"Madison County\" . ?e_2 <shares_border_with> ?e_3 . ?e_3 <pred:name> \"St. Louis\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4331",
    "input_seq": "Does To Kill a Mockingbird (the one that was nominated for Academy Award for Best Writing, Adapted Screenplay), have a publication date after 2005?",
    "target_seq": "ASK { ?e <pred:name> \"To Kill a Mockingbird\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2005 ) .  }"
  },
  {
    "qid": "train_4332",
    "input_seq": "What is the connection between Jefferson County (the one that has the captital Steubenville) to Thomas Jefferson (the one that hold the position United States Secretary of State)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jefferson County\" . ?e_1 <capital> ?e_3 . ?e_3 <pred:name> \"Steubenville\" . ?e_2 <pred:name> \"Thomas Jefferson\" . ?e_2 <position_held> ?e_4 . ?e_4 <pred:name> \"United States Secretary of State\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4333",
    "input_seq": "What is the connection between Eurythmics to Sunderland?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Eurythmics\" . ?e_2 <pred:name> \"Sunderland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4334",
    "input_seq": "Which movie made more at the box office, The Bodyguard (the one that was nominated for Golden Raspberry Award for Worst Picture) or The Lion King (the one that received 67th Academy Awards)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Bodyguard\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Golden Raspberry Award for Worst Picture\" .   } UNION { ?e <pred:name> \"The Lion King\" . ?e <award_received> ?e_2 . ?e_2 <pred:name> \"67th Academy Awards\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4335",
    "input_seq": "What is the end time for the officially-named St. Domingo Football Club, the association-football club whose headquarter location is Liverpool (the one that is the residence of John Lennon)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Liverpool\" . ?e_2 <residence> ?e_1 . ?e_2 <pred:name> \"John Lennon\" .  ?e <official_name> ?pv . ?pv <pred:value> \"St. Domingo Football Club\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4336",
    "input_seq": "Which professional role of Carson Daly corresponds to ROME Occupation Code (v3) L1103?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Carson Daly\" .  ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1103\" .  }"
  },
  {
    "qid": "train_4337",
    "input_seq": "How many subscribers are there on Twitter username packers, belonging to the American football team whose official website is http://www.packers.com ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.packers.com\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"packers\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4338",
    "input_seq": "The film titled Alexander was released on 2004-11-16 in what location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Alexander\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2004-11-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4339",
    "input_seq": "When did Hebei become the twinned administrative body of Nagano Prefecture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hebei\" . ?e_2 <pred:name> \"Nagano Prefecture\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4340",
    "input_seq": "How many states are located inside the administrative territorial entity known by a short name of EU?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"administrative territorial entity\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"EU\" .   }"
  },
  {
    "qid": "train_4341",
    "input_seq": "What is the official website of The Fifth Element (the one whose release region is New Zealand) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"The Fifth Element\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"New Zealand\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4342",
    "input_seq": "How many arts festivals are either held in May (the one that is followed by June) or were received by Kim Ki-duk (the one whose ISNI is 0000 0001 0909 9404)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"arts festival\" .  { ?e <month_of_the_year> ?e_1 . ?e_1 <pred:name> \"May\" . ?e_1 <followed_by> ?e_2 . ?e_2 <pred:name> \"June\" .  } UNION { ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Kim Ki-duk\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0909 9404\" .  } }"
  },
  {
    "qid": "train_4343",
    "input_seq": "Of the Texas counties bordering Dallas County (population 2408488), which takes up the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Dallas County\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2408488\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4344",
    "input_seq": "Fatal Attraction has what connection to the BAFTA Award for Best Actor in a Leading Role?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fatal Attraction\" . ?e_2 <pred:name> \"BAFTA Award for Best Actor in a Leading Role\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4345",
    "input_seq": "Which movie is longer, Enron: The Smartest Guys in the Room or Thunder Bay (the one whose director of photography is William H. Daniels)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Enron: The Smartest Guys in the Room\" .  } UNION { ?e <pred:name> \"Thunder Bay\" . ?e <director_of_photography> ?e_1 . ?e_1 <pred:name> \"William H. Daniels\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4346",
    "input_seq": "Which has a larger population, Hanover (the one whose country is United States of America) or Ridgefield?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hanover\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } UNION { ?e <pred:name> \"Ridgefield\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4347",
    "input_seq": "ISNI 0000 0001 2133 6898 corresponds to whose father?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <father> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2133 6898\" .   }"
  },
  {
    "qid": "train_4348",
    "input_seq": "Which has more seasons, Fantastic Four with 13 episodes or 21 Jump Street with 103 episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fantastic Four\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13\"^^xsd:double . } UNION { ?e <pred:name> \"21 Jump Street\" . ?e <number_of_episodes> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"103\"^^xsd:double . } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4349",
    "input_seq": "When was a Ninotschka visual artwork published ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Ninotchka\" . ?e <publication_date> ?pv .  }"
  }
]