[
  {
    "qid": "train_2457",
    "input_seq": "How many literary works contain a narrative location which is a city in the US whose official English-language website is http://www.ci.miami.fl.us/cms/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.ci.miami.fl.us/cms/\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .   }"
  },
  {
    "qid": "train_2458",
    "input_seq": "Does the film director George Stevens have an ISNI of 0000 0003 8334 9322?",
    "target_seq": "ASK { ?e <pred:name> \"George Stevens\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"film director\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 8334 9322\" .  }"
  },
  {
    "qid": "train_2459",
    "input_seq": "What is the official website of the 78th Academy Awards ceremony ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <edition_number> ?pv_1 . ?pv_1 <pred:value> \"78\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2460",
    "input_seq": "Was the activity whose Nintendo GameID is S6BX4Q published before 2019?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"S6BX4Q\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2019 ) .  }"
  },
  {
    "qid": "train_2461",
    "input_seq": "Which one is lighter, zinc or selenium ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"zinc\" .  } UNION { ?e <pred:name> \"selenium\" .  } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2462",
    "input_seq": "How many followers have the person whose ISNI is 0000 0000 7981 2079 in his Twitter username fatbellybella?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7981 2079\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"fatbellybella\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2463",
    "input_seq": "Which movie is longer, Mission: Impossible III or A Fish Called Wanda?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mission: Impossible III\" .  } UNION { ?e <pred:name> \"A Fish Called Wanda\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2464",
    "input_seq": "What is the number of television stations that use the English language?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television station\" . ?e <language_used> ?e_1 . ?e_1 <pred:name> \"English\" .   }"
  },
  {
    "qid": "train_2465",
    "input_seq": "The demonym Čechoslovačka corresponds to which part of the sovereign state that the Czech Republic replaced?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <replaced_by> ?e_1 . ?e_1 <pred:name> \"Czech Republic\" .  ?e <demonym> ?pv . ?pv <pred:value> \"Čechoslovačka\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_2466",
    "input_seq": "Who weighs less, Keith Allen (the one that is the citizen of Canada) or Joe Jackson (the one whose height is 75 inch)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Keith Allen\" . ?e <country_of_citizenship> ?e_1 . ?e_1 <pred:name> \"Canada\" . } UNION { ?e <pred:name> \"Joe Jackson\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"inch\" . ?pv_1 <pred:value> \"75\"^^xsd:double . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2467",
    "input_seq": "What is the subject of this statement: Titanic (the one that received Academy Award for Best Writing, Original Screenplay) received Academy Award for Best Writing, Original Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Titanic\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Writing, Original Screenplay\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Original Screenplay\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2468",
    "input_seq": "What animated series received the award that Diane Sawyer (the winner is 20th Television) received?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <award_received> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"award\" . ?e_2 <award_received> ?e_1 . ?e_2 <pred:name> \"Diane Sawyer\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <winner> ?qpv . ?qpv <pred:value> \"20th Television\" .  }"
  },
  {
    "qid": "train_2469",
    "input_seq": "For what work was Philip Pullman awarded the Guardian Children's Fiction Prize?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Philip Pullman\" . ?e_2 <pred:name> \"Guardian Children's Fiction Prize\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_2470",
    "input_seq": "What is the relationship between Wayne Dyer (the one whose mass is 75 kilogram) and Hednesford Town F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wayne Dyer\" . ?e_1 <mass> ?pv . ?pv <pred:unit> \"kilogram\" . ?pv <pred:value> \"75\"^^xsd:double . ?e_2 <pred:name> \"Hednesford Town F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2471",
    "input_seq": "Does Monroe County, population 168,436, occupy more than 5,800,000 square kilometres ?",
    "target_seq": "ASK { ?e <pred:name> \"Monroe County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"168436\"^^xsd:double . ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"5800000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2473",
    "input_seq": "What is Leicestershire's official website?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Leicestershire\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2474",
    "input_seq": "What is Lesotho's diplomatic relationship with Taiwan?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lesotho\" . ?e_2 <pred:name> \"Taiwan\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2475",
    "input_seq": "What is the area of the historic England county that is the narrative location of Never Let Me Go that uses English?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historic county of England\" . ?e_1 <narrative_location> ?e . ?e_1 <pred:name> \"Never Let Me Go\" . ?e_1 <language_of_work_or_name> ?e_2 . ?e_2 <pred:name> \"English\" .  ?e <area> ?pv .  }"
  },
  {
    "qid": "train_2476",
    "input_seq": "Among the high schools whose students number is not equal to 9300,which one has the largest number of students ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"9300\"^^xsd:double ) . ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2477",
    "input_seq": "Does Hamlet (the one that has Maximilian Schell as a cast member), have a title equal to Три мушкетёра?",
    "target_seq": "ASK { ?e <pred:name> \"Hamlet\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Maximilian Schell\" .  ?e <title> ?pv . ?pv <pred:value> \"Три мушкетёра\" .  }"
  },
  {
    "qid": "train_2478",
    "input_seq": "Which one has fewer episodes, The Twilight Zone (the one that is originally aired on UPN) or General Hospital ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Twilight Zone\" . ?e <original_network> ?e_1 . ?e_1 <pred:name> \"UPN\" .   } UNION { ?e <pred:name> \"General Hospital\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2479",
    "input_seq": "Does the person whose CANTIC-ID is a11024203 have the Deutsche Synchronkartei actor-ID 769 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11024203\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv . ?pv <pred:value> \"769\" .  }"
  },
  {
    "qid": "train_2480",
    "input_seq": "What is the ISNI of the person who won the Japan Academy Prize for Picture of the Year (the award-winning work of this statement is Crest of Betrayal)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Japan Academy Prize for Picture of the Year\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"Crest of Betrayal\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2481",
    "input_seq": "Is John Ray Grisham, Jr the birth name of John Grisham?",
    "target_seq": "ASK { ?e <pred:name> \"John Grisham\" . ?e <birth_name> ?pv . ?pv <pred:value> \"John Ray Grisham, Jr.\" .  }"
  },
  {
    "qid": "train_2482",
    "input_seq": "Is Southampton Football Club the official name of the association football club with the Giphy username of southamptonfc?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"southamptonfc\" . ?e <official_name> ?pv . ?pv <pred:value> \"Southampton Football Club\" .  }"
  },
  {
    "qid": "train_2483",
    "input_seq": "Does the Munzinger IBA of 00000020112 pertain to Frank Zappa?",
    "target_seq": "ASK { ?e <pred:name> \"Frank Zappa\" . ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000020112\" .  }"
  },
  {
    "qid": "train_2484",
    "input_seq": "When was the music genre with the subreddit idm created?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music genre\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"idm\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2485",
    "input_seq": "Does the TV network that first aired Robot Chicken go by thetimmcgraw on Twitter?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television network\" . ?e_1 <original_network> ?e . ?e_1 <pred:name> \"Robot Chicken\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"thetimmcgraw\" .  }"
  },
  {
    "qid": "train_2486",
    "input_seq": "Tell me the city with the larger area , Greater St. Louis or New York metropolitan area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Greater St. Louis\" .  } UNION { ?e <pred:name> \"New York metropolitan area\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2487",
    "input_seq": "Which animated feature film from the ones that are collected in Museum of Modern Art is the shortest ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <collection> ?e_1 . ?e_1 <pred:name> \"Museum of Modern Art\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2488",
    "input_seq": "What is the official website of the Washington county with Dewey Decimal Classification 2--79777?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79777\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2489",
    "input_seq": "Of English-language democracies, which has the lowest real GDP rate of growth?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <language_used> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <real_gross_domestic_product_growth_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2490",
    "input_seq": "Which has a greater elevation above sea level, Agra or Odense?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Agra\" .  } UNION { ?e <pred:name> \"Odense\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2491",
    "input_seq": "How many subscribers does Pittsburg Pirates register on its Twitter username Pirates ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pittsburgh Pirates\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Pirates\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2492",
    "input_seq": "What is the time point of its population of 3577032, for the Netherlands province whose detail map is Prov-Zuid-Holland-OpenTopo.jpg?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of the Netherlands\" . ?e <detail_map> ?pv_1 . ?pv_1 <pred:value> \"Prov-Zuid-Holland-OpenTopo.jpg\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3577032\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2493",
    "input_seq": "Which area is larger in size, Burlington (the one whose elevation (above sea level) is 74 metre) or Valencia (the one whose demonym is valenciana (o valentina))?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Burlington\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"74\"^^xsd:double . } UNION { ?e <pred:name> \"Valencia\" . ?e <demonym> ?pv_2 . ?pv_2 <pred:value> \"valenciana (o valentina)\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2494",
    "input_seq": "How are the Philadelphia Flyers related to defenceman Keith Allen?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Philadelphia Flyers\" . ?e_2 <pred:name> \"Keith Allen\" . ?e_2 <position_played_on_team_/_speciality> ?e_3 . ?e_3 <pred:name> \"defenceman\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2495",
    "input_seq": "Which film received an Academy Award for Best Costume Design (for the winner Lindy Hemming)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Costume Design\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <winner> ?qpv . ?qpv <pred:value> \"Lindy Hemming\" .  }"
  },
  {
    "qid": "train_2496",
    "input_seq": "How is Dilip Kumar related to Hindi?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dilip Kumar\" . ?e_2 <pred:name> \"Hindi\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2497",
    "input_seq": "What was the work that Goldie Hawn received Academy Award for Best Supporting Actress for about?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Goldie Hawn\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actress\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2498",
    "input_seq": "Who has fewer children, H.H. Asquith or Kajol?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"H. H. Asquith\" .  } UNION { ?e <pred:name> \"Kajol\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2499",
    "input_seq": "Tell me the number of films that have a publication date before 1915 or have Michael Shamber as an executive producer.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1915 ) .  } UNION { ?e <executive_producer> ?e_1 . ?e_1 <pred:name> \"Michael Shamberg\" .  } }"
  },
  {
    "qid": "train_2500",
    "input_seq": "How is manganese related to magnesium ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"manganese\" . ?e_2 <pred:name> \"magnesium\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2501",
    "input_seq": "Which movie cost more to make, The Invention of Lying or Moneyball?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Invention of Lying\" .  } UNION { ?e <pred:name> \"Moneyball\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2502",
    "input_seq": "The official website http://www.stern.nyu.edu/ belongs to how many schools of business?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business school\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.stern.nyu.edu/\" .  }"
  },
  {
    "qid": "train_2503",
    "input_seq": "Among states that have a population count higher than 13,000,000, which has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"13000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2504",
    "input_seq": "Which has the lowest elevation above sea level among the New Jersey cities with a population less than 58000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"58000\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2505",
    "input_seq": "What is the connection between Alexandria (the one whose local dialing code is 571) to Dundee?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alexandria\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"571\" . ?e_2 <pred:name> \"Dundee\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2506",
    "input_seq": "When was the formal opening of the crematory where Rudyard Kipling is buried?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e_1 <place_of_burial> ?e . ?e_1 <pred:name> \"Rudyard Kipling\" .  ?e <date_of_official_opening> ?pv .  }"
  },
  {
    "qid": "train_2507",
    "input_seq": "Was a written work, whose OCLC control number is 817288147, published after 1988 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"817288147\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1988 ) .  }"
  },
  {
    "qid": "train_2508",
    "input_seq": "When was born Bruce Campbell (the member of the Conservative Party)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bruce Campbell\" . ?e <member_of_political_party> ?e_1 . ?e_1 <pred:name> \"Conservative Party\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2509",
    "input_seq": "Does the University of Adelaide or Hebrew University of Jerusalem have the larger student enrollment?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"University of Adelaide\" .  } UNION { ?e <pred:name> \"Hebrew University of Jerusalem\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2510",
    "input_seq": "What is the runtime of True Lies?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"True Lies\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_2511",
    "input_seq": "Was the written work designated by OCLC control number 248628819 published prior to 2003?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"248628819\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2003 ) .  }"
  },
  {
    "qid": "train_2512",
    "input_seq": "Which TV series set in Los Angeles is based on Crash, a BAFTA nominee for Best Actress in a Supporting Role?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Los Angeles\" .  ?e_2 <derivative_work> ?e . ?e_2 <pred:name> \"Crash\" . ?e_2 <nominated_for> ?e_3 . ?e_3 <pred:name> \"BAFTA Award for Best Actress in a Supporting Role\" .  }"
  },
  {
    "qid": "train_2513",
    "input_seq": "Which is shorter, Bad Teacher released in Lithuania, or The Alamo which ran for 192 minutes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bad Teacher\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Lithuania\" . } UNION { ?e <pred:name> \"The Alamo\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"192\"^^xsd:double . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2514",
    "input_seq": "When was Sialkot first situated in Punjab, which is in the British Raj?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Sialkot\" . ?e_2 <pred:name> \"Punjab\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_3 . ?e_3 <pred:name> \"British Raj\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2515",
    "input_seq": "Which French region with a population exceeding 8700 has the most weddings per year?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"8700\"^^xsd:double ) . ?e <annual_number_of_weddings> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2516",
    "input_seq": "What is the location of the diplomatic mission of Germany's diplomatic relation with Oman?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Germany\" . ?e_2 <pred:name> \"Oman\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <diplomatic_mission_sent> ?qpv .  }"
  },
  {
    "qid": "train_2517",
    "input_seq": "What is the character role of John Noble (who received the 10th Screen Actors Guild Award) as a cast member in The Lord of the Rings: The Two Towers (that was nominated for an Academy Award for Best Production Design)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Lord of the Rings: The Two Towers\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Production Design\" . ?e_2 <pred:name> \"John Noble\" . ?e_2 <award_received> ?e_4 . ?e_4 <pred:name> \"10th Screen Actors Guild Awards\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2518",
    "input_seq": "Which person with ISNI 0000 0000 7875 4970 was born in Luton?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7875 4970\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Luton\" .  }"
  },
  {
    "qid": "train_2519",
    "input_seq": "How many US colleges and universities are headquartered in Lexington, with the native label Lexington?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"colleges and universities in the United States\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Lexington\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"Lexington\" .   }"
  },
  {
    "qid": "train_2520",
    "input_seq": "What is the ISNI of the human whose native language name is উৎপল দত্ত?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"উৎপল দত্ত\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2521",
    "input_seq": "Which area is smaller, St. Joseph (the one whose postal code is 49091) or Newburyport?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"St. Joseph\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"49091\" . } UNION { ?e <pred:name> \"Newburyport\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2522",
    "input_seq": "How many films are a part of Die Hard published in 1988 or originally aired on HBO?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" .  { ?e_1 <has_part> ?e . ?e_1 <pred:name> \"Die Hard\" . ?e_1 <publication_date> ?pv . ?pv <pred:year> 1988 .  } UNION { ?e <original_network> ?e_1 . ?e_1 <pred:name> \"HBO\" .  } }"
  },
  {
    "qid": "train_2523",
    "input_seq": "Who reviewed Haiti national football team at 38th rank?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Haiti national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"38\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <review_score_by> ?qpv .  }"
  },
  {
    "qid": "train_2524",
    "input_seq": "Who has an ISNI of 0000 0001 1494 6663 and received an award at the 12th Screen Actors Guild Awards?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1494 6663\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"12th Screen Actors Guild Awards\" .  }"
  },
  {
    "qid": "train_2525",
    "input_seq": "Is Gordon Matthew Thomas Sumner the birth name of the person whose genre is vocal music?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"vocal music\" .  ?e <birth_name> ?pv . ?pv <pred:value> \"Gordon Matthew Thomas Sumner\" .  }"
  },
  {
    "qid": "train_2526",
    "input_seq": "What is the episode count of the TV series with the official website www.netflix.com/title/80185171?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.netflix.com/title/80185171\" . ?e <number_of_episodes> ?pv .  }"
  },
  {
    "qid": "train_2527",
    "input_seq": "Which has the higher male population, Haryana, which uses Hindi as the official language, or Karnataka?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Haryana\" . ?e <official_language> ?e_1 . ?e_1 <pred:name> \"Hindi\" .   } UNION { ?e <pred:name> \"Karnataka\" .  } ?e <male_population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2528",
    "input_seq": "For Glottolog code afro1256 and inception time -7000, what is its language family?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language family\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"afro1256\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> -7000 .  }"
  },
  {
    "qid": "train_2529",
    "input_seq": "When did Bruce Lee begin his education at the University of Washington?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bruce Lee\" . ?e_2 <pred:name> \"University of Washington\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2531",
    "input_seq": "How many manifestations have OCLC control number 289946?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"289946\" .  }"
  },
  {
    "qid": "train_2532",
    "input_seq": "Which of the provinces of Canada whose population is greater than 3.8 has the largest in area",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Canada\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"3.8\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2533",
    "input_seq": "What is the official website of the spouse of Carmen Electra (the end time of this statement is 2007)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <spouse> ?e . ?e_1 <pred:name> \"Carmen Electra\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e ] <end_time> ?qpv . ?qpv <pred:year> 2007 . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2534",
    "input_seq": "What is the connection between Searching for Debra Winger to Julianna Margulies?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Searching for Debra Winger\" . ?e_2 <pred:name> \"Julianna Margulies\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2535",
    "input_seq": "Which one has less Erdős number between Linus Pauling or Ernest Rutherford?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Linus Pauling\" .  } UNION { ?e <pred:name> \"Ernest Rutherford\" .  } ?e <Erdős_number> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2536",
    "input_seq": "What is the connection between free jazz to Carlos Santana (the one that plays the instrument guitar)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"free jazz\" . ?e_2 <pred:name> \"Carlos Santana\" . ?e_2 <instrument> ?e_3 . ?e_3 <pred:name> \"guitar\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2537",
    "input_seq": "How many regions of France are there whose country is the republic that is headed by Member of Congress?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"republic\" . ?e_1 <office_held_by_head_of_government> ?e_2 . ?e_2 <pred:name> \"Member of Congress\" .   }"
  },
  {
    "qid": "train_2538",
    "input_seq": "What film's script is written by Rick Berman?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Rick Berman\" .   }"
  },
  {
    "qid": "train_2539",
    "input_seq": "Is जलंधर the native name of the medal whose quantity is not 3500?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <quantity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"3500\"^^xsd:double ) . ?e <native_label> ?pv . ?pv <pred:value> \"जलंधर\" .  }"
  }
]