[
  {
    "qid": "train_2293",
    "input_seq": "What person is a member of the association football club whose Twitter username is ecbahia_oficial (the number of points of this statement is 0)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"association football club\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"ecbahia_oficial\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <number_of_points/goals/set_scored> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0\"^^xsd:double .  }"
  },
  {
    "qid": "train_2294",
    "input_seq": "What is the name of the city of the United States where resides at the person whose ISNI is 0000 0000 1621 6632?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <residence> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 1621 6632\" .   }"
  },
  {
    "qid": "train_2295",
    "input_seq": "How many Massachusetts counties are there whose capital is the United States city that shares a border with Berkeley (whose native name is Berkeley)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" . ?e <capital> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <shares_border_with> ?e_2 . ?e_2 <pred:name> \"Berkeley\" . ?e_2 <native_label> ?pv . ?pv <pred:value> \"Berkeley\" .   }"
  },
  {
    "qid": "train_2296",
    "input_seq": "Does the title Thunder Bay belongs to Night at the Museum: Battle of the Smithsonian originated from Canada?",
    "target_seq": "ASK { ?e <pred:name> \"Night at the Museum: Battle of the Smithsonian\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Canada\" .  ?e <title> ?pv . ?pv <pred:value> \"Thunder Bay\" .  }"
  },
  {
    "qid": "train_2297",
    "input_seq": "How many Golden Raspberry Awards there are in the United States of America and realized after 1994?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Golden Raspberry Awards\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1994 ) .  }"
  },
  {
    "qid": "train_2298",
    "input_seq": "Is the release date of the visual artwork whose title is Rang De Basanti and release region is Germany after the year 2002?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Rang De Basanti\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2002 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_2299",
    "input_seq": "Of Irish counties in Ireland, population 4489544, which occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ireland\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Ireland\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4489544\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2300",
    "input_seq": "What higher learning institution is the educational site of the person whose ISNI is 0000 0001 1450 8081?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <educated_at> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1450 8081\" .   }"
  },
  {
    "qid": "train_2301",
    "input_seq": "Which area is larger, Murfreesboro or Chicago (the one that is the capital of Cook County)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Murfreesboro\" .  } UNION { ?e <pred:name> \"Chicago\" . ?e_1 <capital> ?e . ?e_1 <pred:name> \"Cook County\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2302",
    "input_seq": "Where was TV series, with Terry O'Quinn as a voice actor, that finished on 15th Nov 2013, published ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Terry O'Quinn\" .  ?e <end_time> ?pv . ?pv <pred:date> \"2013-11-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <end_time> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2303",
    "input_seq": "What is the link between pork and L-alanine?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"pork\" . ?e_2 <pred:name> \"L-alanine\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2304",
    "input_seq": "What is the umber of episodes in TV series with Twitter username ThomasFriends (the subscription number of this statement is 15947)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"ThomasFriends\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"15947\"^^xsd:double . ?e <number_of_episodes> ?pv .  }"
  },
  {
    "qid": "train_2305",
    "input_seq": "Tell me the one that has the least duration within the studio album that has a duration over 4300 seconds.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"studio album\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"second\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"4300\"^^xsd:double ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2306",
    "input_seq": "Is the Indian rupee or the Japanese yen valued higher?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Indian rupee\" .  } UNION { ?e <pred:name> \"Japanese yen\" .  } ?e <price> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2307",
    "input_seq": "Who is the person born after 1875 and whose ISNI is 0000 0001 0908 2602?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1875 ) . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0908 2602\" .  }"
  },
  {
    "qid": "train_2308",
    "input_seq": "What is the subject of the statement that the United States of America has a diplomatic relationship with Monaco?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Monaco\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2309",
    "input_seq": "Is more than 6.1 months the duration of the television series Recount?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Recount\" . ?e <duration> ?pv . ?pv <pred:unit> \"month\" . ?pv <pred:value> ?v . FILTER ( ?v > \"6.1\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2310",
    "input_seq": "When did the person who was nominated for the MTV Movie Award for Best Fight in 2004 have a net worth of $140000000USD?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"MTV Movie Award for Best Fight\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:year> 2004 . ?e <net_worth> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"140000000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <net_worth> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2311",
    "input_seq": "How many actors share the job of Ernest Borgnine or practice in the performing arts field?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" .  { ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Ernest Borgnine\" .  } UNION { ?e <field_of_this_occupation> ?e_1 . ?e_1 <pred:name> \"performing arts\" .  } }"
  },
  {
    "qid": "train_2312",
    "input_seq": "What is the connection between the film Election whose release region is Spain and Switzerland?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Election\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Spain\" . ?e_2 <pred:name> \"Switzerland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2313",
    "input_seq": "Which one is longer, Nixon or Forrest Gump (the one that was nominated for Academy Award for Best Sound Mixing)",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nixon\" .  } UNION { ?e <pred:name> \"Forrest Gump\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Sound Mixing\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2314",
    "input_seq": "Which has the smallest area among the unitary states that are a member of the Council of Europe?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"unitary state\" . ?e <member_of> ?e_1 . ?e_1 <pred:name> \"Council of Europe\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2315",
    "input_seq": "Which rock band is popularly associated with free jazz?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"free jazz\" .   }"
  },
  {
    "qid": "train_2316",
    "input_seq": "Which has the shortest duration, Celebrity or Scream 2?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Celebrity\" .  } UNION { ?e <pred:name> \"Scream 2\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2317",
    "input_seq": "Is mediatopic/20000929 the IPTC Newscode for fenci?",
    "target_seq": "ASK { ?e <pred:name> \"fenci\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000929\" .  }"
  },
  {
    "qid": "train_2318",
    "input_seq": "What is the connection between David Arnold (the one that is an employee of University of Warwick) to University of Warwick?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"David Arnold\" . ?e_1 <employer> ?e_3 . ?e_3 <pred:name> \"University of Warwick\" . ?e_2 <pred:name> \"University of Warwick\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2319",
    "input_seq": "How many television films mainly feature World War II or have title The Lorax?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" .  { ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"World War II\" .  } UNION { ?e <title> ?pv . ?pv <pred:value> \"The Lorax\" .  } }"
  },
  {
    "qid": "train_2320",
    "input_seq": "What was Ben Burtt's role as a voice actor in WALL E?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"WALL·E\" . ?e_2 <pred:name> \"Ben Burtt\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2321",
    "input_seq": "For Wreck-It Ralph (the character role of this statement is Tapper), what is the native-language name for the person who is a voice actor?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Wreck-It Ralph\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Tapper\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_2322",
    "input_seq": "What country has the NUTS code of RO?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <NUTS_code> ?pv . ?pv <pred:value> \"RO\" .   }"
  },
  {
    "qid": "train_2323",
    "input_seq": "When did Dwyane Wade leave the Miami Heat?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dwyane Wade\" . ?e_2 <pred:name> \"Miami Heat\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2324",
    "input_seq": "Which area is bigger, Linn County (the one whose area is 5983 square kilometre) or Columbia County (the one whose population is 49351)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Linn County\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"5983\"^^xsd:double . } UNION { ?e <pred:name> \"Columbia County\" . ?e <population> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"49351\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2325",
    "input_seq": "How many cemeteries have area not 65 acres?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <area> ?pv . ?pv <pred:unit> \"acre\" . ?pv <pred:value> ?v . FILTER ( ?v != \"65\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2326",
    "input_seq": "Did the US city that's Cache County's capital have over 4.0 population in 1870?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <capital> ?e . ?e_1 <pred:name> \"Cache County\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"4.0\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 1870 .  }"
  },
  {
    "qid": "train_2327",
    "input_seq": "Which movie is shorter, Into the Storm (the one whose duration is 100 minute) or Pittsburgh (the one whose duration is 91 minute)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Into the Storm\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"100\"^^xsd:double . } UNION { ?e <pred:name> \"Pittsburgh\" . ?e <duration> ?pv_2 . ?pv_2 <pred:unit> \"minute\" . ?pv_2 <pred:value> \"91\"^^xsd:double . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2328",
    "input_seq": "Tell me the one that has more members, Communist Party of China or Communist Party of the Soviet Union",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Communist Party of China\" .  } UNION { ?e <pred:name> \"Communist Party of the Soviet Union\" .  } ?e <member_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2329",
    "input_seq": "How many television programs have Carl Davis as a composer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television program\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Carl Davis\" .   }"
  },
  {
    "qid": "train_2330",
    "input_seq": "What is the relationship between dark ambient and Aphex Twin?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"dark ambient\" . ?e_2 <pred:name> \"Aphex Twin\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2331",
    "input_seq": "When did Algiers (the one whose inception time is 944) have a population of 2364230?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Algiers\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 944 . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2364230\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2333",
    "input_seq": "Is https://engineering.stackexchange.com/tags/mechanical-engineering the Stack Exchange tag of the engineering that is the industry that General Electric?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"engineering\" . ?e_1 <industry> ?e . ?e_1 <pred:name> \"General Electric\" .  ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://engineering.stackexchange.com/tags/mechanical-engineering\" .  }"
  },
  {
    "qid": "train_2334",
    "input_seq": "Which one is taller, Chuck Norris (working as a screenwriter) or Jackie Chan?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chuck Norris\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"screenwriter\" .   } UNION { ?e <pred:name> \"Jackie Chan\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2335",
    "input_seq": "What's the Cologne phonetic code for a male name whose Caverphone is R11111 ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"male given name\" . ?e <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"R11111\" . ?e <Cologne_phonetics> ?pv .  }"
  },
  {
    "qid": "train_2336",
    "input_seq": "When was the person with the official website http://www.kevinmichaelrichardson.com/ born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.kevinmichaelrichardson.com/\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2337",
    "input_seq": "What language is the website  http://www.hamptonu.edu in, the official website of an university where Wanda Sykes studied?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Wanda Sykes\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hamptonu.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2338",
    "input_seq": "What is the official website of National Treasure: Book of Secrets?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"National Treasure: Book of Secrets\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2339",
    "input_seq": "What is the date birth of the voice actor for the human in The Transformers?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"The Transformers\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2340",
    "input_seq": "Which one's elevation is greater above sea level, Essen or The Hague?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Essen\" .  } UNION { ?e <pred:name> \"The Hague\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2341",
    "input_seq": "For Shelby County (the one whose population is 44371), what language is associated with this creative work for its official website of http://www.co.shelby.in.us?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Shelby County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"44371\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.shelby.in.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2342",
    "input_seq": "Is the postal code of Viborg FF 92697?",
    "target_seq": "ASK { ?e <pred:name> \"Viborg FF\" . ?e <postal_code> ?pv . ?pv <pred:value> \"92697\" .  }"
  },
  {
    "qid": "train_2343",
    "input_seq": "What is the official name of the city in the US that has the official website at http://www.cityofboise.org/ (the language of this statement is English)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofboise.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <official_name> ?pv .  }"
  },
  {
    "qid": "train_2344",
    "input_seq": "How many liberal arts college in the United States that has the significant event happened in Wheaton College?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"liberal arts college in the United States\" . ?e <significant_event> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"academic discipline\" . ?e_2 <significant_event> ?e_1 . ?e_2 <pred:name> \"Wheaton College\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <significant_event> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1860 .   }"
  },
  {
    "qid": "train_2345",
    "input_seq": "How is the Walt Disney Studios Motion Pictures production of The Little Mermaid related to The Little Mermaid published in 1989?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Little Mermaid\" . ?e_1 <production_company> ?e_3 . ?e_3 <pred:name> \"Walt Disney Studios Motion Pictures\" . ?e_2 <pred:name> \"The Little Mermaid\" . ?e_2 <publication_date> ?pv . ?pv <pred:year> 1989 . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2346",
    "input_seq": "What has Skillet to do with a symphonic metal?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Skillet\" . ?e_2 <pred:name> \"symphonic metal\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2347",
    "input_seq": "When Hoffa was up for an Academy Award for Best Cinematography, which individual was nominated for their work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hoffa\" . ?e_2 <pred:name> \"Academy Award for Best Cinematography\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_2348",
    "input_seq": "Which one, High Noon (the one that was nominated for Academy Award for Best Original Song) or What Dreams May Come, has less duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"High Noon\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Original Song\" .   } UNION { ?e <pred:name> \"What Dreams May Come\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2349",
    "input_seq": "Who is taller, Matt LeBlanc or Arnold Schwarzenegger?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Matt LeBlanc\" .  } UNION { ?e <pred:name> \"Arnold Schwarzenegger\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2350",
    "input_seq": "Does Passaic or East Orange have less population?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Passaic\" .  } UNION { ?e <pred:name> \"East Orange\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2351",
    "input_seq": "Which area has fewer people, Liverpool (the one whose ISO 3166-2 code is GB-LIV) or Stockport (the one whose population is 288700)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Liverpool\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"GB-LIV\" . } UNION { ?e <pred:name> \"Stockport\" . ?e <population> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"288700\"^^xsd:double . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2352",
    "input_seq": "Is http://www.billnelson.com/ the official website for Elmer Bernstein?",
    "target_seq": "ASK { ?e <pred:name> \"Elmer Bernstein\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.billnelson.com/\" .  }"
  },
  {
    "qid": "train_2353",
    "input_seq": "For Mars (the one whose Iconclass notation is 24C13), how many subscribers does the user have for its subreddit of Mars?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mars\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"24C13\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Mars\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2354",
    "input_seq": "When was The-Dream born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"The-Dream\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2355",
    "input_seq": "Is cardinals the Twitter username of Julia Louis-Dreyfus?",
    "target_seq": "ASK { ?e <pred:name> \"Julia Louis-Dreyfus\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"cardinals\" .  }"
  },
  {
    "qid": "train_2356",
    "input_seq": "How many metropolitan boroughs have a population greater than 63000 or have an official website that is http://www.rochdale.gov.uk/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"63000\"^^xsd:double ) .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.rochdale.gov.uk/\" .  } }"
  },
  {
    "qid": "train_2357",
    "input_seq": "What is the connection between The Unbearable Lightness of Being and San Francisco (that is the birthplace of Margaret Cho)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Unbearable Lightness of Being\" . ?e_2 <pred:name> \"San Francisco\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Margaret Cho\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2358",
    "input_seq": "What is the founding date of the band represented online at www.roxymusic.co.uk?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.roxymusic.co.uk\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2359",
    "input_seq": "How many counties in Alabama either have the capital of Montgomery or the population of 20000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Alabama\" .  { ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Montgomery\" .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"20000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_2360",
    "input_seq": "Which Texas county with other than 7900000 inhabitants covers the biggest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"7900000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2361",
    "input_seq": "Does the person whose date of birth is 1972-11-15 not have 5 children?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1972-11-15\"^^xsd:date . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"5\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2362",
    "input_seq": "Is the title of the silent film Girls the same as Thirteen Days?",
    "target_seq": "ASK { ?e <pred:name> \"Girls\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"silent film\" .  ?e <title> ?pv . ?pv <pred:value> \"Thirteen Days\" .  }"
  },
  {
    "qid": "train_2363",
    "input_seq": "Which US town has postal code 01002?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <postal_code> ?pv . ?pv <pred:value> \"01002\" .  }"
  },
  {
    "qid": "train_2364",
    "input_seq": "Which one is shorter, Can't Stop the Music or Little Miss Sunshine ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Can't Stop the Music\" .  } UNION { ?e <pred:name> \"Little Miss Sunshine\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2365",
    "input_seq": "Of rivers with the watershed area surpassing 220,000 square km, which one has the highest discharge ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <watershed_area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"220000\"^^xsd:double ) . ?e <discharge> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2366",
    "input_seq": "What is the local dialing code in Breda?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Breda\" . ?e <local_dialing_code> ?pv .  }"
  },
  {
    "qid": "train_2367",
    "input_seq": "How many sciences study volcanos or study artificial intelligence?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" .  { ?e_1 <studied_by> ?e . ?e_1 <pred:name> \"volcano\" .  } UNION { ?e <studies> ?e_1 . ?e_1 <pred:name> \"artificial intelligence\" .  } }"
  },
  {
    "qid": "train_2368",
    "input_seq": "Was the National Institute of Dramatic Art founded after 1695?",
    "target_seq": "ASK { ?e <pred:name> \"National Institute of Dramatic Art\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1695 ) .  }"
  },
  {
    "qid": "train_2369",
    "input_seq": "How is the University of Strasbourg related to Strasbourg?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of Strasbourg\" . ?e_2 <pred:name> \"Strasbourg\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2370",
    "input_seq": "Where was the visual artwork that received a Palme d'Or on 2000-01-01 published on 2000-09-28?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Palme d'Or\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2000-01-01\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-09-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2371",
    "input_seq": "When was Howard Hughes nominated for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Howard Hughes\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2373",
    "input_seq": "Which is lengthier, The Stepford Wives (box office of 102000000 USD) or Republic Pictures production of Brazil?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Stepford Wives\" . ?e <box_office> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"102000000\"^^xsd:double . } UNION { ?e <pred:name> \"Brazil\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Republic Pictures\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]