[
  {
    "qid": "train_1462",
    "input_seq": "Which New Jersey county is associated with the official website http://www.co.somerset.nj.us?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.somerset.nj.us\" .  }"
  },
  {
    "qid": "train_1463",
    "input_seq": "Is the shorter work The Philadelphia Story or Rango, with Roger Deakins as director of photography?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Philadelphia Story\" .  } UNION { ?e <pred:name> \"Rango\" . ?e <director_of_photography> ?e_1 . ?e_1 <pred:name> \"Roger Deakins\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1464",
    "input_seq": "How many music genres were created after 1945?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music genre\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1945 ) .  }"
  },
  {
    "qid": "train_1465",
    "input_seq": "How many video games were published after 2008 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2008 ) .  }"
  },
  {
    "qid": "train_1466",
    "input_seq": "What is the Instagram username for National Register of Historic Places ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"National Register of Historic Places\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_1467",
    "input_seq": "Does the person possessing the Deutsche Synchronkartei actor-ID of 18556 have a work period which began later than 1964?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv_1 . ?pv_1 <pred:value> \"18556\" . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1964 ) .  }"
  },
  {
    "qid": "train_1468",
    "input_seq": "Which has more height, Tyler Perry or Eminem?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tyler Perry\" .  } UNION { ?e <pred:name> \"Eminem\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1469",
    "input_seq": "What is the number of heavy metal that got influenced by contemporary classical music and who was incepted in a time other than 1995",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"heavy metal\" . ?e <influenced_by> ?e_1 . ?e_1 <pred:name> \"contemporary classical music\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1995 ) .  }"
  },
  {
    "qid": "train_1470",
    "input_seq": "How many anime pieces use Tamil as the language ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"Tamil\" .   }"
  },
  {
    "qid": "train_1471",
    "input_seq": "How is Australia (the one that is the release region of The Bourne Legacy) related to Kiribati?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Australia\" . ?e_3 <film_release_region> ?e_1 . ?e_3 <pred:name> \"The Bourne Legacy\" . ?e_2 <pred:name> \"Kiribati\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1472",
    "input_seq": "Which rock band was founded by the person whose ISNI is 0000 0001 0907 8435?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <founded_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0907 8435\" .   }"
  },
  {
    "qid": "train_1473",
    "input_seq": "Which one has fewer episodes, Sleepy Hollow (the one whose production company is 20th Century Fox Television) or M*A*S*H ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sleepy Hollow\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"20th Century Fox Television\" .   } UNION { ?e <pred:name> \"M*A*S*H\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1474",
    "input_seq": "What is the character role of Michael Gambon in Harry Potter and the Prisoner of Azkaban (the one that has Timothy Spall as a cast member)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Timothy Spall\" . ?e_2 <pred:name> \"Michael Gambon\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1475",
    "input_seq": "What is the connection between British Columbia Liberal Party to British Columbia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"British Columbia Liberal Party\" . ?e_2 <pred:name> \"British Columbia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1476",
    "input_seq": "What is the number of non-metropolitan districts whose TOID is 7000000000014192?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan district\" . ?e <TOID> ?pv . ?pv <pred:value> \"7000000000014192\" .  }"
  },
  {
    "qid": "train_1477",
    "input_seq": "What is the character role of Pamela Anderson in Borat?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Borat\" . ?e_2 <pred:name> \"Pamela Anderson\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1478",
    "input_seq": "Is the Libris-URI of the person with the CANTIC-ID of a11325446 31fhjj7m5b2nth3 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11325446\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"31fhjj7m5b2nth3\" .  }"
  },
  {
    "qid": "train_1479",
    "input_seq": "Which entertainment was published on 2005-11-15?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-11-15\"^^xsd:date .  }"
  },
  {
    "qid": "train_1480",
    "input_seq": "What is the connection between Phoenix (the one that is the birthplace of Jordin Sparks) to Mountain Time Zone?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Phoenix\" . ?e_3 <place_of_birth> ?e_1 . ?e_3 <pred:name> \"Jordin Sparks\" . ?e_2 <pred:name> \"Mountain Time Zone\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1482",
    "input_seq": "How many literary works have the last line \"And grinning broadly at the look of horror on Uncle Vernon's face, Harry set off towards the station exit, Hedwig rattling along in front of him, for what looked like a much better summer than the last\"?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e <last_line> ?pv . ?pv <pred:value> \"And grinning broadly at the look of horror on Uncle Vernon's face, Harry set off towards the station exit, Hedwig rattling along in front of him, for what looked like a much better summer than the last.\" .  }"
  },
  {
    "qid": "train_1483",
    "input_seq": "Is the US city Scottsdale's dialing code 514?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Scottsdale\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"514\" .  }"
  },
  {
    "qid": "train_1484",
    "input_seq": "Which language is used on the website www.goldenglobes.com, representing the Golden Globe Award for Best Animated Feature Film?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Golden Globe Award for Best Animated Feature Film\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.goldenglobes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1485",
    "input_seq": "Is fcbate the Twitter username of Faye Dunaway?",
    "target_seq": "ASK { ?e <pred:name> \"Faye Dunaway\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"fcbate\" .  }"
  },
  {
    "qid": "train_1486",
    "input_seq": "Of Alabama counties with a population different from 480000, which is biggest according to area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Alabama\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"480000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1487",
    "input_seq": "How long is the animated film that was composed by William Hanna?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"William Hanna\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1488",
    "input_seq": "How many crimes distinct from homicide were during the era of the Habsburg Monarchy?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e_1 <different_from> ?e . ?e_1 <pred:name> \"homicide\" .  ?e_2 <time_period> ?e . ?e_2 <pred:name> \"Habsburg Monarchy\" .  }"
  },
  {
    "qid": "train_1489",
    "input_seq": "When did Spinefarm Records become a child organization of Universal Music Group?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Spinefarm Records\" . ?e_2 <pred:name> \"Universal Music Group\" . ?e_1 <parent_organization> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <parent_organization> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1490",
    "input_seq": "Does 2010: The Year We Make Contact or Twister (the one whose publication date is 1989-01-01) have less duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"2010: The Year We Make Contact\" . } UNION { ?e <pred:name> \"Twister\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1989-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1492",
    "input_seq": "Does the film Veronica Mars (whose release date is 2014-03-08) or Rambo (that succeeds Rambo III) have the shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Veronica Mars\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2014-03-08\"^^xsd:date . } UNION { ?e <pred:name> \"Rambo\" . ?e <follows> ?e_1 . ?e_1 <pred:name> \"Rambo III\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1493",
    "input_seq": "What number of Canadian provinces have Toronto as the capital?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Canada\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Toronto\" .   }"
  },
  {
    "qid": "train_1494",
    "input_seq": "What is Russia's diplomatic relationship with Colombia?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Russia\" . ?e_2 <pred:name> \"Colombia\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1495",
    "input_seq": "What is the relationship between Wayne Dyer (the one that has the occupation of actor) and writer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wayne Dyer\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"actor\" . ?e_2 <pred:name> \"writer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1496",
    "input_seq": "How many land-grant universities have a significant event when the academic discipline that is a significant event happened in College of Wooster?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" . ?e <significant_event> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"academic discipline\" . ?e_2 <significant_event> ?e_1 . ?e_2 <pred:name> \"College of Wooster\" .   }"
  },
  {
    "qid": "train_1497",
    "input_seq": "How does Sandy Powell relate to the 71st Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sandy Powell\" . ?e_2 <pred:name> \"71st Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1498",
    "input_seq": "Regarding the person with the CANTIC-ID of a11684628 is his or her pronunciation audio exactly Pl-wołowina.ogg ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11684628\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Pl-wołowina.ogg\" .  }"
  },
  {
    "qid": "train_1499",
    "input_seq": "Is davenavarro6767 the Twitter username of the basketball team that drafted Chris Paul?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" . ?e_1 <drafted_by> ?e . ?e_1 <pred:name> \"Chris Paul\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"davenavarro6767\" .  }"
  },
  {
    "qid": "train_1500",
    "input_seq": "When did Margot Kidder stop being the spouse of John Heard?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Margot Kidder\" . ?e_2 <pred:name> \"John Heard\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_1501",
    "input_seq": "Does Mobile Suit Gundam 00 or Yu-Gi-Oh! GX have more episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mobile Suit Gundam 00\" .  } UNION { ?e <pred:name> \"Yu-Gi-Oh! GX\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1502",
    "input_seq": "When the Sam Raimi scripted film was published on 2007-05-01, what was the location of its release?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Sam Raimi\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2007-05-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1503",
    "input_seq": "What language is associated with the official website http://www.pasadena.edu of the community college whose postal code is 91106-2003?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"community college\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"91106-2003\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.pasadena.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1504",
    "input_seq": "Which has less population, Indore or Saint John whose area is 315.82 square kilometres?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Indore\" . } UNION { ?e <pred:name> \"Saint John\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"315.82\"^^xsd:double . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1505",
    "input_seq": "Does Jim Brown (who is a member of the Cleveland Browns) or Marilyn Monroe (whose Munzinger IBA is 00000005823) weigh less?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jim Brown\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Cleveland Browns\" . } UNION { ?e <pred:name> \"Marilyn Monroe\" . ?e <Munzinger_IBA> ?pv_1 . ?pv_1 <pred:value> \"00000005823\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1506",
    "input_seq": "Which band has official website as http://www.thinlizzy.org/ ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.thinlizzy.org/\" .  }"
  },
  {
    "qid": "train_1507",
    "input_seq": "What is the connection between County Waterford to County Tipperary?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"County Waterford\" . ?e_2 <pred:name> \"County Tipperary\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1508",
    "input_seq": "What is the connection between Hannibal Rising to Rhys Ifans?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hannibal Rising\" . ?e_2 <pred:name> \"Rhys Ifans\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1509",
    "input_seq": "What is the connection between Eternal Sunshine of the Spotless Mind to Mark Ruffalo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Eternal Sunshine of the Spotless Mind\" . ?e_2 <pred:name> \"Mark Ruffalo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1510",
    "input_seq": "What is the connection between Small Soldiers to Ernest Borgnine?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Small Soldiers\" . ?e_2 <pred:name> \"Ernest Borgnine\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1511",
    "input_seq": "How was it determined that the county of Oregon whose official website is http://www.co.marion.or.us has a population of 321397?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.co.marion.or.us\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"321397\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1512",
    "input_seq": "What is the connection between Sprint Corporation to software?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sprint Corporation\" . ?e_2 <pred:name> \"software\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1513",
    "input_seq": "The Life Aquatic with Steve Zissou is connected to Mark Mothersbaugh in what way?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Life Aquatic with Steve Zissou\" . ?e_2 <pred:name> \"Mark Mothersbaugh\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1514",
    "input_seq": "What is the connection between Sean Connery to Scottish National Party?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sean Connery\" . ?e_2 <pred:name> \"Scottish National Party\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1515",
    "input_seq": "Among the regions of France whose population is not equal to 5900, which has the smallest annual number of weddings?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"5900\"^^xsd:double ) . ?e <annual_number_of_weddings> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1516",
    "input_seq": "Was the person whose ISNI is 0000 0001 1613 4343 born after 1973 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1613 4343\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1973 ) .  }"
  },
  {
    "qid": "train_1517",
    "input_seq": "What is the time period that 51st is the ranking of the national association football team whose FIFA country code is ZAM?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <FIFA_country_code> ?pv_1 . ?pv_1 <pred:value> \"ZAM\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"51\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1518",
    "input_seq": "How many departments of France contain Lancaster (the one that contains University of Lancaster), and have an area greater than 27000000 square metres?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"departments of France\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Lancaster\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"University of Lancaster\" .  ?e <area> ?pv . ?pv <pred:unit> \"square metre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"27000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1519",
    "input_seq": "When was the debut show of the 5-season Charlie's Angels ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Charlie's Angels\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5\"^^xsd:double . ?e <date_of_first_performance> ?pv .  }"
  },
  {
    "qid": "train_1520",
    "input_seq": "Who directed Peyton Place (the one that was nominated for Academy Award for Best Cinematography)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"Peyton Place\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Cinematography\" .   }"
  },
  {
    "qid": "train_1521",
    "input_seq": "Where was Garden State published on 2005-05-26?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Garden State\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-05-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1522",
    "input_seq": "Which movie is longer, Casino Royale (the one that has Peter Lorre as a cast member) or The Animatrix?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Casino Royale\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Peter Lorre\" .   } UNION { ?e <pred:name> \"The Animatrix\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1523",
    "input_seq": "What is the area of the US city whose official website is https://somervillema.gov/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://somervillema.gov/\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_1525",
    "input_seq": "Which ones of Dominica and Ecuador has lower amount of total reserves?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dominica\" .  } UNION { ?e <pred:name> \"Ecuador\" .  } ?e <total_reserves> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1526",
    "input_seq": "What is the zip code of San Juan, which occupies 120.193947 square kilometres?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"San Juan\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"120.193947\"^^xsd:double . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_1527",
    "input_seq": "How many awards are named after the songwriter John Waters?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"John Waters\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"songwriter\" .   }"
  },
  {
    "qid": "train_1528",
    "input_seq": "Is the larger area occupied by Valencia, Sacramento's twin administrative body, or by Calgary?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Valencia\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Sacramento\" .   } UNION { ?e <pred:name> \"Calgary\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1529",
    "input_seq": "How many diseases are the cause of 16th SAG award winner Rod Taylor's death or are identified by MeSH Code C17.800.090.500?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" .  { ?e_1 <cause_of_death> ?e . ?e_1 <pred:name> \"Rod Taylor\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"16th Screen Actors Guild Awards\" .  } UNION { ?e <MeSH_Code> ?pv . ?pv <pred:value> \"C17.800.090.500\" .  } }"
  },
  {
    "qid": "train_1530",
    "input_seq": "Tell me the movie with the human that died on 2007-11-26 and was a costume designer.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <costume_designer> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"2007-11-26\"^^xsd:date .   }"
  },
  {
    "qid": "train_1532",
    "input_seq": "Which university has a higher admission rate, McGill University or Stanford University?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"McGill University\" .  } UNION { ?e <pred:name> \"Stanford University\" .  } ?e <admission_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1533",
    "input_seq": "How many short films use a color whose short name is, by abbreviation, b/w ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"short film\" . ?e <color> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"color\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"b/w\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <object_has_role> ?qpv . ?qpv <pred:value> \"abbreviation\" .   }"
  },
  {
    "qid": "train_1534",
    "input_seq": "What is the relationship between Natchez and Central Time Zone?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Natchez\" . ?e_2 <pred:name> \"Central Time Zone\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1535",
    "input_seq": "What is the number of matches played by Taiwo Atieno as a member of the national football team of Kenya?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Taiwo Atieno\" . ?e_2 <pred:name> \"Kenya national football team\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_1536",
    "input_seq": "What is Michael Moriarty's date of birth?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Michael Moriarty\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1537",
    "input_seq": "How is Fullerton connected to the mayor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fullerton\" . ?e_2 <pred:name> \"mayor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1538",
    "input_seq": "On what date was Mamiko Noto born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mamiko Noto\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1539",
    "input_seq": "Which movie is longer, 8 Mile or War of the Worlds?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"8 Mile\" .  } UNION { ?e <pred:name> \"War of the Worlds\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1540",
    "input_seq": "Does Auburn (the one that is headed by councillor) have a population larger than 960000000?",
    "target_seq": "ASK { ?e <pred:name> \"Auburn\" . ?e <office_held_by_head_of_government> ?e_1 . ?e_1 <pred:name> \"councillor\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"960000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1541",
    "input_seq": "What is the official website of the person with the ISNI of 0000 0001 1742 3876?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1742 3876\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1542",
    "input_seq": "What is the publication region for The Twilight Saga: Eclipse whose release date is 2010-07-15?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"The Twilight Saga: Eclipse\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-07-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1543",
    "input_seq": "The population of how many independent cities exceeds 6600000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"6600000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1544",
    "input_seq": "Tell me the number of cemeteries that have the country of the sovereign state that is the country of Westchester County",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <country> ?e_1 . ?e_2 <pred:name> \"Westchester County\" .   }"
  },
  {
    "qid": "train_1545",
    "input_seq": "When was Rocky (the one whose original language is Hindi) published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rocky\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"Hindi\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_1546",
    "input_seq": "What is the official website of the United States Military Academy",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"United States Military Academy\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1547",
    "input_seq": "What is the connection between Montgomery County (the one whose licence plate code is 57) to Dayton?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Montgomery County\" . ?e_1 <licence_plate_code> ?pv . ?pv <pred:value> \"57\" . ?e_2 <pred:name> \"Dayton\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1548",
    "input_seq": "Which has higher elevation above sea level, Santa Cruz or Santa Barbara that was established in 1847?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Santa Cruz\" . } UNION { ?e <pred:name> \"Santa Barbara\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1847 . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1549",
    "input_seq": "Is vs68998d1svc3vd the Libris-URI of John Lee Hooker?",
    "target_seq": "ASK { ?e <pred:name> \"John Lee Hooker\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"vs68998d1svc3vd\" .  }"
  },
  {
    "qid": "train_1550",
    "input_seq": "What position is held by Elizabeth II, who heads the UK?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"United Kingdom\" . ?e_2 <pred:name> \"Elizabeth II\" . ?e_1 <head_of_state> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <head_of_state> ; <pred:fact_t> ?e_2 ] <position_held> ?qpv .  }"
  },
  {
    "qid": "train_1551",
    "input_seq": "Tell me the one that costs less, Star Wars: Episode I – The Phantom Menace or Hook",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Wars: Episode I – The Phantom Menace\" .  } UNION { ?e <pred:name> \"Hook\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  }
]