[
  {
    "qid": "train_3534",
    "input_seq": "When was George Benson (the one whose date of death is 1973-08-17) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"George Benson\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1973-08-17\"^^xsd:date . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3535",
    "input_seq": "Is the time of earliest written record of the city whose demonym is osloenser on 0965-01-17?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"osloenser\" . ?e <time_of_earliest_written_record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }"
  },
  {
    "qid": "train_3536",
    "input_seq": "The sovereign state with a 1.4 percentage inflation rate in 2004 is the home country of what rock band?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"1.4\"^^xsd:double . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2004 .   }"
  },
  {
    "qid": "train_3537",
    "input_seq": "The country of the UK has what cemetery count?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .   }"
  },
  {
    "qid": "train_3538",
    "input_seq": "What is the title of the television series that derives Dark Shadows in Armenia?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e_1 <based_on> ?e . ?e_1 <pred:name> \"Dark Shadows\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"Armenia\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_3539",
    "input_seq": "Which episode of a TV series is designated by production code 271?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <production_code> ?pv . ?pv <pred:value> \"271\" .  }"
  },
  {
    "qid": "train_3540",
    "input_seq": "How many law schools were attended by US Army member William McKinley or founded later than 1888?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"law school\" .  { ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"William McKinley\" . ?e_1 <military_branch> ?e_2 . ?e_2 <pred:name> \"United States Army\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1888 ) .  } }"
  },
  {
    "qid": "train_3541",
    "input_seq": "Which one, Erykah Badu or Alex Kingston, has fewer number of children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Erykah Badu\" .  } UNION { ?e <pred:name> \"Alex Kingston\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3542",
    "input_seq": "Which visual artwork with Billy Zane as a cast member is shortest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Billy Zane\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3544",
    "input_seq": "Was The Nutty Professor (the one whose duration is 75 minute) published before 2010?",
    "target_seq": "ASK { ?e <pred:name> \"The Nutty Professor\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"75\"^^xsd:double . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2010 ) .  }"
  },
  {
    "qid": "train_3545",
    "input_seq": "Which concept is said to be the same as an inner planet with the population over 4500 was recorded on 1st January 1810?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"concept\" . ?e <said_to_be_the_same_as> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"inner planet\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"4500\"^^xsd:double ) . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"1810-01-01\"^^xsd:date .   }"
  },
  {
    "qid": "train_3546",
    "input_seq": "What is the official website of the US town that is the twinned administrative body of Baghdad?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Baghdad\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3547",
    "input_seq": "How is Peter Boyle (ResearcherID A-4380-2014) connected to University of Strathclyde?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peter Boyle\" . ?e_1 <ResearcherID> ?pv . ?pv <pred:value> \"A-4380-2014\" . ?e_2 <pred:name> \"University of Strathclyde\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3548",
    "input_seq": "How many U.S. towns have a population less than 11000000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"11000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3549",
    "input_seq": "When was Ve Neill born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ve Neill\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3550",
    "input_seq": "How is Ben Sahar related to De Graafschap?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ben Sahar\" . ?e_2 <pred:name> \"De Graafschap\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3551",
    "input_seq": "Is the area of the Massachusetts county whose population is 762550 (the estimation process is this statement's determination method) larger than 940 square kilometers?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"762550\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <determination_method> ?qpv . ?qpv <pred:value> \"estimation process\" . ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"940\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3552",
    "input_seq": "Does the film San Francisco (whose production company is Metro-Goldwyn-Mayer) or Mansfield Park have the shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"San Francisco\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Metro-Goldwyn-Mayer\" .   } UNION { ?e <pred:name> \"Mansfield Park\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3553",
    "input_seq": "At what point in time is 295247 the population of the administrative territorial entity whose capital is Munich (having the ISNI 0000 0001 2189 3141)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Munich\" . ?e_1 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2189 3141\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"295247\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3554",
    "input_seq": "Which has the largest real gross domestic product growth rate among the democracies whose out-of-school children number is not 730?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"730\"^^xsd:double ) . ?e <real_gross_domestic_product_growth_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3555",
    "input_seq": "Does Fresno (whose title is Fresno) or Star Trek: Enterprise have more episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fresno\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Fresno\" . } UNION { ?e <pred:name> \"Star Trek: Enterprise\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3556",
    "input_seq": "Which movie is shorter, Arizona (the one whose publication date is 1931-01-01) or Chaplin?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Arizona\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1931-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"Chaplin\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3557",
    "input_seq": "How many forms of popular music were created in 1927 or not in 1997?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"popular music\" .  { ?e <inception> ?pv . ?pv <pred:year> 1927 .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1997 ) .  } }"
  },
  {
    "qid": "train_3558",
    "input_seq": "When did Michael Jackson (the one whose date of birth is 1969-04-12) die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Michael Jackson\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1969-04-12\"^^xsd:date . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_3559",
    "input_seq": "Does Spain or Vanuatu have less mains voltage ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Spain\" .  } UNION { ?e <pred:name> \"Vanuatu\" .  } ?e <mains_voltage> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3560",
    "input_seq": "What is the connection between Ricky Martin to San Juan (the one that is the twinned administrative body of Mexico City)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ricky Martin\" . ?e_2 <pred:name> \"San Juan\" . ?e_2 <twinned_administrative_body> ?e_3 . ?e_3 <pred:name> \"Mexico City\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3561",
    "input_seq": "Is Girl, Interrupted or Husbands and Wives shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Girl, Interrupted\" .  } UNION { ?e <pred:name> \"Husbands and Wives\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3562",
    "input_seq": "What is the connection between the University of Denver and the United Methodist Church?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of Denver\" . ?e_2 <pred:name> \"United Methodist Church\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3563",
    "input_seq": "When was Adolph Zukor born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Adolph Zukor\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3564",
    "input_seq": "What is the postal code of Elsevier's headquarters that is located in Philadelphia (whose population is 1580863)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Elsevier\" . ?e_2 <pred:name> \"Philadelphia\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1580863\"^^xsd:double . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_3565",
    "input_seq": "How many ice hockey clubs are associated with ice hockey or represented by the website lightning.nhl.com?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ice hockey team\" .  { ?e <sport> ?e_1 . ?e_1 <pred:name> \"ice hockey\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://lightning.nhl.com/\" .  } }"
  },
  {
    "qid": "train_3566",
    "input_seq": "About the movie that got nominated for Primetime Emmy Award for outstanding lead actor in a comedy Series, and it was published on 2008-07-17, what is the publishing location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2008-07-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3567",
    "input_seq": "Is the ISO 639-2 code of Afrikaans afr?",
    "target_seq": "ASK { ?e <pred:name> \"Afrikaans\" . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"afr\" .  }"
  },
  {
    "qid": "train_3568",
    "input_seq": "How many anime works have fewer than 8700 episodes?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"8700\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3569",
    "input_seq": "How many basketball teams include a member of the Portland Trail Blazers?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Portland Trail Blazers\" .   }"
  },
  {
    "qid": "train_3570",
    "input_seq": "What character role does Larry Hagman play in Dallas (nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actor in a Drama Series\" . ?e_2 <pred:name> \"Larry Hagman\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3571",
    "input_seq": "How many sovereign states are the story setting of Rock Band 2?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <narrative_location> ?e . ?e_1 <pred:name> \"Rock Band 2\" .   }"
  },
  {
    "qid": "train_3572",
    "input_seq": "What is the connection between Tiny Toon Adventures (the one whose genre is platform game) to platform game?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tiny Toon Adventures\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"platform game\" . ?e_2 <pred:name> \"platform game\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3573",
    "input_seq": "What is the relationship between Portugal to Bangladesh (the one that has a diplomatic relation with Croatia)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Portugal\" . ?e_2 <pred:name> \"Bangladesh\" . ?e_2 <diplomatic_relation> ?e_3 . ?e_3 <pred:name> \"Croatia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3574",
    "input_seq": "Which person was born on 1955-01-07?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1955-01-07\"^^xsd:date .  }"
  },
  {
    "qid": "train_3575",
    "input_seq": "What kind of relation does Suzhou have with the twinned administrative body of Manila known as Shanghai?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Suzhou\" . ?e_2 <pred:name> \"Shanghai\" . ?e_2 <twinned_administrative_body> ?e_3 . ?e_3 <pred:name> \"Manila\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3576",
    "input_seq": "How many subscribers are there for the Twitter username alydenisof belonging to the person who is a cast member in the character role of Willow Rosenberg in Buffy the Vampire Slayer (that has Seth Green as a cast member)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Buffy the Vampire Slayer\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Seth Green\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv_1 . ?qpv_1 <pred:value> \"Willow Rosenberg\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"alydenisof\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3577",
    "input_seq": "Does the calendar month known by the name of мая have a series ordinal of 17?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"calendar month\" . ?e <name> ?pv_1 . ?pv_1 <pred:value> \"мая\" . ?e <series_ordinal> ?pv . ?pv <pred:value> \"17\" .  }"
  },
  {
    "qid": "train_3578",
    "input_seq": "When did DreamWorks Records become the child of parent organization DreamWorks?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"DreamWorks Records\" . ?e_2 <pred:name> \"DreamWorks\" . ?e_1 <parent_organization> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <parent_organization> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3579",
    "input_seq": "The website representing Aspyr, www.aspyr.com, is published in which language?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Aspyr\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.aspyr.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3580",
    "input_seq": "Which association football club whose country is Germany has the Instagram username of tsg1899hoffenheim?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Germany\" .  ?e <Instagram_username> ?pv . ?pv <pred:value> \"tsg1899hoffenheim\" .  }"
  },
  {
    "qid": "train_3581",
    "input_seq": "Which has more cost, The Perks of Being a Wallflower released in South Africa or The Shawshank Redemption?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Perks of Being a Wallflower\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"South Africa\" .   } UNION { ?e <pred:name> \"The Shawshank Redemption\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3582",
    "input_seq": "Which person designated by British Museum person-institution 170412 was born post-1939?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"170412\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:year> ?v . FILTER ( ?v > 1939 ) .  }"
  },
  {
    "qid": "train_3583",
    "input_seq": "How many film festivals have the Twitter username Festival_Cannes or are located in Utah (whose abbreviated name is UT)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film festival\" .  { ?e <Twitter_username> ?pv . ?pv <pred:value> \"Festival_Cannes\" .  } UNION { ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Utah\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"UT\" .  } }"
  },
  {
    "qid": "train_3584",
    "input_seq": "The visual artwork with the title Gaslight was released on 1944-10-30 in which location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Gaslight\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1944-10-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3585",
    "input_seq": "When was Biloxi founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Biloxi\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3586",
    "input_seq": "How many art movements have existentialism as their PhilPapers topic?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <PhilPapers_topic> ?pv . ?pv <pred:value> \"existentialism\" .  }"
  },
  {
    "qid": "train_3588",
    "input_seq": "I would like to know the one that has least elevation (over sea level), Cardiff or Rotterdam (which has a population of 619879)",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cardiff\" . } UNION { ?e <pred:name> \"Rotterdam\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"619879\"^^xsd:double . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3589",
    "input_seq": "How many universities are founders of the agent that has a member named Georgia Institute of Technology starting in the year 2010?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <found> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"agent\" . ?e_2 <member_of> ?e_1 . ?e_2 <pred:name> \"Georgia Institute of Technology\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <member_of> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 2010 .   }"
  },
  {
    "qid": "train_3590",
    "input_seq": "Is Pinellas County or Palm Beach County smaller by area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pinellas County\" .  } UNION { ?e <pred:name> \"Palm Beach County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3591",
    "input_seq": "How is PepsiCo related to the USA?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"PepsiCo\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3592",
    "input_seq": "What is the relationship between Steve Ditko to myocardial infarction?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Steve Ditko\" . ?e_2 <pred:name> \"myocardial infarction\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3593",
    "input_seq": "How was it determined that the population of a city, whose kana name is さっぽろし, counts 1,880,863 people ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <name_in_kana> ?pv_1 . ?pv_1 <pred:value> \"さっぽろし\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1880863\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_3594",
    "input_seq": "What is the connection between Kamloops to Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kamloops\" . ?e_2 <pred:name> \"Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3595",
    "input_seq": "Which cast member of Natural Born Killers was born as Robert John Downey?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Natural Born Killers\" .  ?e <birth_name> ?pv . ?pv <pred:value> \"Robert John Downey\" .  }"
  },
  {
    "qid": "train_3596",
    "input_seq": "Does Victoria (that originates in Germany) or Coming Home (whose release date is 1978-01-01) have the shorter runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Victoria\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Germany\" . } UNION { ?e <pred:name> \"Coming Home\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3597",
    "input_seq": "Which has the most area among the Arizona counties established in 1864?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1864 . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3598",
    "input_seq": "When was Roger Moore whose floruit is 1977 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Roger Moore\" . ?e <floruit> ?pv_1 . ?pv_1 <pred:year> 1977 . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3599",
    "input_seq": "Is http://www.owu.edu/ the official website for Atonement which was nominated for a BAFTA Award for Best Editing?",
    "target_seq": "ASK { ?e <pred:name> \"Atonement\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Editing\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.owu.edu/\" .  }"
  },
  {
    "qid": "train_3600",
    "input_seq": "Which landform less than 4600 meters above sea level is lowest in elevation?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"4600\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3601",
    "input_seq": "Which movie is longer, 21 Jump Street (the one whose release region is Bulgaria) or Stargate?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"21 Jump Street\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Bulgaria\" .   } UNION { ?e <pred:name> \"Stargate\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3602",
    "input_seq": "Is the longer work Fiddler on the Roof or Splash, distributed by Walt Disney Studios Motion Pictures?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fiddler on the Roof\" .  } UNION { ?e <pred:name> \"Splash\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"Walt Disney Studios Motion Pictures\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3603",
    "input_seq": "How many former French regions are named after Gironde or share a border with Belgium?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"former French region\" .  { ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Gironde\" .  } UNION { ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Belgium\" .  } }"
  },
  {
    "qid": "train_3605",
    "input_seq": "What is Dionne Warwick's Twitter username?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dionne Warwick\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_3606",
    "input_seq": "What is the connection between Alan Hale to Washington, D.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alan Hale\" . ?e_2 <pred:name> \"Washington, D.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3607",
    "input_seq": "How is Morgan Freeman related to Greenwood?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Morgan Freeman\" . ?e_2 <pred:name> \"Greenwood\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3608",
    "input_seq": "When did Stratford-upon-Avon become a part of the Kingdom of Great Britain?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Stratford-upon-Avon\" . ?e_2 <pred:name> \"Kingdom of Great Britain\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3609",
    "input_seq": "Does the miniseries starring Iain Glen not have 45 seasons?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Iain Glen\" .  ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"45\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3610",
    "input_seq": "Does the male given name of Larry David have a Cologne phonetic code of 57?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"male given name\" . ?e_1 <given_name> ?e . ?e_1 <pred:name> \"Larry David\" .  ?e <Cologne_phonetics> ?pv . ?pv <pred:value> \"57\" .  }"
  },
  {
    "qid": "train_3611",
    "input_seq": "When did Saint Kitts and Nevis have a nominal GDP of 31514856.3078422 United States dollars?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Saint Kitts and Nevis\" . ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"31514856.3078422\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3612",
    "input_seq": "What is the area o the United States city whose official website is http://www.murfreesborotn.gov/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.murfreesborotn.gov/\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_3613",
    "input_seq": "How many seats were in the First Continential Congress?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"First Continental Congress\" . ?e <number_of_seats> ?pv .  }"
  },
  {
    "qid": "train_3614",
    "input_seq": "Regarding the tv film that got the 60th Golden Globe Awards, tell me when it was published.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"60th Golden Globe Awards\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_3615",
    "input_seq": "Is the ranking of Haiti national football team not equal to 110 in 2013-07-04 ?",
    "target_seq": "ASK { ?e <pred:name> \"Haiti national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"110\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2013-07-04\"^^xsd:date .  }"
  },
  {
    "qid": "train_3616",
    "input_seq": "What is the connection between One Flew Over the Cuckoo's Nest (the one that was nominated for BAFTA Award for Best Film) to One Flew Over the Cuckoo's Nest (the one whose ISBN-10 is 0-451-16396-6)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"One Flew Over the Cuckoo's Nest\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"BAFTA Award for Best Film\" . ?e_2 <pred:name> \"One Flew Over the Cuckoo's Nest\" . ?e_2 <ISBN-10> ?pv . ?pv <pred:value> \"0-451-16396-6\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3617",
    "input_seq": "Does The Sopranos or the 14-episode Planet of the Apes have more episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Sopranos\" . } UNION { ?e <pred:name> \"Planet of the Apes\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"14\"^^xsd:double . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]