[
  {
    "qid": "train_2540",
    "input_seq": "What is the Instagram username of the author who wrote Charlie and the Chocolate Factory?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <author> ?e . ?e_1 <pred:name> \"Charlie and the Chocolate Factory\" . ?e_1 <native_label> ?pv_1 . ?pv_1 <pred:value> \"Charlie and the Chocolate Factory\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_2541",
    "input_seq": "What is the character role of Will Patton in Remember the Titans?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Remember the Titans\" . ?e_2 <pred:name> \"Will Patton\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2542",
    "input_seq": "What is the Twitter username of the business whose IPv4 routing prefix became 143.4.0.0/14 in 1990?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <IPv4_routing_prefix> ?pv_1 . ?pv_1 <pred:value> \"143.4.0.0/14\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4_routing_prefix> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:year> 1990 . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_2543",
    "input_seq": "What is the connection between Lebanese American to New York (the one whose ISNI is 0000 0001 2179 6907)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lebanese American\" . ?e_2 <pred:name> \"New York\" . ?e_2 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2179 6907\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2544",
    "input_seq": "What series ordinal includes Cyndi Lauper as a part of USA for Africa?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"USA for Africa\" . ?e_2 <pred:name> \"Cyndi Lauper\" . ?e_1 <has_part> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <has_part> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }"
  },
  {
    "qid": "train_2545",
    "input_seq": "Is the official website of a visual artwork, whose exploitation visa number was 107675 on 30th April 2003, http://www.miramax.com/movie/pinocchio ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"107674\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:date> \"2003-04-30\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.miramax.com/movie/pinocchio\" .  }"
  },
  {
    "qid": "train_2546",
    "input_seq": "Is Flint or the Lima at 268 meters above sea level higher in elevation?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Flint\" . } UNION { ?e <pred:name> \"Lima\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"268\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2547",
    "input_seq": "What is the connection between MTV Video Music Award for Best Visual Effects to Lady Gaga?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"MTV Video Music Award for Best Visual Effects\" . ?e_2 <pred:name> \"Lady Gaga\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2548",
    "input_seq": "Of the Arizona counties with less than 1800000000 people, which has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"1800000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2549",
    "input_seq": "Which is longer, Anchorman: The Legend of Ron Burgundy or Patch Adams originally in English?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Anchorman: The Legend of Ron Burgundy\" .  } UNION { ?e <pred:name> \"Patch Adams\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2550",
    "input_seq": "What is the relationship between bread and L-Isoleucine?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"bread\" . ?e_2 <pred:name> \"L-Isoleucine\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2551",
    "input_seq": "What proportion of the ethnic group Poles live in Poland?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Poland\" . ?e_2 <pred:name> \"Poles\" . ?e_1 <ethnic_group> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <ethnic_group> ; <pred:fact_t> ?e_2 ] <proportion> ?qpv .  }"
  },
  {
    "qid": "train_2552",
    "input_seq": "What is the ending date that West Midlands (whose 2011 GSS code is E11000005) is located in England (where the population is 49138831)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"West Midlands\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E11000005\" . ?e_2 <pred:name> \"England\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"49138831\"^^xsd:double . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2553",
    "input_seq": "Does Marion County, population 28,237, occupy other than 10000000 square km?",
    "target_seq": "ASK { ?e <pred:name> \"Marion County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"28237\"^^xsd:double . ?e <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> ?v . FILTER ( ?v != \"10000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2554",
    "input_seq": "Which made more at the box office, Robin Hood (the one whose script is wrote by Brian Helgeland) or Pulp Fiction?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Robin Hood\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Brian Helgeland\" .   } UNION { ?e <pred:name> \"Pulp Fiction\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2555",
    "input_seq": "What business has a subsidiary organization with an ISNI of 0000 0000 8884 2915?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <subsidiary> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"organization\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8884 2915\" .   }"
  },
  {
    "qid": "train_2556",
    "input_seq": "Rambo III was released in which place on 1988-07-14?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Rambo III\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-07-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2557",
    "input_seq": "What is the start date for exploitation visa number 118477, belonging to the visual artwork originating in Lebanon(whose inflation rate is 77.1 percent)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Lebanon\" . ?e_1 <inflation_rate> ?pv_1 . ?pv_1 <pred:unit> \"percentage\" . ?pv_1 <pred:value> \"77.1\"^^xsd:double . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"118477\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2558",
    "input_seq": "What is the connection between Danilo Donati to Rome (the one that is the capital of Holy Roman Empire)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Danilo Donati\" . ?e_2 <pred:name> \"Rome\" . ?e_3 <capital> ?e_2 . ?e_3 <pred:name> \"Holy Roman Empire\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2559",
    "input_seq": "Is Insidious the title of The Crucible, penned by Arthur Miller ?",
    "target_seq": "ASK { ?e <pred:name> \"The Crucible\" . ?e <author> ?e_1 . ?e_1 <pred:name> \"Arthur Miller\" .  ?e <title> ?pv . ?pv <pred:value> \"Insidious\" .  }"
  },
  {
    "qid": "train_2560",
    "input_seq": "Who lives in New York City and has ISNI 0000 0001 1475 6720?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <residence> ?e_1 . ?e_1 <pred:name> \"New York City\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1475 6720\" .  }"
  },
  {
    "qid": "train_2561",
    "input_seq": "What is the elevation above sea level of the city where Muhammad had died?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_death> ?e . ?e_1 <pred:name> \"Muhammad\" .  ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_2562",
    "input_seq": "What is the connection between Alien (the one that received BAFTA Award for Best Sound) to Alien (the one that presents in work Alien: Resurrection)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alien\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"BAFTA Award for Best Sound\" . ?e_2 <pred:name> \"Alien\" . ?e_2 <present_in_work> ?e_4 . ?e_4 <pred:name> \"Alien: Resurrection\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2563",
    "input_seq": "What is the connection between 2000 Major League Baseball season to Atlanta Braves?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2000 Major League Baseball season\" . ?e_2 <pred:name> \"Atlanta Braves\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2564",
    "input_seq": "When did an industry, which is a part of North African Campaign, begin?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <part_of> ?e_1 . ?e_1 <pred:name> \"North African Campaign\" .  ?e <start_time> ?pv .  }"
  },
  {
    "qid": "train_2565",
    "input_seq": "What is the language of Arthur C. Clarke's website, http://arthurcclarke.org ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Arthur C. Clarke\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://arthurcclarke.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2566",
    "input_seq": "what is his/her Deutsche Synchronkartei actor-ID of the human with the official website as http://fredarmisen.com",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://fredarmisen.com\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv .  }"
  },
  {
    "qid": "train_2567",
    "input_seq": "Does Trieste or Rawalpindi have the larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Trieste\" .  } UNION { ?e <pred:name> \"Rawalpindi\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2568",
    "input_seq": "Does South Vietnam occupy more than 105 acres ?",
    "target_seq": "ASK { ?e <pred:name> \"South Vietnam\" . ?e <area> ?pv . ?pv <pred:unit> \"acre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"105\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2569",
    "input_seq": "What country is Menlo Park, the headquarter location of Sequoia Capital?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Sequoia Capital\" . ?e_2 <pred:name> \"Menlo Park\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_2570",
    "input_seq": "What is the connection between Dore Schary to Academy Award for Best Documentary (Short Subject)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dore Schary\" . ?e_2 <pred:name> \"Academy Award for Best Documentary (Short Subject)\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2571",
    "input_seq": "Which language is used on the website www.ci.malibu.ca.us, representing Malibu, where It's a Mad, Mad, Mad, Mad World was shot?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Malibu\" . ?e_1 <filming_location> ?e . ?e_1 <pred:name> \"It's a Mad, Mad, Mad, Mad World\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ci.malibu.ca.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2572",
    "input_seq": "I want to know the title of the movie with the official website http://www.letyourselfgo.com/.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.letyourselfgo.com/\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2573",
    "input_seq": "What is the connection between Malaysia to Greece?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Malaysia\" . ?e_2 <pred:name> \"Greece\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2574",
    "input_seq": "Which individual's native language name is Лев Николаевич Толстой ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Лев Николаевич Толстой\" .  }"
  },
  {
    "qid": "train_2575",
    "input_seq": "How many points in a match did midfielder Steve Earle achieve as a member of Leicester City F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Steve Earle\" . ?e_1 <position_played_on_team_/_speciality> ?e_3 . ?e_3 <pred:name> \"midfielder\" . ?e_2 <pred:name> \"Leicester City F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_points/goals/set_scored> ?qpv .  }"
  },
  {
    "qid": "train_2576",
    "input_seq": "Which movie titled The Music Man is set in Iowa?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"The Music Man\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"Iowa\" .  }"
  },
  {
    "qid": "train_2577",
    "input_seq": "What is name of video game whose publication date is on 1987-01-01 ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1987-01-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_2578",
    "input_seq": "What is the connection between Tim Blake Nelson to playwright?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tim Blake Nelson\" . ?e_2 <pred:name> \"playwright\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2580",
    "input_seq": "What is the connection between Giant (the one that origins from Uruguay) to Germany?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Giant\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"Uruguay\" . ?e_2 <pred:name> \"Germany\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2581",
    "input_seq": "Does Basic Instinct 2 or The Sixth Sense have the shorter runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Basic Instinct 2\" .  } UNION { ?e <pred:name> \"The Sixth Sense\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2582",
    "input_seq": "How many port cities have a population more than 930000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"port city\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"930000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2583",
    "input_seq": "What is the relationship between Flags of Our Fathers to Letters from Iwo Jima?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Flags of Our Fathers\" . ?e_2 <pred:name> \"Letters from Iwo Jima\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2584",
    "input_seq": "What is the connection between Dirty rap to Lil' Kim?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dirty rap\" . ?e_2 <pred:name> \"Lil' Kim\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2585",
    "input_seq": "Which county in California with a population over 9000 has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"9000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2586",
    "input_seq": "What is the relation between John Broome, the writer, and John Broome, who has the UK citizenship ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Broome\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"writer\" . ?e_2 <pred:name> \"John Broome\" . ?e_2 <country_of_citizenship> ?e_4 . ?e_4 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2587",
    "input_seq": "What is the official website of the rock band that is famous for Tejano music?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"Tejano music\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2588",
    "input_seq": "What number of award ceremonies does Neil Patick Harris present?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award ceremony\" . ?e <presenter> ?e_1 . ?e_1 <pred:name> \"Neil Patrick Harris\" .   }"
  },
  {
    "qid": "train_2589",
    "input_seq": "Which official website represents the movie corresponding to exploitation visa number 130281?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"130281\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2590",
    "input_seq": "How is progressive house music related to Jean-Michel Jarre?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"progressive house music\" . ?e_2 <pred:name> \"Jean-Michel Jarre\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2591",
    "input_seq": "What is the connection between Craig Bellamy to Newcastle United F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Craig Bellamy\" . ?e_2 <pred:name> \"Newcastle United F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2592",
    "input_seq": "How many subscriber does an association football club, headquartered in Peterborough (the one whose NUTS code is UKH11), have on its Twitter username of theposhofficial?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Peterborough\" . ?e_1 <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"UKH11\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"theposhofficial\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2593",
    "input_seq": "Does the person who is a cast member of Aliens (the one that has Sigourney Weaver as a cast member) (the character role of this statement is Bishop), have a work period (start) after 1943?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Aliens\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Sigourney Weaver\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Bishop\" . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1943 ) .  }"
  },
  {
    "qid": "train_2594",
    "input_seq": "Was the population of Madison County, of the website www.madisoncty.com, above 5.7 on 2011-07-01?",
    "target_seq": "ASK { ?e <pred:name> \"Madison County\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.madisoncty.com\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"5.7\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_2595",
    "input_seq": "What is the publication date of the visual artwork whose narrative location is French Polynesia?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"French Polynesia\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_2596",
    "input_seq": "When was Kidderminster Harriers F.C. founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kidderminster Harriers F.C.\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2597",
    "input_seq": "Is the number of children of the person winning the Independent Spirit Award for Best Supporting Male in 1998 more than 2.1 daughters?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Independent Spirit Award for Best Supporting Male\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 1998 . ?e <number_of_children> ?pv . ?pv <pred:unit> \"daughter\" . ?pv <pred:value> ?v . FILTER ( ?v > \"2.1\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2598",
    "input_seq": "Which is longer between How Green Was My Valley or It Happened One Night?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"How Green Was My Valley\" .  } UNION { ?e <pred:name> \"It Happened One Night\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2599",
    "input_seq": "Was Shelley Duvalls, a cast member of The Shining, playing Wendy Torrance, born before 1984?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"The Shining\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Shelley Duvall\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Wendy Torrance\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1984 ) .  }"
  },
  {
    "qid": "train_2600",
    "input_seq": "What administrative territorial entity has a FIPS 6-4 (US counties) of 20091?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"20091\" .  }"
  },
  {
    "qid": "train_2601",
    "input_seq": "Which one is taller, Larsh Hirschfeld or Richard Thompson, 2008 Summer Olympics participant?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lars Hirschfeld\" .  } UNION { ?e <pred:name> \"Richard Thompson\" . ?e <participant_of> ?e_1 . ?e_1 <pred:name> \"2008 Summer Olympics\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2602",
    "input_seq": "When did the individual whose Libris-URI is hftwx3z1592mfs8 die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"hftwx3z1592mfs8\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_2603",
    "input_seq": "How was it determined that the Hong Kong national football team is ranked 104?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hong Kong national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"104\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_2604",
    "input_seq": "Does ISO 3166-2 code GB-ENG correspond to the ceremonial English county with FIPS 10-4 (countries and regions) code UKF2 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKF2\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-ENG\" .  }"
  },
  {
    "qid": "train_2605",
    "input_seq": "Does Sarah Lawrence College alumna Jane Alexander or Mila Kunis have fewer kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jane Alexander\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"Sarah Lawrence College\" .   } UNION { ?e <pred:name> \"Mila Kunis\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2606",
    "input_seq": "What is the playing length of the visual artwork titled Lost Highway?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Lost Highway\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_2607",
    "input_seq": "What is the connection between Donald Pleasence to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Donald Pleasence\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2608",
    "input_seq": "Is comunemi the Twitter username of someone who did voice acting in Little Nicky (the one that has Adam Sandler as a voice actor) ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <voice_actor> ?e . ?e_1 <pred:name> \"Little Nicky\" . ?e_1 <voice_actor> ?e_2 . ?e_2 <pred:name> \"Adam Sandler\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"comunemi\" .  }"
  },
  {
    "qid": "train_2609",
    "input_seq": "When did the city whose local dialing code is 141 have a population of 681000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"141\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"681000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2610",
    "input_seq": "What is the native language name of the person whose CANTIC-ID is a10447921?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a10447921\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_2611",
    "input_seq": "What is the release region of the animated film whose title is Bolt and release date is 2008-12-21?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Bolt\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-12-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2612",
    "input_seq": "What character does Rowan Atkinson play in Johnny English Reborn?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Johnny English Reborn\" . ?e_2 <pred:name> \"Rowan Atkinson\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2613",
    "input_seq": "What is the connection between Heart and Columbia Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Heart\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"heavy metal\" . ?e_2 <pred:name> \"Columbia Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2614",
    "input_seq": "Is 182390 the population on the date 2011-07-01 of Livingston County that is located in Michigan?",
    "target_seq": "ASK { ?e <pred:name> \"Livingston County\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Michigan\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"182390\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_2615",
    "input_seq": "Is there a greater area in Union County (the one that shares border with New York City) or Passaic County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Union County\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"New York City\" .   } UNION { ?e <pred:name> \"Passaic County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2616",
    "input_seq": "What is the connection between Olympiakos Nicosia FC to green?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Olympiakos Nicosia FC\" . ?e_2 <pred:name> \"green\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2617",
    "input_seq": "Regarding the state of the US that has the Dewey Decimal Classification of 2--783, and population is 642961 what is its time point?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--783\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"642961\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2618",
    "input_seq": "When did Sally Field win the National Society of Film Critics Award for Best Actress?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"National Society of Film Critics Award for Best Actress\" . ?e_2 <pred:name> \"Sally Field\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2619",
    "input_seq": "Which art movement established post-1860 came to a close post-1910?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1860 ) . ?e <end_time> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1910 ) .  }"
  },
  {
    "qid": "train_2621",
    "input_seq": "What is the connection between Billie Holiday to New York City?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Billie Holiday\" . ?e_2 <pred:name> \"New York City\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2622",
    "input_seq": "How many constitutional monarchies whose GDP (PPP) is not 9900000000 Geary–Khamis dollars?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"constitutional monarchy\" . ?e <GDP_(PPP)> ?pv . ?pv <pred:unit> \"Geary–Khamis dollar\" . ?pv <pred:value> ?v . FILTER ( ?v != \"9900000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2623",
    "input_seq": "How is the art film Solaris related to the art film genre?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Solaris\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"art film\" . ?e_2 <pred:name> \"art film\" . ?e_1 ?p ?e_2 .  }"
  }
]