[
  {
    "qid": "train_2952",
    "input_seq": "What does Bob Geldof have to do with actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bob Geldof\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2953",
    "input_seq": "Are there less seats in the Western Australian Legislative Assembly or United States House of Representatives?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Western Australian Legislative Assembly\" .  } UNION { ?e <pred:name> \"United States House of Representatives\" .  } ?e <number_of_seats> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2954",
    "input_seq": "What is the ISNI for the band that is the composer of Catch Me If You Can (that has M. Emmet Walsh as a cast member)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <composer> ?e . ?e_1 <pred:name> \"Catch Me If You Can\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"M. Emmet Walsh\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2955",
    "input_seq": "When did Oliver Cromwell become a citizen of England (the one that has military conflicts with Kingdom of Scotland)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Oliver Cromwell\" . ?e_2 <pred:name> \"England\" . ?e_2 <military_conflicts> ?e_3 . ?e_3 <pred:name> \"Kingdom of Scotland\" . ?e_1 <country_of_citizenship> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country_of_citizenship> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2956",
    "input_seq": "Where was the video game whose official website is http://www.atlus.com/rockofages/ published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.atlus.com/rockofages/\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_2957",
    "input_seq": "Is the ISNI of Roy Haynes 0000 0003 6864 1210 ?",
    "target_seq": "ASK { ?e <pred:name> \"Roy Haynes\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 6864 1210\" .  }"
  },
  {
    "qid": "train_2959",
    "input_seq": "Tell me the one with the biggest area within the geographic region that has a border with North America.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"North America\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2960",
    "input_seq": "Is jaguars the Twitter username for the Jackson Jaguars?",
    "target_seq": "ASK { ?e <pred:name> \"Jacksonville Jaguars\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"jaguars\" .  }"
  },
  {
    "qid": "train_2961",
    "input_seq": "About the animated feature film featuring Eva Longoria as a voice actor, does it have official website exactly http://www.arthurchristmas.com ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Eva Longoria\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.arthurchristmas.com\" .  }"
  },
  {
    "qid": "train_2962",
    "input_seq": "How is Erie County, location of Buffalo, related to New York, under the jurisdiction of the Governor of New York?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Erie County\" . ?e_3 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_3 <pred:name> \"Buffalo\" . ?e_2 <pred:name> \"New York\" . ?e_4 <applies_to_jurisdiction> ?e_2 . ?e_4 <pred:name> \"Governor of New York\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2964",
    "input_seq": "What's the number of states in India that have Scottish as a language?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <language_used> ?e_1 . ?e_1 <pred:name> \"Scots\" .   }"
  },
  {
    "qid": "train_2965",
    "input_seq": "When was the last time Lazio contained the administration division Province of Rome?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lazio\" . ?e_2 <pred:name> \"Province of Rome\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2966",
    "input_seq": "The painting housed in Mantua was created in how many Italian communes?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comune of Italy\" . ?e_1 <location_of_formation> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"painting\" . ?e_1 <location_of_formation> ?e_3 . ?e_3 <pred:name> \"Mantua\" .   }"
  },
  {
    "qid": "train_2967",
    "input_seq": "What is the number of independent record labels whose headquarters is located in London (that is the residence of Michael Fassbender)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent record label\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"London\" . ?e_2 <residence> ?e_1 . ?e_2 <pred:name> \"Michael Fassbender\" .   }"
  },
  {
    "qid": "train_2968",
    "input_seq": "Was Timothy Olyphant born after 1928?",
    "target_seq": "ASK { ?e <pred:name> \"Timothy Olyphant\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1928 ) .  }"
  },
  {
    "qid": "train_2969",
    "input_seq": "About the rock band that has official website http://www.totoofficial.com/, does it have an ISNI equal to 0000 0001 2264 8623 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.totoofficial.com/\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2264 8623\" .  }"
  },
  {
    "qid": "train_2970",
    "input_seq": "Is the height of the person whose date of birth is 1937-08-22, less than 190 centimetre ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1937-08-22\"^^xsd:date . ?e <height> ?pv . ?pv <pred:unit> \"centimetre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"190\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2971",
    "input_seq": "When was John Barry (ISNI 0000 0000 8373 1140) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John Barry\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8373 1140\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2972",
    "input_seq": "Which has the largest population among the area of London whose population is not 300?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"area of London\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"300\"^^xsd:double ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2973",
    "input_seq": "Who is the reviewer who gave the score of 7.7 to a movie that, on 15th Academy Awards, received Academy Award for Best Original Musical Score?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Original Musical Score\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"15th Academy Awards\" . ?e <review_score> ?pv . ?pv <pred:value> \"7.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <review_score> ; <pred:fact_t> ?pv ] <review_score_by> ?qpv .  }"
  },
  {
    "qid": "train_2974",
    "input_seq": "When was the band whose Twitter username is DEVO founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"DEVO\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2975",
    "input_seq": "How many republics share the loyalty of the French Army?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e_1 <allegiance> ?e . ?e_1 <pred:name> \"French Army\" .   }"
  },
  {
    "qid": "train_2976",
    "input_seq": "How is Ernest Rutherford related to Bachelor of Science?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ernest Rutherford\" . ?e_2 <pred:name> \"Bachelor of Science\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2978",
    "input_seq": "When did John Candy die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John Candy\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_2979",
    "input_seq": "What is the connection between Miracle on 34th Street (the one whose publication date is 1973-01-01) to Jane Alexander (the one that received Tony Award for Best Featured Actress in a Play)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Miracle on 34th Street\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1973-01-01\"^^xsd:date . ?e_2 <pred:name> \"Jane Alexander\" . ?e_2 <award_received> ?e_3 . ?e_3 <pred:name> \"Tony Award for Best Featured Actress in a Play\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2980",
    "input_seq": "Jon Favreau, an executive producer of Cowboys & Aliens, is distinct from which person?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <different_from> ?e_1 . ?e_1 <pred:name> \"Jon Favreau\" . ?e_2 <executive_producer> ?e_1 . ?e_2 <pred:name> \"Cowboys & Aliens\" .   }"
  },
  {
    "qid": "train_2981",
    "input_seq": "Which one has greater population, La Plata or Derby located in the Greenwich Mean Time zone?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"La Plata\" .  } UNION { ?e <pred:name> \"Derby\" . ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Greenwich Mean Time\" .   } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2982",
    "input_seq": "Who is taller: soccer's George Hamilton or Paul Williams of Southampton F.C.?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"George Hamilton\" . ?e <sport> ?e_1 . ?e_1 <pred:name> \"association football\" .   } UNION { ?e <pred:name> \"Paul Williams\" . ?e <member_of_sports_team> ?e_2 . ?e_2 <pred:name> \"Southampton F.C.\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2983",
    "input_seq": "What is the connection between Chad Smith (the one that is a member of Houston Dynamo) to Houston (the one whose local dialing code is 832)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chad Smith\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Houston Dynamo\" . ?e_2 <pred:name> \"Houston\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"832\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2984",
    "input_seq": "Is http://www.saudi.gov.sa the official website for the film that is recorded in Mobile whose local area code is 251?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <filming_location> ?e_1 . ?e_1 <pred:name> \"Mobile\" . ?e_1 <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"251\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.saudi.gov.sa\" .  }"
  },
  {
    "qid": "train_2985",
    "input_seq": "What is the connection between Sonic the Hedgehog (the one whose publication date is 1991-07-26) to Doctor Eggman?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sonic the Hedgehog\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1991-07-26\"^^xsd:date . ?e_2 <pred:name> \"Doctor Eggman\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2986",
    "input_seq": "Does the person who is Jacques Derrida's teacher, have an ISNI equal to 0000 0000 7840 5834?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <student_of> ?e . ?e_1 <pred:name> \"Jacques Derrida\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7840 5834\" .  }"
  },
  {
    "qid": "train_2987",
    "input_seq": "Which one has a longer duration, Jackass Number Two or The Cell?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jackass Number Two\" .  } UNION { ?e <pred:name> \"The Cell\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2988",
    "input_seq": "How is Chester County related to the Delaware County with a size of 494 square kilometers?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chester County\" . ?e_2 <pred:name> \"Delaware County\" . ?e_2 <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"494\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2989",
    "input_seq": "Does the New York county with postal code 10501–10805 have an elevation other than 470 meters above sea level?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"10501–10805\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v != \"470\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2991",
    "input_seq": "Which area is larger, Champaign or Pontiac?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Champaign\" .  } UNION { ?e <pred:name> \"Pontiac\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2992",
    "input_seq": "Is the Folkestone GSS code (2011) S12000035 ?",
    "target_seq": "ASK { ?e <pred:name> \"Folkestone\" . ?e <GSS_code_(2011)> ?pv . ?pv <pred:value> \"S12000035\" .  }"
  },
  {
    "qid": "train_2993",
    "input_seq": "What is the connection between John Mayer (the one that is the citizen of British Raj) to India (the one that is the release region of Fast Five)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Mayer\" . ?e_1 <country_of_citizenship> ?e_3 . ?e_3 <pred:name> \"British Raj\" . ?e_2 <pred:name> \"India\" . ?e_4 <film_release_region> ?e_2 . ?e_4 <pred:name> \"Fast Five\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2994",
    "input_seq": "How many natural languages hold ISO 639-3 code 'fas' and are the language used by Moldavia ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"natural language\" . ?e <ISO_639-3_code> ?pv . ?pv <pred:value> \"fas\" . ?e_1 <language_used> ?e . ?e_1 <pred:name> \"Moldavia\" .  }"
  },
  {
    "qid": "train_2995",
    "input_seq": "Is 0000 0000 7981 2116 the ISNI for the person who was nominated for an Academy Award for Best Supporting Actress that is associated with the award-winning work Hilary and Jackie?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actress\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Hilary and Jackie\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7981 2116\" .  }"
  },
  {
    "qid": "train_2996",
    "input_seq": "Is the official website of the award won by Kate Winslet for The Dressmaker http://www.aacta.org?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <winner> ?e_1 . ?e_1 <pred:name> \"Kate Winslet\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"The Dressmaker\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.aacta.org\" .  }"
  },
  {
    "qid": "train_2997",
    "input_seq": "Is the official website of the association football club whose Giphy username is ol equal to http://www.konami.com/officialsites/silenthill/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"ol\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.konami.com/officialsites/silenthill/\" .  }"
  },
  {
    "qid": "train_2998",
    "input_seq": "Is the 537  IAB code of swimming?",
    "target_seq": "ASK { ?e <pred:name> \"swimming\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"537\" .  }"
  },
  {
    "qid": "train_2999",
    "input_seq": "Is there less elevation above sea level in Dearborn or in Bay City?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dearborn\" .  } UNION { ?e <pred:name> \"Bay City\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3001",
    "input_seq": "How many food ingredients are a natural product of a dinosaur?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"food ingredient\" . ?e <natural_product_of_taxon> ?e_1 . ?e_1 <pred:name> \"dinosaur\" .   }"
  },
  {
    "qid": "train_3002",
    "input_seq": "Does Die Hard, publicly released on 1988-07-15, clock in at under 700 minutes ?",
    "target_seq": "ASK { ?e <pred:name> \"Die Hard\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1988-07-15\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v < \"700\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3003",
    "input_seq": "What animated feature film derives the musical published in 1991?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e_1 <based_on> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"musical\" . ?e_1 <publication_date> ?pv . ?pv <pred:year> 1991 .   }"
  },
  {
    "qid": "train_3004",
    "input_seq": "How is Spice World related to musical film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Spice World\" . ?e_2 <pred:name> \"musical film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3005",
    "input_seq": "Who does Libris-URI khwz01631cdp5mg belong to?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"khwz01631cdp5mg\" .  }"
  },
  {
    "qid": "train_3006",
    "input_seq": "Which has the fewest students among the schools whose student count is more than 520?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"520\"^^xsd:double ) . ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3007",
    "input_seq": "When did  Kanagawa Prefecture become the twinned administrative body of Penang?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kanagawa Prefecture\" . ?e_2 <pred:name> \"Penang\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3008",
    "input_seq": "Which has more area, Yamhill County or Columbia County whose population is 49351?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Yamhill County\" . } UNION { ?e <pred:name> \"Columbia County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"49351\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3009",
    "input_seq": "The person corresponding to ISNI 0000 0000 7840 2844 earned a nomination to which theatre award in 1957?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7840 2844\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 1957 .  }"
  },
  {
    "qid": "train_3010",
    "input_seq": "What is the start date of the art movement that ended before 1900?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 < 1900 ) . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3011",
    "input_seq": "What's the language associated with the Iraklis F.C. website of https://www.fciraklis.gr?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Iraklis F.C.\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.fciraklis.gr/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3012",
    "input_seq": "What is the gender of Russians that have the demonym of רוסיה?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Russians\" . ?e <demonym> ?pv . ?pv <pred:value> \"רוסיה\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <sex_or_gender> ?qpv .  }"
  },
  {
    "qid": "train_3013",
    "input_seq": "Who was the recipient when Alice Doesn't Live Here Anymore won an Academy Award for Best Actress?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Alice Doesn't Live Here Anymore\" . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_3014",
    "input_seq": "What is the series ordinal of Genesis (that originates in the United States of America) that is a part of Star Trek: The Next Generation (whose number of episodes is 178)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Genesis\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Star Trek: The Next Generation\" . ?e_2 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"178\"^^xsd:double . ?e_1 <part_of_the_series> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }"
  },
  {
    "qid": "train_3015",
    "input_seq": "Was Brian Wilson (native language name Brian Wilson) born in a year different from 1937 ?",
    "target_seq": "ASK { ?e <pred:name> \"Brian Wilson\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Brian Wilson\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1937 ) .  }"
  },
  {
    "qid": "train_3016",
    "input_seq": "Which has less population, Havana whose demonym is Habanero or Bhubaneswar?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Havana\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Habanero\" . } UNION { ?e <pred:name> \"Bhubaneswar\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3017",
    "input_seq": "What is the title of the work that Josh Hartnett produced?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Josh Hartnett\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_3018",
    "input_seq": "Does the person whose official website is http://www.GoodCharlotte.com, have a Twitter username equal to benjaminmadden?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.GoodCharlotte.com\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"benjaminmadden\" .  }"
  },
  {
    "qid": "train_3019",
    "input_seq": "Someone who died on 1978-08-31 was born on which date?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1978-08-31\"^^xsd:date . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3020",
    "input_seq": "what is the military conflicts with Austria-Hungary which is a country of Transylvania",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <military_conflicts> ?e_1 . ?e_1 <pred:name> \"Transylvania\" . ?e_1 <country> ?e_2 . ?e_2 <pred:name> \"Austria-Hungary\" .   }"
  },
  {
    "qid": "train_3021",
    "input_seq": "How many entertainment entities are included in Batman (the one that forms the basis to The Dark Knight Rises) and use Havok software engine (with the OS Microsoft Windows) ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <part_of_the_series> ?e_1 . ?e_1 <pred:name> \"Batman\" . ?e_1 <derivative_work> ?e_2 . ?e_2 <pred:name> \"The Dark Knight Rises\" .  ?e <software_engine> ?e_3 . ?e_3 <pred:name> \"Havok\" . ?e_3 <operating_system> ?e_4 . ?e_4 <pred:name> \"Microsoft Windows\" .  }"
  },
  {
    "qid": "train_3022",
    "input_seq": "How many pop music renditions have the subreddit kpop or are a movement by David Bowie who was born in Brixton?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pop music\" .  { ?e <subreddit> ?pv . ?pv <pred:value> \"kpop\" .  } UNION { ?e_1 <movement> ?e . ?e_1 <pred:name> \"David Bowie\" . ?e_1 <place_of_birth> ?e_2 . ?e_2 <pred:name> \"Brixton\" .  } }"
  },
  {
    "qid": "train_3023",
    "input_seq": "How is Joan Rivers related to American Jews?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Joan Rivers\" . ?e_2 <pred:name> \"American Jews\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3024",
    "input_seq": "How many legislative terms commenced earlier than 1827 and have jurisdiction over the United States of America?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"legislative term\" . ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1827 ) . ?e <applies_to_jurisdiction> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_3025",
    "input_seq": "Does the Australian Broadcasting Corporation's production of Luther or does Main Hoon Na have the shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Luther\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Australian Broadcasting Corporation\" .   } UNION { ?e <pred:name> \"Main Hoon Na\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3026",
    "input_seq": "What award is related to basketball and whose official English language website is http://www.hoophall.com/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hoophall.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <sport> ?e_1 . ?e_1 <pred:name> \"basketball\" .  }"
  },
  {
    "qid": "train_3027",
    "input_seq": "Which has the lowest elevation above sea level among the U.S. cities that are a twinned administrative body of Taipei?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Taipei\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3028",
    "input_seq": "Was the individual whose ISNI is 0000 0000 4556 8100 born at a time other than 1969?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 4556 8100\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1969 ) .  }"
  },
  {
    "qid": "train_3029",
    "input_seq": "How many counties in Michigan are in the country with the short name of É.-U.?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"É.-U.\" .   }"
  },
  {
    "qid": "train_3030",
    "input_seq": "What is the total revenue earned by the public company with a staff in 2010 of other than 1300000?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public company\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"1300000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2010 . ?e <total_revenue> ?pv .  }"
  },
  {
    "qid": "train_3031",
    "input_seq": "What are the number of Critics' Choice Movie Awards with official website as http://www.criticschoice.com/ or those won by Joan Cusack ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Critics' Choice Movie Award\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.criticschoice.com/\" .  } UNION { ?e <winner> ?e_1 . ?e_1 <pred:name> \"Joan Cusack\" .  } }"
  },
  {
    "qid": "train_3032",
    "input_seq": "What is the native label of Franklin Medal ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Franklin Medal\" . ?e <native_label> ?pv .  }"
  },
  {
    "qid": "train_3033",
    "input_seq": "What does German Shepherd dog have to do with Germany?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"German Shepherd dog\" . ?e_2 <pred:name> \"Germany\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3034",
    "input_seq": "Does Richmond, U.K. or Slough have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Richmond\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .   } UNION { ?e <pred:name> \"Slough\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3035",
    "input_seq": "What is the relationship between War and Peace, produced by Carlo Ponti, Sr., and Audrey Hepburn?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"War and Peace\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Carlo Ponti, Sr.\" . ?e_2 <pred:name> \"Audrey Hepburn\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3036",
    "input_seq": "The movie titled 英雄本色 was released in what location on 1991-09-24?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"英雄本色\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1991-09-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3037",
    "input_seq": "Was the movie titled Road Trip released in Germany prior to 2003?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Road Trip\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2003 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_3038",
    "input_seq": "Is the ISNI of CBS Corporation 0000 0001 0743 5232?",
    "target_seq": "ASK { ?e <pred:name> \"CBS Corporation\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0743 5232\" .  }"
  }
]