[
  {
    "qid": "train_4193",
    "input_seq": "When was the person with ISNI numeric code 0000 0001 1937 2443 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1937 2443\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4194",
    "input_seq": "How is the 2004 Major League Baseball draft related to the Arizona Diamondbacks?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2004 Major League Baseball draft\" . ?e_2 <pred:name> \"Arizona Diamondbacks\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4195",
    "input_seq": "Was the university where Daniel Handler was educated not founded in 1912?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Daniel Handler\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1912 ) .  }"
  },
  {
    "qid": "train_4196",
    "input_seq": "Which has less area, Fond du Lac County or Monroe County whose population is 45154?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fond du Lac County\" . } UNION { ?e <pred:name> \"Monroe County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"45154\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4197",
    "input_seq": "What is the relationship between Friends (the one that has the record label Capitol Records) and Capitol Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Friends\" . ?e_1 <record_label> ?e_3 . ?e_3 <pred:name> \"Capitol Records\" . ?e_2 <pred:name> \"Capitol Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4198",
    "input_seq": "How is Marv Wolfman related to Brooklyn, residence of Paul Bettany?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Marv Wolfman\" . ?e_2 <pred:name> \"Brooklyn\" . ?e_3 <residence> ?e_2 . ?e_3 <pred:name> \"Paul Bettany\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4199",
    "input_seq": "How many written works use English?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" .   }"
  },
  {
    "qid": "train_4200",
    "input_seq": "How many civil wars have as a participant the sovereign state whose 2003 total fertility rate was equal to 1.577?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"civil war\" . ?e_1 <participant_of> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <total_fertility_rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.577\"^^xsd:double . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <total_fertility_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2003 .   }"
  },
  {
    "qid": "train_4201",
    "input_seq": "ISNI 0000 0001 2142 2112 identifies which individual?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2142 2112\" .  }"
  },
  {
    "qid": "train_4202",
    "input_seq": "Which has more mass, Tony Richardson who was born on 1971-12-12 or Michael McDonald who was drafted by the Golden State Warriors?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tony Richardson\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1971-12-12\"^^xsd:date . } UNION { ?e <pred:name> \"Michael McDonald\" . ?e <drafted_by> ?e_1 . ?e_1 <pred:name> \"Golden State Warriors\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4203",
    "input_seq": "What is the publication territory of Made in Dagenham whose release date is 2011-01-13?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Made in Dagenham\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-01-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4204",
    "input_seq": "What is the end time of Patricia Neal is the spouse of Roald Dahl?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Patricia Neal\" . ?e_2 <pred:name> \"Roald Dahl\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4205",
    "input_seq": "What is the birth date of the person with 198,442 followers of his Twitter username TomArnold?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"TomArnold\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"198442\"^^xsd:double . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4206",
    "input_seq": "What is the connection between John Davis (who is educated at Brown University) and historian?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Davis\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"Brown University\" . ?e_2 <pred:name> \"historian\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4207",
    "input_seq": "Which has a larger area, Province of Cuneo or Province of Salerno?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Province of Cuneo\" .  } UNION { ?e <pred:name> \"Province of Salerno\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4208",
    "input_seq": "What is the official website for the association football club whose Twitter username is atlasfc?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"atlasfc\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4209",
    "input_seq": "When did Epic Records become the child organization of CBS Records?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Epic Records\" . ?e_2 <pred:name> \"CBS Records\" . ?e_1 <parent_organization> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <parent_organization> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_4210",
    "input_seq": "Does the Scottish Labour Party or Kuomintang have more members?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Scottish Labour Party\" .  } UNION { ?e <pred:name> \"Kuomintang\" .  } ?e <member_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4211",
    "input_seq": "How many Twitter subscribers does Joseph Gordon-Levitt have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Joseph Gordon-Levitt\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"hitRECordJoe\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4212",
    "input_seq": "Does the person born on 1964-07-13 weigh under 210 pounds ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1964-07-13\"^^xsd:date . ?e <mass> ?pv . ?pv <pred:unit> \"pound\" . ?pv <pred:value> ?v . FILTER ( ?v < \"210\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4213",
    "input_seq": "Does Yerevan or Riyadh has greater elevation (above sea level) ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Yerevan\" .  } UNION { ?e <pred:name> \"Riyadh\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4214",
    "input_seq": "Does bipolar disorder or AIDS have the greater disease burden?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"bipolar disorder\" .  } UNION { ?e <pred:name> \"AIDS\" .  } ?e <disease_burden> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4215",
    "input_seq": "Which movie made less at the box office, Pinocchio (the one that is cited by The Princess and the Frog) or WALL·E?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pinocchio\" . ?e_1 <cites> ?e . ?e_1 <pred:name> \"The Princess and the Frog\" .   } UNION { ?e <pred:name> \"WALL·E\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4216",
    "input_seq": "Which one, Miracle on 34th Street (the one whose publication date is 1994-12-08) or The Three Musketeers (the one whose genre is slapstick), has less duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Miracle on 34th Street\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1994-12-08\"^^xsd:date . } UNION { ?e <pred:name> \"The Three Musketeers\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"slapstick\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4217",
    "input_seq": "What is the subject of this statement: \"Bosnia and Herzegovina have a diplomatic relation with Romania (the one that is the narrative location of Ulysses' Gaze)\"?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bosnia and Herzegovina\" . ?e_2 <pred:name> \"Romania\" . ?e_3 <narrative_location> ?e_2 . ?e_3 <pred:name> \"Ulysses' Gaze\" . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4218",
    "input_seq": "Which historic English county borders both Hertfordshire and Northamptonshire?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historic county of England\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Hertfordshire\" .  ?e <shares_border_with> ?e_2 . ?e_2 <pred:name> \"Northamptonshire\" .  }"
  },
  {
    "qid": "train_4219",
    "input_seq": "Of New York counties with a population size different from 7800, which takes up the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"7800\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4220",
    "input_seq": "Which town has the TOID 4000000074572881 and the United Kingdom as a country?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074572881\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  }"
  },
  {
    "qid": "train_4221",
    "input_seq": "When was Alias (the one that has the occupation of composer) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Alias\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"composer\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4222",
    "input_seq": "In which place For Captain America: First Avenger, the publication date is 2011-08-17 published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Captain America: The First Avenger\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-08-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4223",
    "input_seq": "For the official website, http://www.hrp.org.uk/tower-of-london/, how many subscribe to the museum's Twitter username of TowerOfLondon?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.hrp.org.uk/tower-of-london/\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TowerOfLondon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4224",
    "input_seq": "Which mountain range is partially contained by Alabama (which partially contains the Appalachian Mountains) and has a length greater than 200 miles?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e_1 <partially_contains> ?e . ?e_1 <pred:name> \"Alabama\" . ?e_1 <partially_contains> ?e_2 . ?e_2 <pred:name> \"Appalachian Mountains\" .  ?e <length> ?pv . ?pv <pred:unit> \"mile\" . ?pv <pred:value> ?v . FILTER ( ?v > \"200\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4225",
    "input_seq": "Which association football club has an official website of http://www.herefordunited.co.uk/ and has the nickname Οι Ταύροι?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.herefordunited.co.uk/\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Οι Ταύροι\" .  }"
  },
  {
    "qid": "train_4226",
    "input_seq": "London is where the University of Westminster's headquarter is located, what country does it belong to ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"University of Westminster\" . ?e_2 <pred:name> \"London\" . ?e_2 <postal_code> ?pv . ?pv <pred:value> \"BR\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_4227",
    "input_seq": "When did Walt Disney Animation Studios earn a Satellite Award for Best Animated or Mixed Media Feature?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Walt Disney Animation Studios\" . ?e_2 <pred:name> \"Satellite Award for Best Animated or Mixed Media Feature\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4228",
    "input_seq": "How is FC Kuban Krasnodar related to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"FC Kuban Krasnodar\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4229",
    "input_seq": "Is traversecity the subreddit of Kolkata?",
    "target_seq": "ASK { ?e <pred:name> \"Kolkata\" . ?e <subreddit> ?pv . ?pv <pred:value> \"traversecity\" .  }"
  },
  {
    "qid": "train_4230",
    "input_seq": "Is the Plymouth headquarters of Plymouth Argyle F.C. represented by the website at http://www.plymouth.gov.uk/ ?",
    "target_seq": "ASK { ?e <pred:name> \"Plymouth\" . ?e_1 <headquarters_location> ?e . ?e_1 <pred:name> \"Plymouth Argyle F.C.\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.plymouth.gov.uk/\" .  }"
  },
  {
    "qid": "train_4231",
    "input_seq": "Which person has ISNI 0000 0001 1479 2262 and CANTIC-ID a11767017?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1479 2262\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11767017\" .  }"
  },
  {
    "qid": "train_4232",
    "input_seq": "The Proposition, with Robert Loggia as a cast member, has what connection to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Proposition\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Robert Loggia\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4233",
    "input_seq": "Does Aamir Khan or Dick Cheney have fewer children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Aamir Khan\" .  } UNION { ?e <pred:name> \"Dick Cheney\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4234",
    "input_seq": "How many positions are different from an official position that matches the one of Lewis Cass ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <different_from> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"official\" . ?e_2 <position_held> ?e_1 . ?e_2 <pred:name> \"Lewis Cass\" .   }"
  },
  {
    "qid": "train_4235",
    "input_seq": "At what time point was the BAFTA Award for Best Film Music won by T-Bone Burnett?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"BAFTA Award for Best Film Music\" . ?e_2 <pred:name> \"T-Bone Burnett\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4236",
    "input_seq": "Is tyrabanks the Twitter username of FC Akhmat Grozny?",
    "target_seq": "ASK { ?e <pred:name> \"FC Akhmat Grozny\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"tyrabanks\" .  }"
  },
  {
    "qid": "train_4237",
    "input_seq": "Which person works in the Ottawa location and has the birth name of Joseph Philippe Pierre Yves Elliott Trudeau?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <work_location> ?e_1 . ?e_1 <pred:name> \"Ottawa\" .  ?e <birth_name> ?pv . ?pv <pred:value> \"Joseph Philippe Pierre Yves Elliott Trudeau\" .  }"
  },
  {
    "qid": "train_4238",
    "input_seq": "Does Toulouse or Caen have lower elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Toulouse\" .  } UNION { ?e <pred:name> \"Caen\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4239",
    "input_seq": "When did Scott McDonald join Millwall F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Scott McDonald\" . ?e_2 <pred:name> \"Millwall F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4240",
    "input_seq": "What is the native label of the group with the female demonym of german_?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"35\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4241",
    "input_seq": "For the animated-feature film that follows Madagascar (the one whose release region is United States of America), where is it published on its publication date of 2008-11-07?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <follows> ?e_1 . ?e_1 <pred:name> \"Madagascar\" . ?e_1 <film_release_region> ?e_2 . ?e_2 <pred:name> \"United States of America\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2008-11-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4242",
    "input_seq": "What is the elevation (above sea level) of the first-level administrative country subdivision whose official website is http://www.chiapas.gob.mx/ ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.chiapas.gob.mx/\" . ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_4243",
    "input_seq": "How many subscribers are there for the Twitter username ModernFam belonging to Modern Family?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Modern Family\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"ModernFam\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4244",
    "input_seq": "What is the connection between Harlow (the one that shares border with Chelmsford) to United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harlow\" . ?e_3 <shares_border_with> ?e_1 . ?e_3 <pred:name> \"Chelmsford\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4245",
    "input_seq": "Tell me the person with the ISNI of 0000 0001 2024 8706",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2024 8706\" .  }"
  },
  {
    "qid": "train_4246",
    "input_seq": "What is the postal code of Kyoto where Nintendo Entertainment Analysis & Development is headquartered?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nintendo Entertainment Analysis & Development\" . ?e_2 <pred:name> \"Kyoto\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }"
  },
  {
    "qid": "train_4247",
    "input_seq": "How is Jefferson County whose population is 742256 related to Shelby County whose official website is http://www.shelbycountykentucky.com?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jefferson County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"742256\"^^xsd:double . ?e_2 <pred:name> \"Shelby County\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.shelbycountykentucky.com\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4248",
    "input_seq": "Does Chris Carter whose date of birth is 1989-04-06) or James Brown whose date of birth is 1988-11-30 weigh more?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chris Carter\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1989-04-06\"^^xsd:date . } UNION { ?e <pred:name> \"James Brown\" . ?e <date_of_birth> ?pv_2 . ?pv_2 <pred:date> \"1988-11-30\"^^xsd:date . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4249",
    "input_seq": "What is the street address of  Rochester (the one that is the headquarter location of Rochester Rhinos)'s headquarters of University of Rochester ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"University of Rochester\" . ?e_2 <pred:name> \"Rochester\" . ?e_3 <headquarters_location> ?e_2 . ?e_3 <pred:name> \"Rochester Rhinos\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <located_at_street_address> ?qpv .  }"
  },
  {
    "qid": "train_4250",
    "input_seq": "Is the number of households of the municipality of the Netherlands that is the twinned administrative body of Beijing under 3500000 on the date 2015-01-01?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"municipality of the Netherlands\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Beijing\" .  ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"3500000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_households> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2015-01-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_4251",
    "input_seq": "For I Don't Know How She Does It, where is it published on its 2011-11-17 publication?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"I Don't Know How She Does It\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-11-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4252",
    "input_seq": "How many colors are Denise Richards' hair color or have the sRGB color hex triplet C41E3A?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" .  { ?e_1 <hair_color> ?e . ?e_1 <pred:name> \"Denise Richards\" .  } UNION { ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"C41E3A\" .  } }"
  },
  {
    "qid": "train_4253",
    "input_seq": "Tell me the time point of The Twilight Saga: New Moon got nominated for Golden Raspberry Award for Worst Screen Couple/Ensemble.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Twilight Saga: New Moon\" . ?e_2 <pred:name> \"Golden Raspberry Award for Worst Screen Couple/Ensemble\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4254",
    "input_seq": "Which one has a greater elevation above sea level, Bangalore or Riyadh?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bangalore\" .  } UNION { ?e <pred:name> \"Riyadh\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4255",
    "input_seq": "Does Helsinki or Limerick have greater area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Helsinki\" .  } UNION { ?e <pred:name> \"Limerick\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4256",
    "input_seq": "for the city in the United States with the zip code of 419567 and the official website being http://www.cityhall.lima.oh.us/index.asp what is the language that is associated with this creative work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"419567\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityhall.lima.oh.us/index.asp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4257",
    "input_seq": "When did Robert Mitchum win the National Board of Review Award for Best Actor?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"National Board of Review Award for Best Actor\" . ?e_2 <pred:name> \"Robert Mitchum\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4258",
    "input_seq": "Which person is a member of the Brazil national football team (the start time of this statement is 1994)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Brazil national football team\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1994 .  }"
  },
  {
    "qid": "train_4259",
    "input_seq": "What is the ending date of Western Front (that has the Battle of the Sommee as a component)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Western Front\" . ?e_1 <part_of> ?e . ?e_1 <pred:name> \"Battle of the Sommee\" .  ?e <end_time> ?pv .  }"
  },
  {
    "qid": "train_4260",
    "input_seq": "How was the population figure 499,509 arrived at for the New Jersey county containing the administrative division Morristown?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Morristown\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"499509\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_4261",
    "input_seq": "Is the elevation above sea level of Oceanside less than 310 meters?",
    "target_seq": "ASK { ?e <pred:name> \"Oceanside\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"310\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4262",
    "input_seq": "For which award-winning work was Felicity Huffman nominated for an Academy Award for Best Actress?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Felicity Huffman\" . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4263",
    "input_seq": "Is the elevation (above sea level) of the city of the United States whose postal code is 38301 not equal to 5300 metre ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"38301\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v != \"5300\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4264",
    "input_seq": "For  Ringo Sheena what is the relation to bossa nova?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ringo Sheena\" . ?e_2 <pred:name> \"bossa nova\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4266",
    "input_seq": "Is the work period (start) of the human that received a Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series for Grey's Anatomy outside of 1987?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Grey's Anatomy\" . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1987 ) .  }"
  },
  {
    "qid": "train_4267",
    "input_seq": "How was it determined that the California county whose Dewey Decimal Classification is 2--79462 has a population of 252409?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79462\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"252409\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_4268",
    "input_seq": "What is the Twitter username of the television series with Joan Rivers as a cast member?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Joan Rivers\" .  ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_4269",
    "input_seq": "What is the street address of the private university where Robert Richardson studied?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Robert Richardson\" .  ?e <located_at_street_address> ?pv .  }"
  },
  {
    "qid": "train_4270",
    "input_seq": "Which movie is shorter, Alaska (the one whose duration is 109 minute) or The Opposite of Sex?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Alaska\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"109\"^^xsd:double . } UNION { ?e <pred:name> \"The Opposite of Sex\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4271",
    "input_seq": "Is the run-time longer on San Antonio, composed by Max Steiner, or Shame, released in Hungary?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"San Antonio\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Max Steiner\" .   } UNION { ?e <pred:name> \"Shame\" . ?e <film_release_region> ?e_2 . ?e_2 <pred:name> \"Hungary\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]