[
  {
    "qid": "train_162",
    "input_seq": "What part of the country with the capital of Edinburgh has the demonym of  σκωτσέζος?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Edinburgh\" .  ?e <demonym> ?pv . ?pv <pred:value> \"σκωτσέζος\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_163",
    "input_seq": "What is the connection between Cher (the one whose genre is talk show) to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cher\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"talk show\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_164",
    "input_seq": "How many social groups are in the country of Yugoslavia?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"social group\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <country> ?e_2 . ?e_2 <pred:name> \"Yugoslavia\" .   }"
  },
  {
    "qid": "train_165",
    "input_seq": "Does the visual artwork with the website  http://www.theisland-themovie.com/youhavebeenchosen.html, have the title Народження зірки ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.theisland-themovie.com/youhavebeenchosen.html\" . ?e <title> ?pv . ?pv <pred:value> \"Народження зірки\" .  }"
  },
  {
    "qid": "train_166",
    "input_seq": "What language is associated with the official website http://www.astros.com for the baseball team having Gary Cooper (whose birthdate is 1964-08-13) as a member?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"baseball team\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Gary Cooper\" . ?e_1 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1964-08-13\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.astros.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_167",
    "input_seq": "How many administrative territorial entities of Canada contain Windows Administrative division (postal code N9C) ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity of Canada\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Windsor\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"N9C\" .   }"
  },
  {
    "qid": "train_168",
    "input_seq": "Which names was given at birth to the person with CANTIC-ID a11813751?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11813751\" . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_169",
    "input_seq": "What is the title of the movie with the exploitation visa number 135398?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"135398\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_170",
    "input_seq": "Which movie is longer, Evolution (the one whose director is Ivan Reitman) or Gone Baby Gone?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Evolution\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Ivan Reitman\" .   } UNION { ?e <pred:name> \"Gone Baby Gone\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_171",
    "input_seq": "What is the visual artwork associated with the website http://www.haywiremovie.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.haywiremovie.com\" .  }"
  },
  {
    "qid": "train_172",
    "input_seq": "Does the U.S. city, whose official website is http://www.montgomeryal.gov/ (the language of this statement is English), have a native label equal to مراكش?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.montgomeryal.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <native_label> ?pv . ?pv <pred:value> \"مراكش\" .  }"
  },
  {
    "qid": "train_173",
    "input_seq": "What is the connection between A Serious Man to Ireland (the one whose nominal GDP is 239389340720.488 United States dollar)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Serious Man\" . ?e_2 <pred:name> \"Ireland\" . ?e_2 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"239389340720.488\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_174",
    "input_seq": "Is the person that is buried in Bavaria have an ISNI 0000 0001 2321 5950?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_burial> ?e_1 . ?e_1 <pred:name> \"Bavaria\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2321 5950\" .  }"
  },
  {
    "qid": "train_175",
    "input_seq": "Was the movie titled Howards End published before 1995?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Howards End\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1995 ) .  }"
  },
  {
    "qid": "train_176",
    "input_seq": "What is the connection between Grays Athletic F.C. and association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grays Athletic F.C.\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_177",
    "input_seq": "What is the connection between Dynasty (the one whose duration is 42 minute) to The CW?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dynasty\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"42\"^^xsd:double . ?e_2 <pred:name> \"The CW\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_178",
    "input_seq": "What is the connection between Bob Roberts (the one whose exploitation visa number is 81342) to John Cusack (the one that is the talk show guest of Late Show with David Letterman)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bob Roberts\" . ?e_1 <exploitation_visa_number> ?pv . ?pv <pred:value> \"81342\" . ?e_2 <pred:name> \"John Cusack\" . ?e_3 <talk_show_guest> ?e_2 . ?e_3 <pred:name> \"Late Show with David Letterman\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_179",
    "input_seq": "Which has greater elevation above sea level, Pietermaritzburg or Toowoomba",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pietermaritzburg\" .  } UNION { ?e <pred:name> \"Toowoomba\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_180",
    "input_seq": "What language is used for http://www.danvilleky.org/, the official website for an US city whose postal codes are 40422–40423 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"40422–40423\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.danvilleky.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_181",
    "input_seq": "Is Isfahan 20,000 square miles in size ?",
    "target_seq": "ASK { ?e <pred:name> \"Isfahan\" . ?e <area> ?pv . ?pv <pred:unit> \"square mile\" . ?pv <pred:value> \"20000\"^^xsd:double .  }"
  },
  {
    "qid": "train_182",
    "input_seq": "What is the music genre of the famous band whose official website is http://www.sepultura.com/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music genre\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"band\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.sepultura.com/\" .   }"
  },
  {
    "qid": "train_183",
    "input_seq": "Is Hokkaido's elevation above sea level not 6200 metres?",
    "target_seq": "ASK { ?e <pred:name> \"Hokkaidō\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v != \"6200\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_184",
    "input_seq": "Which one's area is smaller, St. Cloud's or Boca Raton's ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"St. Cloud\" .  } UNION { ?e <pred:name> \"Boca Raton\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_185",
    "input_seq": "What is the connection between Do the Right Thing to Giancarlo Esposito?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Do the Right Thing\" . ?e_2 <pred:name> \"Giancarlo Esposito\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_186",
    "input_seq": "Which has fewer people, Hamilton (the one that is the twinned administrative body of Sacramento) or Geelong?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hamilton\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:name> \"Sacramento\" .   } UNION { ?e <pred:name> \"Geelong\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_187",
    "input_seq": "What is the link between The Patriot that was nominated for an Academy Award for Best Original Score and Mark Gordon whose date of birth is 1956-10-10?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Patriot\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Original Score\" . ?e_2 <pred:name> \"Mark Gordon\" . ?e_2 <date_of_birth> ?pv . ?pv <pred:date> \"1956-10-10\"^^xsd:date . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_188",
    "input_seq": "What is the Libris-URI of the person whose ISNI is 0000 0001 2141 9458?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2141 9458\" . ?e <Libris-URI> ?pv .  }"
  },
  {
    "qid": "train_189",
    "input_seq": "Where was the Il Postino: The Postman published on 1995-12-07?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Il Postino: The Postman\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-12-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_190",
    "input_seq": "Where was the visual artwork titled North by Northwest published on 1959-12-18?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"North by Northwest\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1959-12-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_191",
    "input_seq": "How is Jon Vitti related to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jon Vitti\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_192",
    "input_seq": "Was Dominic Chianese born prior to 1952 ?",
    "target_seq": "ASK { ?e <pred:name> \"Dominic Chianese\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1952 ) .  }"
  },
  {
    "qid": "train_193",
    "input_seq": "How many geographic regions have the demonym, Europea?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <demonym> ?pv . ?pv <pred:value> \"Europea\" .  }"
  },
  {
    "qid": "train_194",
    "input_seq": "What is the connection between Patricia Neal to 36th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Patricia Neal\" . ?e_2 <pred:name> \"36th Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_195",
    "input_seq": "Which has the smallest area among the Arizona counties whose population is not 2.9?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"2.9\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_196",
    "input_seq": "What is the official website of Howard the Duck?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Howard the Duck\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_197",
    "input_seq": "What is the IPTC Newscode associated with the electronic device whose Yahoo Answers category is 396545661?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"electronic device\" . ?e <Yahoo_Answers_category> ?pv_1 . ?pv_1 <pred:value> \"396545661\" . ?e <IPTC_Newscode> ?pv .  }"
  },
  {
    "qid": "train_198",
    "input_seq": "How is novel The Lost Weekend related to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Lost Weekend\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"novel\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_199",
    "input_seq": "How many water areas are either in the location of Corsica (the one whose location is Mediterranean Sea) or share a border with the Atlantic Ocean?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"water area\" .  { ?e_1 <location> ?e . ?e_1 <pred:name> \"Corsica\" . ?e_1 <location> ?e_2 . ?e_2 <pred:name> \"Mediterranean Sea\" .  } UNION { ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Atlantic Ocean\" .  } }"
  },
  {
    "qid": "train_200",
    "input_seq": "How is the Liberal Party of Canada related to the Ontario Liberal Party?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Liberal Party of Canada\" . ?e_2 <pred:name> \"Ontario Liberal Party\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_201",
    "input_seq": "How many 3D movies released later than 2012 made under 4400000 euros at the box office?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"3D film\" . ?e <box_office> ?pv . ?pv <pred:unit> \"euro\" . ?pv <pred:value> ?v . FILTER ( ?v < \"4400000\"^^xsd:double ) . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 2012 ) .  }"
  },
  {
    "qid": "train_202",
    "input_seq": "How was the population figure 266508 determined for the California county that's home to the University of California Santa Cruz?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"University of California Santa Cruz\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"266508\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_203",
    "input_seq": "Where was the visual artwork titled Me and Orson Welles published on 2010-08-26 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Me and Orson Welles\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-08-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_204",
    "input_seq": "What is the connection between The Cleveland Show to Kevin Michael Richardson?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Cleveland Show\" . ?e_2 <pred:name> \"Kevin Michael Richardson\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_205",
    "input_seq": "Does the United States city with the WOEID of 2354842 have its population equal to 9431 (the point in time of this statement is 1890)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2354842\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9431\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 1890 .  }"
  },
  {
    "qid": "train_206",
    "input_seq": "When did the higher education institute with a PermID of 5001115812 have a budget of 19714935 USD?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"5001115812\" . ?e <budget> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"19714935\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <budget> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_207",
    "input_seq": "What person was born in 1872 and directed the film Sabrina (nominated for the Academy Award for Best Production Design)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1872 ) . ?e_1 <director> ?e . ?e_1 <pred:name> \"Sabrina\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Production Design\" .  }"
  },
  {
    "qid": "train_208",
    "input_seq": "Which area is smaller in size, Armstrong County or Butler County (the one whose official website is http://www.co.butler.pa.us)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Armstrong County\" . } UNION { ?e <pred:name> \"Butler County\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.co.butler.pa.us\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_209",
    "input_seq": "What is the connection of vocal jazz to Nat King Cole?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"vocal jazz\" . ?e_2 <pred:name> \"Nat King Cole\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_210",
    "input_seq": "What is the connection between Steve Earle (the one that is related to sport association football) to Leicester City F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Steve Earle\" . ?e_1 <sport> ?e_3 . ?e_3 <pred:name> \"association football\" . ?e_2 <pred:name> \"Leicester City F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_211",
    "input_seq": "how is guitar related to van Morrison",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"guitar\" . ?e_2 <pred:name> \"Van Morrison\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_212",
    "input_seq": "Which movie was made with a lower budget, 2010: The Year We Make Contact or The Nightmare Before Christmas?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"2010: The Year We Make Contact\" .  } UNION { ?e <pred:name> \"The Nightmare Before Christmas\" .  } ?e <budget> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_213",
    "input_seq": "Is the TV station with the Instagram handle cbsnews represented by the website www.cbsnews.com ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television station\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"cbsnews\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cbsnews.com/\" .  }"
  },
  {
    "qid": "train_214",
    "input_seq": "What is the Quora username of the human that is a cast member of Sherlock Holmes: A Game of Shadows, playing the character role of Mycroft Holmes?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Sherlock Holmes: A Game of Shadows\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Mycroft Holmes\" . ?e <Quora_username> ?pv .  }"
  },
  {
    "qid": "train_215",
    "input_seq": "What does Montana, population 537606, have to do with \"mountain\"?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Montana\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"537606\"^^xsd:double . ?e_2 <pred:name> \"mountain\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_216",
    "input_seq": "How many medals are represented by the website www.ieee.org/about/awards/medals/edison.html or were established post-1918?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ieee.org/about/awards/medals/edison.html\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1918 ) .  } }"
  },
  {
    "qid": "train_217",
    "input_seq": "What is the connection between Budapest to Zagreb?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Budapest\" . ?e_2 <pred:name> \"Zagreb\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_218",
    "input_seq": "How many empires were founded before 1497?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1497 ) .  }"
  },
  {
    "qid": "train_219",
    "input_seq": "When was the person born in York (the one whose population is 43718) born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"York\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"43718\"^^xsd:double . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_220",
    "input_seq": "Which has fewer episodes, The Twilight Zone (with 44 episodes) or Babylon 5?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Twilight Zone\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"44\"^^xsd:double . } UNION { ?e <pred:name> \"Babylon 5\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_221",
    "input_seq": "How many diseases are studied by psychotherapy ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e_1 <studies> ?e . ?e_1 <pred:name> \"psychotherapy\" .   }"
  },
  {
    "qid": "train_222",
    "input_seq": "What is the connection between Sociedade Esportiva Palmeiras and association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sociedade Esportiva Palmeiras\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_223",
    "input_seq": "What is the date of birth of person whose ISNI IS 0000 0000 5103 2281?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 5103 2281\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_224",
    "input_seq": "Is the percentage of water area smaller for Rotterdam (official name Rotterdam) or Haarlem?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rotterdam\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Rotterdam\" . } UNION { ?e <pred:name> \"Haarlem\" . } ?e <water_as_percent_of_area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_226",
    "input_seq": "How is the Bulgarian version of Cars 2 related to Bulgaria?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cars 2\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Bulgaria\" . ?e_2 <pred:name> \"Bulgaria\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_227",
    "input_seq": "How is Salma Hayek related to Luis Miguel, her partner?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Salma Hayek\" . ?e_2 <pred:name> \"Luis Miguel\" . ?e_3 <partner> ?e_2 . ?e_3 <pred:name> \"Salma Hayek\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_228",
    "input_seq": "How is France related to the movie Super, which was released in America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Super\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"France\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_229",
    "input_seq": "Tell me the inception time for the basketball team who has the officail website http://www.nba.com/hawks/",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.nba.com/hawks/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_230",
    "input_seq": "What is the Twitter username of the human whose Munzinger IBA is 00000023242?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv_1 . ?pv_1 <pred:value> \"00000023242\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_231",
    "input_seq": "When did Warren County, founded on 1796-12-14, record a population of 113792?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Warren County\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1796-12-14\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"113792\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_232",
    "input_seq": "The visual artwork titled Nebraska was released in what location on 2014-01-16?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nebraska\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2014-01-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_233",
    "input_seq": "Which area has lower elevation above sea level, Brisbane (the one whose local dialing code is 0731) or Belo Horizonte?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brisbane\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"0731\" . } UNION { ?e <pred:name> \"Belo Horizonte\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_234",
    "input_seq": "Is Steven Oscar Seagal's Twitter username sseagalofficial?",
    "target_seq": "ASK { ?e <pred:name> \"Steven Oscar Seagal\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"sseagalofficial\" .  }"
  },
  {
    "qid": "train_235",
    "input_seq": "What is the relationship between Vilnius and Taipei?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vilnius\" . ?e_2 <pred:name> \"Taipei\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_236",
    "input_seq": "When did Harry Nilsson (the one that is the citizen of Sweden) become a member of Sweden national football team?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harry Nilsson\" . ?e_1 <country_of_citizenship> ?e_3 . ?e_3 <pred:name> \"Sweden\" . ?e_2 <pred:name> \"Sweden national football team\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_237",
    "input_seq": "When was the historical country founded in 1137 dissolved?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historical country\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1137 . ?e <dissolved,_abolished_or_demolished> ?pv .  }"
  },
  {
    "qid": "train_238",
    "input_seq": "What is the start date of the Spanish Civil War?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Spanish Civil War\" . ?e <start_time> ?pv .  }"
  },
  {
    "qid": "train_239",
    "input_seq": "What method is used to determine the population of Baldwin County to be 140415?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Baldwin County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"140415\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_241",
    "input_seq": "How is Andy Heyward related to a screenwriter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Andy Heyward\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_242",
    "input_seq": "What is the population of the large city that is recognized as the capital of Newfoundland?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <capital_of> ?e_1 . ?e_1 <pred:name> \"Newfoundland\" .  ?e <population> ?pv .  }"
  },
  {
    "qid": "train_243",
    "input_seq": "The Portrait of a Lady, with Richard E. Grant as a cast member, has what connection to Richard E. Grant?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Portrait of a Lady\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Richard E. Grant\" . ?e_2 <pred:name> \"Richard E. Grant\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_244",
    "input_seq": "Which movie is longer, The Three Musketeers (the one whose genre is musical film) or An Alan Smithee Film: Burn Hollywood Burn?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Three Musketeers\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"musical film\" .   } UNION { ?e <pred:name> \"An Alan Smithee Film: Burn Hollywood Burn\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_245",
    "input_seq": "Is Charles David George Stross the birth name of the person whose ISNI is 0000 0001 2276 7999?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2276 7999\" . ?e <birth_name> ?pv . ?pv <pred:value> \"Charles David George Stross\" .  }"
  },
  {
    "qid": "train_246",
    "input_seq": "Which movie is titled Star Wars: Episode II – Attack of the Clones?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Star Wars: Episode II – Attack of the Clones\" .  }"
  },
  {
    "qid": "train_247",
    "input_seq": "What language is associated with the subreddit Georgia for the state in the United States whose FIPS 5-2 numeric code for US states is 13?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <FIPS_5-2_numeric_code_(US_states)> ?pv_1 . ?pv_1 <pred:value> \"13\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Georgia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  }
]