[
  {
    "qid": "train_4599",
    "input_seq": "What language is associated with this creative work at http://www.regione.calabria.it/, the official website for Calabria?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Calabria\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.regione.calabria.it/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_4600",
    "input_seq": "Which area has higher elevation above sea level, West Hollywood or Inglewood?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"West Hollywood\" .  } UNION { ?e <pred:name> \"Inglewood\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4601",
    "input_seq": "When was Boise established?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Boise\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4602",
    "input_seq": "Matthew Lillard is cast in what role on Looney Tunes: Back in Action, released 2003-01-01?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Looney Tunes: Back in Action\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2003-01-01\"^^xsd:date . ?e_2 <pred:name> \"Matthew Lillard\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4603",
    "input_seq": "What is the class of the award that Saul Bellow received?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Saul Bellow\" .   }"
  },
  {
    "qid": "train_4604",
    "input_seq": "Which movie is shorter, the drama film Paterson or The Stepford Wives (produced by Scott Rudin)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Stepford Wives\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Scott Rudin\" .   } UNION { ?e <pred:name> \"Paterson\" . ?e <genre> ?e_2 . ?e_2 <pred:name> \"drama film\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4606",
    "input_seq": "How is the Chris Brown born on 1961-08-15 related to Houston, where Brent Spiner was born?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chris Brown\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1961-08-15\"^^xsd:date . ?e_2 <pred:name> \"Houston\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Brent Spiner\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4607",
    "input_seq": "How is Detective Conan: Captured in Her Eyes related to Japanese?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Detective Conan: Captured in Her Eyes\" . ?e_2 <pred:name> \"Japanese\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4608",
    "input_seq": "How many high schools are in Manhattan whose FIPS 6-4 (US counties) is 36061 or were attended by James Cagney?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" .  { ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Manhattan\" . ?e_1 <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"36061\" .  } UNION { ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"James Cagney\" .  } }"
  },
  {
    "qid": "train_4609",
    "input_seq": "Which person has less mass, Jade North or Robert Taylor, the 1972 Summer Olympics participant?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jade North\" .  } UNION { ?e <pred:name> \"Robert Taylor\" . ?e <participant_of> ?e_1 . ?e_1 <pred:name> \"1972 Summer Olympics\" .   } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4610",
    "input_seq": "When did the creation of a city in the US, with the official English-language website http://www.cityofdavenportiowa.com, take place?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofdavenportiowa.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4611",
    "input_seq": "Is the Reddit username of the person associated with vocal music serenawilliams?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"vocal music\" .  ?e <Reddit_username> ?pv . ?pv <pred:value> \"serenawilliams\" .  }"
  },
  {
    "qid": "train_4612",
    "input_seq": "What is the subject of this statement: \"South Pacific (the one that has Ray Walston as a cast member) was nominated for Academy Award for Best Original Musical Score\"?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"South Pacific\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Ray Walston\" . ?e_2 <pred:name> \"Academy Award for Best Original Musical Score\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_4613",
    "input_seq": "The person designated by ISNI 0000 0001 1998 6277 established how many dynasties?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <founded_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1998 6277\" .   }"
  },
  {
    "qid": "train_4614",
    "input_seq": "How many bands are noted for trance or have the Giphy handle gorillaz?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" .  { ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"trance\" .  } UNION { ?e <Giphy_username> ?pv . ?pv <pred:value> \"gorillaz\" .  } }"
  },
  {
    "qid": "train_4615",
    "input_seq": "Is the University of Hartford associated with the official website www.hartford.edu ?",
    "target_seq": "ASK { ?e <pred:name> \"University of Hartford\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hartford.edu\" .  }"
  },
  {
    "qid": "train_4616",
    "input_seq": "Ricardo Fuller had how many match appearances for his team, Ipswich Town F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ricardo Fuller\" . ?e_2 <pred:name> \"Ipswich Town F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_4617",
    "input_seq": "What number of Italian regions have the NUTS code of IT33?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of Italy\" . ?e <NUTS_code> ?pv . ?pv <pred:value> \"IT33\" .  }"
  },
  {
    "qid": "train_4618",
    "input_seq": "Which reviewer ranked the national football team of Uzbekistan at 90?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Uzbekistan national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"90\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <review_score_by> ?qpv .  }"
  },
  {
    "qid": "train_4619",
    "input_seq": "Which has more people, Nagasaki or Saginaw?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nagasaki\" .  } UNION { ?e <pred:name> \"Saginaw\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4620",
    "input_seq": "For the U.S. city with the official website of http://www.athensclarkecounty.com/ (the language of this statement is English), what is its local dialing code?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.athensclarkecounty.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <local_dialing_code> ?pv .  }"
  },
  {
    "qid": "train_4621",
    "input_seq": "How many persons are a student of Tony Curtis (whose occupation is poet) or have the ISNI 0000 0001 1469 5876?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" .  { ?e <student_of> ?e_1 . ?e_1 <pred:name> \"Tony Curtis\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"poet\" .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1469 5876\" .  } }"
  },
  {
    "qid": "train_4622",
    "input_seq": "How is rhythm and blues related to Chris Brown with record label Jive Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"rhythm and blues\" . ?e_2 <pred:name> \"Chris Brown\" . ?e_2 <record_label> ?e_3 . ?e_3 <pred:name> \"Jive Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4623",
    "input_seq": "Was the Silver Star created before 1927?",
    "target_seq": "ASK { ?e <pred:name> \"Silver Star\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1927 ) .  }"
  },
  {
    "qid": "train_4624",
    "input_seq": "What's the connection between Roger Federer and the 2000 Summer Olympics?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roger Federer\" . ?e_2 <pred:name> \"2000 Summer Olympics\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4625",
    "input_seq": "Does Denton County or El Paso County (whose population is 828600) have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Denton County\" . } UNION { ?e <pred:name> \"El Paso County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"828600\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4626",
    "input_seq": "Is the population of Penobscot County over 7400 on the date 2013-07-01?",
    "target_seq": "ASK { ?e <pred:name> \"Penobscot County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"7400\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2013-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_4627",
    "input_seq": "At what point in time did Harbin have a population of 5015000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Harbin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5015000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4628",
    "input_seq": "Was the person with a Twitter username JoelDavidMoore born in 1964?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"JoelDavidMoore\" . ?e <date_of_birth> ?pv . ?pv <pred:year> 1964 .  }"
  },
  {
    "qid": "train_4629",
    "input_seq": "What ice hockey team has the official website of http://canucks.nhl.com/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ice hockey team\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://canucks.nhl.com/\" .  }"
  },
  {
    "qid": "train_4630",
    "input_seq": "Which person's native language name is Martin McDonagh?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Martin McDonagh\" .  }"
  },
  {
    "qid": "train_4631",
    "input_seq": "What animated series with less than 30 seasons has the most seasons?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"30\"^^xsd:double ) . ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4632",
    "input_seq": "Where was Yes Man published on 15th Jan 2009 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Yes Man\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-01-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4633",
    "input_seq": "Is the street address of Skidmore College 815 N Broadway, Saratoga Springs, NY, 12866 ?",
    "target_seq": "ASK { ?e <pred:name> \"Skidmore College\" . ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"815 N Broadway, Saratoga Springs, NY, 12866\" .  }"
  },
  {
    "qid": "train_4634",
    "input_seq": "What is the title of Sherlock Holmes whose film poster is  Sherlock Holmes poster.jpg?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sherlock Holmes\" . ?e <film_poster> ?pv_1 . ?pv_1 <pred:value> \"Sherlock Holmes poster.jpg\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_4636",
    "input_seq": "What chemical compound's SPLASH equals splash10-00di-0900000000-53ea38eb25eaea66d22a?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <SPLASH> ?pv . ?pv <pred:value> \"splash10-00di-0900000000-53ea38eb25eaea66d22a\" .  }"
  },
  {
    "qid": "train_4637",
    "input_seq": "Was a person, whose position is starting pitcher, born after 1951 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <position_played_on_team_/_speciality> ?e_1 . ?e_1 <pred:name> \"starting pitcher\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1951 ) .  }"
  },
  {
    "qid": "train_4638",
    "input_seq": "Where was a movie, titled Little Children, published on 26th April 2007 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Little Children\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-04-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4639",
    "input_seq": "How many subscribers does the basketball team that drafted Chris Paul, and has the Twitter username PelicansNBA, have",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" . ?e_1 <drafted_by> ?e . ?e_1 <pred:name> \"Chris Paul\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"PelicansNBA\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4640",
    "input_seq": "How many animes were nominated for a Golden Lion or have Hayao Miyazaki as a film editor?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" .  { ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Golden Lion\" .  } UNION { ?e <film_editor> ?e_1 . ?e_1 <pred:name> \"Hayao Miyazaki\" .  } }"
  },
  {
    "qid": "train_4641",
    "input_seq": "Is the duration of the film whose regional debut venue is Mexico City less than 15 week ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <film_regional_debut_venue> ?e_1 . ?e_1 <pred:name> \"Mexico City\" .  ?e <duration> ?pv . ?pv <pred:unit> \"week\" . ?pv <pred:value> ?v . FILTER ( ?v < \"15\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4642",
    "input_seq": "What is the connection between New York Yankees to baseball?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New York Yankees\" . ?e_2 <pred:name> \"baseball\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4643",
    "input_seq": "Does the smaller run of episodes belong to Santa Barbara, hailing from the USA, or The Incredible Hulk, which had its finale on 1982-06-02?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Santa Barbara\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" . } UNION { ?e <pred:name> \"The Incredible Hulk\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1982-06-02\"^^xsd:date . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4644",
    "input_seq": "Which movie is longer, Dog Day Afternoon or Nixon?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dog Day Afternoon\" .  } UNION { ?e <pred:name> \"Nixon\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4645",
    "input_seq": "What is the connection between Neil Young (the one whose position is midfielder) to England (the one that is the origin country of rugby league)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Neil Young\" . ?e_1 <position_played_on_team_/_speciality> ?e_3 . ?e_3 <pred:name> \"midfielder\" . ?e_2 <pred:name> \"England\" . ?e_4 <country_of_origin> ?e_2 . ?e_4 <pred:name> \"rugby league\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4646",
    "input_seq": "Regarding the association football club that has Keith Andrews as a member (the statement was started on 2014-01-01), is the official name Αθλητικός Ποδοσφαιρικός Όμιλος Ελλήνων Λευκωσίας ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Keith Andrews\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Αθλητικός Ποδοσφαιρικός Όμιλος Ελλήνων Λευκωσίας\" .  }"
  },
  {
    "qid": "train_4647",
    "input_seq": "Which movie is longer, The Turning Point (the one that was nominated for Academy Award for Best Production Design) or Beauty and the Beast (the one whose producer is Yoram Globus)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Turning Point\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Production Design\" .   } UNION { ?e <pred:name> \"Beauty and the Beast\" . ?e <producer> ?e_2 . ?e_2 <pred:name> \"Yoram Globus\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4648",
    "input_seq": "Which has the smallest population among the non-metropolitan districts whose population is less than 76000?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan district\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"76000\"^^xsd:double ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4649",
    "input_seq": "Which is shorter, Girl with a Pearl Earring or J. Edgar?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Girl with a Pearl Earring\" .  } UNION { ?e <pred:name> \"J. Edgar\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4650",
    "input_seq": "What video game developer is a subsidiary of Take-Two Interactive?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e_1 <subsidiary> ?e . ?e_1 <pred:name> \"Take-Two Interactive\" .   }"
  },
  {
    "qid": "train_4651",
    "input_seq": "For the person with the ISNI of 0000 0000 7841 1046 does he or she have a pseudonym of Peter Joshua?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7841 1046\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Peter Joshua\" .  }"
  },
  {
    "qid": "train_4652",
    "input_seq": "Who was nominated for an Academy Award for Best Supporting Actor for The Hurricane produced by Samuel Goldwyn?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Hurricane\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Samuel Goldwyn\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_4653",
    "input_seq": "How many Michigan counties have FIPS 6-4 (US counties) code 26115 or other than 3.4 in population?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Michigan\" .  { ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"26115\" .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"3.4\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_4654",
    "input_seq": "Which has less area, Allen County whose population is 106372 or Jefferson County that has the captital Steubenville?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Allen County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"106372\"^^xsd:double . } UNION { ?e <pred:name> \"Jefferson County\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Steubenville\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4655",
    "input_seq": "How many legislative terms followed the 27th United States Congress or concluded at a date other than 1849?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"legislative term\" .  { ?e_1 <followed_by> ?e . ?e_1 <pred:name> \"27th United States Congress\" .  } UNION { ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1849 ) .  } }"
  },
  {
    "qid": "train_4656",
    "input_seq": "Who among Jane Eyre (the one whose director is Franco Zeffirelli) and Heaven's Gate has a greater cost ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jane Eyre\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"Franco Zeffirelli\" .   } UNION { ?e <pred:name> \"Heaven's Gate\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4657",
    "input_seq": "How many prefectures of Japan share a border with the city whose Twitter username is tocho_koho with 1187028 subscribers?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"prefecture of Japan\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city\" . ?e_1 <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"tocho_koho\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1187028\"^^xsd:double .   }"
  },
  {
    "qid": "train_4658",
    "input_seq": "How many subscribers does the person with the ISNI of 0000 0000 3632 2483 have under the Twitter username of realhartman?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 3632 2483\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"realhartman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4659",
    "input_seq": "How many actors do we know whose ROME Occupation Code (v3) is L1204  or whose occupation matches F. Murray Abraham's ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" .  { ?e_1 <occupation> ?e . ?e_1 <pred:name> \"F. Murray Abraham\" .  } UNION { ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1204\" .  } }"
  },
  {
    "qid": "train_4660",
    "input_seq": "When did Dallas (the one whose number of seasons is 14) begin?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dallas\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"14\"^^xsd:double . ?e <start_time> ?pv .  }"
  },
  {
    "qid": "train_4661",
    "input_seq": "What is the date of birth for the person whose PhilPapers topic is jacques-derrida?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <PhilPapers_topic> ?pv_1 . ?pv_1 <pred:value> \"jacques-derrida\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_4662",
    "input_seq": "How many real properties have تاج محل as their native label?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"real property\" . ?e <native_label> ?pv . ?pv <pred:value> \"تاج محل\" .  }"
  },
  {
    "qid": "train_4663",
    "input_seq": "Is the ending date of the television series that has Tom Hanks as an executive producer after the year 1897?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <executive_producer> ?e_1 . ?e_1 <pred:name> \"Tom Hanks\" .  ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1897 ) .  }"
  },
  {
    "qid": "train_4664",
    "input_seq": "What relation type does C0041466, the UMLS CUI of the disease whose death number is equal to 161000, map to?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"161000\"^^xsd:double . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0041466\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS_CUI> ; <pred:fact_t> ?pv ] <mapping_relation_type> ?qpv .  }"
  },
  {
    "qid": "train_4665",
    "input_seq": "Was the member of the Houston Dynamo born before 1952?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Houston Dynamo\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1952 ) .  }"
  },
  {
    "qid": "train_4666",
    "input_seq": "Does Final Fantasy: The Spirits Within or Tess have the shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Final Fantasy: The Spirits Within\" .  } UNION { ?e <pred:name> \"Tess\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4667",
    "input_seq": "How is the guitarist Adam Horowitz related to the guitar?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Adam Horowitz\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"guitarist\" . ?e_2 <pred:name> \"guitar\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4668",
    "input_seq": "For the human whose ISNI is 0000 0001 2124 7588, how many subscribers does the user have for his Twitter username of Jon_Favreau?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2124 7588\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Jon_Favreau\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_4669",
    "input_seq": "Is the above sea level elevation of the city of the United States whose official website is http://www.ci.brockton.ma.us/ less than 6800 metres?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ci.brockton.ma.us/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"6800\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4670",
    "input_seq": "When did the Washington county whose official website is http://www.yakimacounty.us have a population of 244173?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.yakimacounty.us\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"244173\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4671",
    "input_seq": "The sovereign country of how many California counties has the demonym アメリカ人 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"アメリカ人\" .   }"
  },
  {
    "qid": "train_4672",
    "input_seq": "What award was received by Manoj Kumar (whose profession is screenwriter) that relates to the award-winning work Roti Kapda Aur Makaan?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Manoj Kumar\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"screenwriter\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"Roti Kapda Aur Makaan\" .  }"
  },
  {
    "qid": "train_4673",
    "input_seq": "What crime has the IPTC Newscode mediatopic/20000100?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000100\" .  }"
  },
  {
    "qid": "train_4674",
    "input_seq": "What is the connection between I Spy (the one that uses the language English) to comedy-drama?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"I Spy\" . ?e_1 <language_of_work_or_name> ?e_3 . ?e_3 <pred:name> \"English\" . ?e_2 <pred:name> \"comedy-drama\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4675",
    "input_seq": "How long is the TV film titled Python?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Python\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_4676",
    "input_seq": "The person with Munzinger IBA 00000019929 has how many religious belief systems?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"belief system\" . ?e_1 <religion> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000019929\" .   }"
  },
  {
    "qid": "train_4677",
    "input_seq": "Does Syracuse (whose Italian cadastre code is I754) or Bratislava have less land area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Syracuse\" . ?e <Italian_cadastre_code> ?pv_1 . ?pv_1 <pred:value> \"I754\" . } UNION { ?e <pred:name> \"Bratislava\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4678",
    "input_seq": "In how many television series that had been derived from literary work have worked Anthony Hopkins as a cast member?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"television series\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Anthony Hopkins\" .   }"
  }
]