[
  {
    "qid": "train_816",
    "input_seq": "What activity has an edition number of 96?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <edition_number> ?pv . ?pv <pred:value> \"96\" .  }"
  },
  {
    "qid": "train_817",
    "input_seq": "What association football club has the official website http://www.sb29.bzh and is French?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sb29.bzh\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"France\" .  }"
  },
  {
    "qid": "train_818",
    "input_seq": "When was the person with ISNI 0000 0001 1446 7910 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1446 7910\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_819",
    "input_seq": "Is the ISNI of the person that died in Kingston where Ziggy Marley was born 0000 0004 1936 7822 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_death> ?e_1 . ?e_1 <pred:name> \"Kingston\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Ziggy Marley\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 7822\" .  }"
  },
  {
    "qid": "train_820",
    "input_seq": "What is the street address of the University that is located in Akron (whose establishment date is 1825)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Akron\" . ?e_1 <inception> ?pv_1 . ?pv_1 <pred:year> 1825 . ?e <located_at_street_address> ?pv .  }"
  },
  {
    "qid": "train_821",
    "input_seq": "When was  The Conversation nominated for BAFTA Award for Best Direction?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Conversation\" . ?e_2 <pred:name> \"BAFTA Award for Best Direction\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_822",
    "input_seq": "Is OSM tag or key for family medicine Tag:healthcare:speciality=general ?",
    "target_seq": "ASK { ?e <pred:name> \"family medicine\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:healthcare:speciality=general\" .  }"
  },
  {
    "qid": "train_823",
    "input_seq": "When was Wake Forest University founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wake Forest University\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_824",
    "input_seq": "tell me other person with the ISNI of 0000 0003 6859 3263",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 6859 3263\" .  }"
  },
  {
    "qid": "train_825",
    "input_seq": "Is the population of the county of Maryland whose PermID is 4296872874 less than 0.1 in 2012-07-01?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"4296872874\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"0.1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2012-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_826",
    "input_seq": "Is the motor vehicle designed to carry humans has the MIL-STD-2525 Symbol Identification Code as same as 10014000001306000000?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"motor vehicle\" . ?e <designed_to_carry> ?e_1 . ?e_1 <pred:name> \"human\" .  ?e <MIL-STD-2525_Symbol_Identification_Code> ?pv . ?pv <pred:value> \"10014000001306000000\" .  }"
  },
  {
    "qid": "train_827",
    "input_seq": "How many groups of organisms recognized by one specific common name are depicted in Bangor (whose width is 121 millimeters)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group of organisms known by one particular common name\" . ?e_1 <depicts> ?e . ?e_1 <pred:name> \"Bangor\" . ?e_1 <width> ?pv . ?pv <pred:unit> \"millimetre\" . ?pv <pred:value> \"121\"^^xsd:double .   }"
  },
  {
    "qid": "train_828",
    "input_seq": "How is the 218 pound Dave Thomas connected to cornerback?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dave Thomas\" . ?e_1 <mass> ?pv . ?pv <pred:unit> \"pound\" . ?pv <pred:value> \"218\"^^xsd:double . ?e_2 <pred:name> \"cornerback\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_829",
    "input_seq": "How is Martin McDonagh related to the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Martin McDonagh\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_830",
    "input_seq": "Does Abhishek Bachchan or Shahrukh Khan have more offspring?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Abhishek Bachchan\" .  } UNION { ?e <pred:name> \"Shahrukh Khan\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_831",
    "input_seq": "Who did Trey Parker share a Tony Award for Best Direction of a Musical with?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Trey Parker\" . ?e_2 <pred:name> \"Tony Award for Best Direction of a Musical\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <together_with> ?qpv .  }"
  },
  {
    "qid": "train_832",
    "input_seq": "I want to know the one with the least watershed area within the river that has a watershed area not exactly 4500000 square kilometre",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <watershed_area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"4500000\"^^xsd:double ) . ?e <watershed_area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_833",
    "input_seq": "Does Marquette University or the California College of the Arts have fewer students?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Marquette University\" .  } UNION { ?e <pred:name> \"California College of the Arts\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_834",
    "input_seq": "How many studio albums are there whose nickname is Melt or publication date is before 1969?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"studio album\" .  { ?e <nickname> ?pv . ?pv <pred:value> \"Melt\" .  } UNION { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1969 ) .  } }"
  },
  {
    "qid": "train_835",
    "input_seq": "Does British Museum person-institution # 45734 match to the person with Biografisch Portaal # 16265204 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Biografisch_Portaal_number> ?pv_1 . ?pv_1 <pred:value> \"16265204\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"45734\" .  }"
  },
  {
    "qid": "train_836",
    "input_seq": "Which media franchise whose number of episodes is not 13000 has the most episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"media franchise\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"13000\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_837",
    "input_seq": "What association football club has the Instagram username elchecfoficial and is located in the country of Spain?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"elchecfoficial\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Spain\" .  }"
  },
  {
    "qid": "train_838",
    "input_seq": "How is Tangled, a famous work of Alan Menken, related to Tangled, the English language version?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tangled\" . ?e_3 <notable_work> ?e_1 . ?e_3 <pred:name> \"Alan Menken\" . ?e_2 <pred:name> \"Tangled\" . ?e_2 <language_of_work_or_name> ?e_4 . ?e_4 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_839",
    "input_seq": "State College occupies how much area?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"State College\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_840",
    "input_seq": "About the visual artwork with the official website http://marvel.com/movies/movie/130/iron_man_2, and having attendance 918409, where did it get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://marvel.com/movies/movie/130/iron_man_2\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"918409\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_841",
    "input_seq": "Show me the relationship between Sydney Olympic FC to Association football",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sydney Olympic FC\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_842",
    "input_seq": "How is the England and Wales cricket team related to cricket?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"England and Wales cricket team\" . ?e_2 <pred:name> \"cricket\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_843",
    "input_seq": "How is the genre pop rock related to Ashley Tisdale?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"pop rock\" . ?e_2 <pred:name> \"Ashley Tisdale\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_844",
    "input_seq": "What is the number of feature films that are distributed in the United Kingdom and have a box office that is not 150000000 United States dollars?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <film_distribute_region> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  ?e <box_office> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> ?v . FILTER ( ?v != \"150000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_845",
    "input_seq": "At what time point was Ian McEwan nominated for the International IMPAC Dublin Literary Award?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ian McEwan\" . ?e_2 <pred:name> \"International IMPAC Dublin Literary Award\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_846",
    "input_seq": "How many studio albums with a 3.1-year run-time hail from the UK?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"studio album\" . ?e <duration> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> \"3.1\"^^xsd:double . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  }"
  },
  {
    "qid": "train_847",
    "input_seq": "Which movie is longer, Julie & Julia or That Thing You Do!?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Julie & Julia\" .  } UNION { ?e <pred:name> \"That Thing You Do!\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_848",
    "input_seq": "Which area is smaller, Somerset County (the one whose population is 326466) or Atlantic County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Somerset County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"326466\"^^xsd:double . } UNION { ?e <pred:name> \"Atlantic County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_849",
    "input_seq": "How many subscribers are there for the Twitter username neilhimself of Neil Gaiman?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Neil Gaiman\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"neilhimself\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_851",
    "input_seq": "What is the inauguration date for the governor whose official website is http://governor.ky.gov/ (in English)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_852",
    "input_seq": "Does the Pete Townshend script of Quadrophenia have a title that is equivalent to La vita è bella?",
    "target_seq": "ASK { ?e <pred:name> \"Quadrophenia\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Pete Townshend\" .  ?e <title> ?pv . ?pv <pred:value> \"La vita è bella\" .  }"
  },
  {
    "qid": "train_853",
    "input_seq": "How many museums have the Instagram username of themuseumofmodernart or are the employer of Wonder Woman (the one that lives in a lifestyle of superhero)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" .  { ?e <Instagram_username> ?pv . ?pv <pred:value> \"themuseumofmodernart\" .  } UNION { ?e_1 <employer> ?e . ?e_1 <pred:name> \"Wonder Woman\" . ?e_1 <lifestyle> ?e_2 . ?e_2 <pred:name> \"superhero\" .  } }"
  },
  {
    "qid": "train_854",
    "input_seq": "How many California counties have a population less than 4900000000 and greater than 2400?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"4900000000\"^^xsd:double ) . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"2400\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_855",
    "input_seq": "What is the start time of Antwerp (the one whose NIS/INS code is 11002) as the twinned administrative body of Barcelona (the one whose population is 405913)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Antwerp\" . ?e_1 <NIS/INS_code> ?pv . ?pv <pred:value> \"11002\" . ?e_2 <pred:name> \"Barcelona\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"405913\"^^xsd:double . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_856",
    "input_seq": "Does the television series with the start time on 1993-01-31 have a duration not equal to 1900 seconds?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1993-01-31\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:unit> \"second\" . ?pv <pred:value> ?v . FILTER ( ?v != \"1900\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_857",
    "input_seq": "How many matches did Mohammed Kallon play as the member of A.E.K. Athens F.C. ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mohamed Kallon\" . ?e_2 <pred:name> \"A.E.K. Athens F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_matches_played/races/starts> ?qpv .  }"
  },
  {
    "qid": "train_858",
    "input_seq": "Which person executive produced the movie represented by the website www2.warnerbros.com/16blocks?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <executive_producer> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www2.warnerbros.com/16blocks/index.html\" .   }"
  },
  {
    "qid": "train_859",
    "input_seq": "University of Utah's official website at https://www.utah.edu is in which language?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"University of Utah\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.utah.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_860",
    "input_seq": "What is the Libris-URI for the person with the ISNI of 0000 0001 0920 8949?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0920 8949\" . ?e <Libris-URI> ?pv .  }"
  },
  {
    "qid": "train_861",
    "input_seq": "When did Denver become the twinned administrative body of Chennai?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Denver\" . ?e_2 <pred:name> \"Chennai\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_862",
    "input_seq": "Who is the producer of Seal (the one whose genre is new jack swing)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <producer> ?e . ?e_1 <pred:name> \"Seal\" . ?e_1 <genre> ?e_2 . ?e_2 <pred:name> \"new jack swing\" .   }"
  },
  {
    "qid": "train_863",
    "input_seq": "When did the United States state (in the subject of Kansas–Nebraska border) that shares a border with Nebraska (which is headed by an attorney general) have a population of 1880999?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Nebraska\" . ?e_1 <office_held_by_head_of_government> ?e_2 . ?e_2 <pred:name> \"attorney general\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"Kansas–Nebraska border\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1880999\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_864",
    "input_seq": "What is the connection between Bolt (the one whose official website is http://movies.disney.com/bolt) to Portugal?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bolt\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://movies.disney.com/bolt\" . ?e_2 <pred:name> \"Portugal\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_865",
    "input_seq": "What is the language of the Houston Aeros' official website http://www.aeros.com/?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Houston Aeros\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.aeros.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_866",
    "input_seq": "Are there more employees at Genentech or Harland and Wolff?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Genentech\" .  } UNION { ?e <pred:name> \"Harland and Wolff\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_867",
    "input_seq": "What university has mixed sex education and is located at 414 E Clark St, Vermillion, SD, 57069-2390?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <significant_event> ?e_1 . ?e_1 <pred:name> \"mixed-sex education\" .  ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"414 E Clark St, Vermillion, SD, 57069-2390\" .  }"
  },
  {
    "qid": "train_868",
    "input_seq": "When did Korea become a part of the Empire of Japan?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Korea\" . ?e_2 <pred:name> \"Empire of Japan\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_869",
    "input_seq": "How many cities are the main subject of the print work titled Bangor?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <main_subject> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"print\" . ?e_1 <title> ?pv_1 . ?pv_1 <pred:value> \"Bangor\" .   }"
  },
  {
    "qid": "train_870",
    "input_seq": "How many subscribers does the human that won a Saturn Award for Best Actress (for Strange Days) have under the Twitter username ImAngelaBassett?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Saturn Award for Best Actress\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv_1 . ?qpv_1 <pred:value> \"Strange Days\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"ImAngelaBassett\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_871",
    "input_seq": "Is 27417158 the OCLC control number fo the written work published in 1978?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> 1978 . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"27417158\" .  }"
  },
  {
    "qid": "train_872",
    "input_seq": "Which animated movie is titled Hotel Transylvania and has hotelt as its Giphy username?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <title> ?pv . ?pv <pred:value> \"Hotel Transylvania\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"hotelt\" .  }"
  },
  {
    "qid": "train_873",
    "input_seq": "What is the ISNI of George Benson who was born in Cardiff?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"George Benson\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Cardiff\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_874",
    "input_seq": "When did the island whose country is Iceland (the one that is the release region of Prometheus) (the start time of this statement is 1944) have a population of 321857?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Iceland\" . ?e_2 <film_release_region> ?e_1 . ?e_2 <pred:name> \"Prometheus\" . [ <pred:fact_h> ?e ; <pred:fact_r> <country> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:year> 1944 . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"321857\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_876",
    "input_seq": "Was the English version of Arthur Conan Doyle released in 1998?",
    "target_seq": "ASK { ?e <pred:name> \"Arthur Conan Doyle\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1998 ) .  }"
  },
  {
    "qid": "train_878",
    "input_seq": "How many California counties were either founded after 1850 or have the ISNI of 0000 0004 0638 6311?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1850 ) .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0638 6311\" .  } }"
  },
  {
    "qid": "train_879",
    "input_seq": "What is the native language name of the human biblical figure named Сын Человеческий?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human biblical figure\" . ?e <name> ?pv_1 . ?pv_1 <pred:value> \"Сын Человеческий\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_880",
    "input_seq": "ISNI 0000 0000 3349 8125 designates the person born on which date?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 3349 8125\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_881",
    "input_seq": "Does Waterloo (elevation 269 meters above sea level) or Natchitoches have a smaller population?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Waterloo\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"269\"^^xsd:double . } UNION { ?e <pred:name> \"Natchitoches\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_882",
    "input_seq": "Who has a greater mass, Mark Johnson at 82 kg, or blond Devon?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mark Johnson\" . ?e <mass> ?pv_1 . ?pv_1 <pred:unit> \"kilogram\" . ?pv_1 <pred:value> \"82\"^^xsd:double . } UNION { ?e <pred:name> \"Devon\" . ?e <hair_color> ?e_1 . ?e_1 <pred:name> \"blond\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_883",
    "input_seq": "On 2012-07-01, was the population in the county of New Jersey with the FIPS 6-4 (US counties) of 34029 not 66000000?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"34029\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"66000000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2012-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_884",
    "input_seq": "Who is the one that is educated at the University of Houston and has the LinkedIn personal profile URL https://www.linkedin.com/in/monicarial/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"University of Houston\" .  ?e <LinkedIn_personal_profile_URL> ?pv . ?pv <pred:value> \"https://www.linkedin.com/in/monicarial/\" .  }"
  },
  {
    "qid": "train_885",
    "input_seq": "Which human has a date of birth not in 1948 and an ISNI of 0000 0001 1063 7097?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1948 ) . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1063 7097\" .  }"
  },
  {
    "qid": "train_886",
    "input_seq": "which person has less children, Tim Burton or Chris Cornell?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tim Burton\" .  } UNION { ?e <pred:name> \"Chris Cornell\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_887",
    "input_seq": "Which area of the country Weimar Republic has highest elevation (above sea level) in state of Germany?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Weimar Republic\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_888",
    "input_seq": "What is the connection between Grimsby (the one whose genre is adventure film) to Ian McShane (the one whose birth name is Ian David McShane)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grimsby\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"adventure film\" . ?e_2 <pred:name> \"Ian McShane\" . ?e_2 <birth_name> ?pv . ?pv <pred:value> \"Ian David McShane\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_889",
    "input_seq": "Which is longer, Bury My Heart at Wounded Knee or Flight, published 2012-01-01?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bury My Heart at Wounded Knee\" . } UNION { ?e <pred:name> \"Flight\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2012-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_890",
    "input_seq": "What is the ISNI which applies to the Liberal Party of Australia?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Liberal Party of Australia\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_891",
    "input_seq": "What is the title of A Star Is Born with Lady Gaga?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"A Star Is Born\" . ?e <performer> ?e_1 . ?e_1 <pred:name> \"Lady Gaga\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_892",
    "input_seq": "When did Cairo (the one whose population is 313400) become the twinned administrative body of Amman?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cairo\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"313400\"^^xsd:double . ?e_2 <pred:name> \"Amman\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_893",
    "input_seq": "What has  America America in common with Barcelona, with population of 1,655,603?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"America America\" . ?e_2 <pred:name> \"Barcelona\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1655603\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_894",
    "input_seq": "How is Solitary Man related to Long Island which borders Connecticut?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Solitary Man\" . ?e_2 <pred:name> \"Long Island\" . ?e_2 <shares_border_with> ?e_3 . ?e_3 <pred:name> \"Connecticut\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_895",
    "input_seq": "When was the movie composed by Himesh Reshammiya published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Himesh Reshammiya\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_896",
    "input_seq": "Which person was born on 1982-03-20?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1982-03-20\"^^xsd:date .  }"
  },
  {
    "qid": "train_897",
    "input_seq": "What sound has the inception time of 2001 and has William Orbit among its famous people?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <inception> ?pv . ?pv <pred:year> 2001 . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"William Orbit\" .  }"
  }
]