[
  {
    "qid": "train_2624",
    "input_seq": "What is the connection between Michigan to Livingston County (the one whose population is 183095)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michigan\" . ?e_2 <pred:name> \"Livingston County\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"183095\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2625",
    "input_seq": "I want to know the relationship between Japan and Aichi Prefecture",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Aichi Prefecture\" . ?e_2 <pred:name> \"Japan\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2626",
    "input_seq": "What person received the medal whose official website is https://royalsociety.org/grants-schemes-awards/awards/copley-medal/ because it is an award In recognition of his distinguished work in the development of the quantum theory of atomic structure?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"medal\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"https://royalsociety.org/grants-schemes-awards/awards/copley-medal/\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <award_rationale> ?qpv . ?qpv <pred:value> \"In recognition of his distinguished work in the development of the quantum theory of atomic structure.\" .  }"
  },
  {
    "qid": "train_2627",
    "input_seq": "Did Chicago (the one that was nominated for BAFTA Award for Best Film) cost more than 110 million Australian dollars ?",
    "target_seq": "ASK { ?e <pred:name> \"Chicago\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Film\" .  ?e <cost> ?pv . ?pv <pred:unit> \"Australian dollar\" . ?pv <pred:value> ?v . FILTER ( ?v > \"110000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2628",
    "input_seq": "How is Chihuahua where Anthony Quinn was born related to Nashville which is the twinned administrative body of Magdeburg?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chihuahua\" . ?e_3 <place_of_birth> ?e_1 . ?e_3 <pred:name> \"Anthony Quinn\" . ?e_2 <pred:name> \"Nashville\" . ?e_2 <twinned_administrative_body> ?e_4 . ?e_4 <pred:name> \"Magdeburg\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2629",
    "input_seq": "Does Gosford Park or The Remains of the Day have the shorter runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Gosford Park\" .  } UNION { ?e <pred:name> \"The Remains of the Day\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2630",
    "input_seq": "When did Tate Donovan win a SAG Award for Outstanding Performance by a Cast in a Motion Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture\" . ?e_2 <pred:name> \"Tate Donovan\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2631",
    "input_seq": "What is Lil Wayne’s Twitter username?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lil Wayne\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_2632",
    "input_seq": "Charles University or Mills College what one has greater students number?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Charles University\" .  } UNION { ?e <pred:name> \"Mills College\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2633",
    "input_seq": "How many people subscribe to the National Park Service under the Twitter username NatlParkService?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"National Park Service\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"NatlParkService\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2634",
    "input_seq": "What is the relationship between Michael Winterbottom (the one that is an employee of University of Oxford) and English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Winterbottom\" . ?e_1 <employer> ?e_3 . ?e_3 <pred:name> \"University of Oxford\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2635",
    "input_seq": "Is the birthdate of a cast member of Buffy the Vampire Slayer (the one that has Alyson Hannigan as a cast member)  earlier than in 1951, if we know that the character role of this person is Tara Maclay?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Buffy the Vampire Slayer\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Alyson Hannigan\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e ] <character_role> ?qpv . ?qpv <pred:value> \"Tara Maclay\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1951 ) .  }"
  },
  {
    "qid": "train_2636",
    "input_seq": "What is the subject of 'nominated for' in 'Airport (the one that has Maureen Stapleton as a cast member) was nominated for Academy Award for Best Production Design' ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Airport\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Maureen Stapleton\" . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2637",
    "input_seq": "How many plays mainly depict alcoholism or whose title is The Life of Henry the Fifth?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" .  { ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"alcoholism\" .  } UNION { ?e <title> ?pv . ?pv <pred:value> \"The Life of Henry the Fifth\" .  } }"
  },
  {
    "qid": "train_2638",
    "input_seq": "How many subscribers are there for the Twitter username Titans belonging to the American football team whose official website is http://www.titansonline.com (this statement's language is English)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.titansonline.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv_1 . ?qpv_1 <pred:value> \"English\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Titans\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2639",
    "input_seq": "How many keyboard instruments' country is Malaysia and UNSPSC Code is 60131002?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"keyboard instrument\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Malaysia\" .  ?e <UNSPSC_Code> ?pv . ?pv <pred:value> \"60131002\" .  }"
  },
  {
    "qid": "train_2640",
    "input_seq": "What was the cost of the film Superman Returns?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Superman Returns\" . ?e <cost> ?pv .  }"
  },
  {
    "qid": "train_2641",
    "input_seq": "Which television series started on 1989-09-09?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <start_time> ?pv . ?pv <pred:date> \"1989-09-09\"^^xsd:date .  }"
  },
  {
    "qid": "train_2642",
    "input_seq": "Is My Man Godfrey (released 1957-01-01) or Hercules (98 minutes long) shorter in duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"My Man Godfrey\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"Hercules\" . ?e <duration> ?pv_2 . ?pv_2 <pred:unit> \"minute\" . ?pv_2 <pred:value> \"98\"^^xsd:double . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2643",
    "input_seq": "Where was 2010: The Year We Make Contact, which was published on 1984-12-07, published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"2010: The Year We Make Contact\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1984-12-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2644",
    "input_seq": "Which academic discipline studies English literature and studies English?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <studies> ?e_1 . ?e_1 <pred:name> \"English literature\" .  ?e <studies> ?e_2 . ?e_2 <pred:name> \"English\" .  }"
  },
  {
    "qid": "train_2645",
    "input_seq": "What is the origination date of the political party whose CANTIC-ID is a11264159?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11264159\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2646",
    "input_seq": "What is the connection between trumpet to Terence Blanchard?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"trumpet\" . ?e_2 <pred:name> \"Terence Blanchard\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2647",
    "input_seq": "What is the connection between Appleseed Ex Machina to John Woo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Appleseed Ex Machina\" . ?e_2 <pred:name> \"John Woo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2648",
    "input_seq": "Which CANTIC-ID belongs to the James Madison who died on 1836-06-28?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"James Madison\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1836-06-28\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_2649",
    "input_seq": "Between the Mona Lisa, composed by Michael Kamen, and The Lord of the Rings: The Two Towers, scripted by Fran Walsh, which is longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mona Lisa\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Michael Kamen\" .   } UNION { ?e <pred:name> \"The Lord of the Rings: The Two Towers\" . ?e <screenwriter> ?e_2 . ?e_2 <pred:name> \"Fran Walsh\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2650",
    "input_seq": "What character did Bryce Dallas Howard play in Terminator Salvation, which originated in the USA?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Terminator Salvation\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Bryce Dallas Howard\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2651",
    "input_seq": "Does Michigan State University or North Carolina State University have more students?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Michigan State University\" .  } UNION { ?e <pred:name> \"North Carolina State University\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2652",
    "input_seq": "What is the relationship between Utah (the one that contains Cache County) and Tooele County?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Utah\" . ?e_3 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_3 <pred:name> \"Cache County\" . ?e_2 <pred:name> \"Tooele County\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2653",
    "input_seq": "Is Johnny Depp's Libris-URI 31fhh7dm1l4nvml?",
    "target_seq": "ASK { ?e <pred:name> \"Johnny Depp\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"31fhh7dm1l4nvml\" .  }"
  },
  {
    "qid": "train_2654",
    "input_seq": "What is the connection between John Mayer (the one that plays the instrument mandolin) to rock music?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Mayer\" . ?e_1 <instrument> ?e_3 . ?e_3 <pred:name> \"mandolin\" . ?e_2 <pred:name> \"rock music\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2655",
    "input_seq": "How many points has Giovani dos Santos scored as a member of Villarreal Club de Fútbol?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Giovani dos Santos\" . ?e_2 <pred:name> \"Villarreal Club de Fútbol\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_points/goals/set_scored> ?qpv .  }"
  },
  {
    "qid": "train_2656",
    "input_seq": "Where was the visual artwork with official website http://www.foxmovies.com/greatexpectations/main.html published on 1998-03-05?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.foxmovies.com/greatexpectations/main.html\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-03-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2657",
    "input_seq": "How many higher education institutions have UK Provider Reference Number 10007795 or whose ISNI is 0000 0001 0659 2404?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" .  { ?e <UK_Provider_Reference_Number> ?pv . ?pv <pred:value> \"10007795\" .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0659 2404\" .  } }"
  },
  {
    "qid": "train_2658",
    "input_seq": "How many Academy Awards ceremonies were longer than 12.6 hours?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <duration> ?pv . ?pv <pred:unit> \"hour\" . ?pv <pred:value> ?v . FILTER ( ?v > \"12.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2659",
    "input_seq": "Does the human, drafted by the Golden State Warriors, have a height greater than 1.8 metre?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <drafted_by> ?e_1 . ?e_1 <pred:name> \"Golden State Warriors\" .  ?e <height> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1.8\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2661",
    "input_seq": "What 78-minute film stars cast member Marlon Wayans?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"78\"^^xsd:double . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Marlon Wayans\" .  }"
  },
  {
    "qid": "train_2662",
    "input_seq": "What is the title of the film that has Ken Burns as a cast member?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Ken Burns\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2663",
    "input_seq": "Is the subreddit of Loyola University Chicago UTokyo?",
    "target_seq": "ASK { ?e <pred:name> \"Loyola University Chicago\" . ?e <subreddit> ?pv . ?pv <pred:value> \"UTokyo\" .  }"
  },
  {
    "qid": "train_2664",
    "input_seq": "What state of Germany is the location of the industry whose site is in East Prussia?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e_1 <location> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"industry\" . ?e_1 <location> ?e_2 . ?e_2 <pred:name> \"East Prussia\" .   }"
  },
  {
    "qid": "train_2665",
    "input_seq": "What is the connection between Iron Man (the one whose release region is Netherlands) to Satellite Awards 2008?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Iron Man\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Netherlands\" . ?e_2 <pred:name> \"Satellite Awards 2008\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2666",
    "input_seq": "What is the release region of the film that is based on Stardust (whose ISBN-10 is 972-23-3140-X) and has the release date 2007-10-18?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"Stardust\" . ?e_1 <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"972-23-3140-X\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-10-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2667",
    "input_seq": "Which is longer Talk to Her or Dreamgirls?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Talk to Her\" .  } UNION { ?e <pred:name> \"Dreamgirls\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2668",
    "input_seq": "Is the title of Spellbound, the 97 minute one, Twelfth Night: Or What You Will?",
    "target_seq": "ASK { ?e <pred:name> \"Spellbound\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"97\"^^xsd:double . ?e <title> ?pv . ?pv <pred:value> \"Twelfth Night: Or What You Will\" .  }"
  },
  {
    "qid": "train_2669",
    "input_seq": "How many subscribers does York University, its subreddit is yorku, have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"York University\" . ?e <subreddit> ?pv . ?pv <pred:value> \"yorku\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2670",
    "input_seq": "Which independent city that is located in Virginia (that contains the Hampton administrative division) has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Virginia\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . ?e_2 <pred:name> \"Hampton\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2671",
    "input_seq": "Dane Cook has what connection to White American?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dane Cook\" . ?e_2 <pred:name> \"White American\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2672",
    "input_seq": "What is the title of the movie corresponding to the website web.archive.org/web/20110131175856/http://www.sonypictures.com/homevideo/iknowwhokilledme?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://web.archive.org/web/20110131175856/http://www.sonypictures.com/homevideo/iknowwhokilledme/\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2673",
    "input_seq": "What is the relation of Jim Thorpe to the Cincinnati Reds?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jim Thorpe\" . ?e_2 <pred:name> \"Cincinnati Reds\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2674",
    "input_seq": "What is the Dewey Decimal Classification of the independent city that is a part of Virginia (which contains Fairfax County)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"Virginia\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"Fairfax County\" .  ?e <Dewey_Decimal_Classification> ?pv .  }"
  },
  {
    "qid": "train_2675",
    "input_seq": "What language is associated with the official website http://www.sarasotagov.org/ for the United States city that is the twin administrative body to Treviso?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Treviso\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sarasotagov.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2676",
    "input_seq": "Which human wins the Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series (the award-winning work of this statement is Three's Company)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"Three's Company\" .  }"
  },
  {
    "qid": "train_2677",
    "input_seq": "How are the 5689170 population count Massachusetts and Hokkaidō related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hokkaidō\" . ?e_2 <pred:name> \"Massachusetts\" . ?e_2 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5689170\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2678",
    "input_seq": "How is Colchester related to Avignon?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Colchester\" . ?e_2 <pred:name> \"Avignon\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2679",
    "input_seq": "Terence Stamp was cast as what character on Elektra, published on 2005-03-10?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Elektra\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2005-03-10\"^^xsd:date . ?e_2 <pred:name> \"Terence Stamp\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2680",
    "input_seq": "Record producer Brian Wilson has what role as a member of The Beach Boys?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Beach Boys\" . ?e_2 <pred:name> \"Brian Wilson\" . ?e_2 <occupation> ?e_3 . ?e_3 <pred:name> \"record producer\" . ?e_1 <has_part> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <has_part> ; <pred:fact_t> ?e_2 ] <object_has_role> ?qpv .  }"
  },
  {
    "qid": "train_2681",
    "input_seq": "When did Hank Azaria conclude his studies at the American Academy of Dramatic Arts?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hank Azaria\" . ?e_2 <pred:name> \"American Academy of Dramatic Arts\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2682",
    "input_seq": "What is the official website for the film titled Just Go with It?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Just Go with It\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2683",
    "input_seq": "Does British Museum person-institution # 105726 correspond to Kyoto University ?",
    "target_seq": "ASK { ?e <pred:name> \"Kyoto University\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"105726\" .  }"
  },
  {
    "qid": "train_2684",
    "input_seq": "Which movie is titled is Spy Kids 3-D: Game Over?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Spy Kids 3-D: Game Over\" .  }"
  },
  {
    "qid": "train_2685",
    "input_seq": "Which first-level administrative country subdivision that is the twinned administrative body of Shanghai (whose official website is http://www.shanghai.gov.cn/) has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:name> \"Shanghai\" . ?e_1 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.shanghai.gov.cn/\" . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2686",
    "input_seq": "Which area is larger, Redlands or Atlanta (the one whose postal code is 30353)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Redlands\" . } UNION { ?e <pred:name> \"Atlanta\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"30353\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2687",
    "input_seq": "What is the time period that 400000000 is the population of the historical country that is the nation of Guangdong?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historical country\" . ?e_1 <country> ?e . ?e_1 <pred:name> \"Guangdong\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"400000000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2688",
    "input_seq": "What person is the nominee associated with Wanted (whose runtime is 110 minutes) that was nominated for an Academy Award for Best Sound Editing?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Wanted\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"110\"^^xsd:double . ?e_2 <pred:name> \"Academy Award for Best Sound Editing\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_2689",
    "input_seq": "Emma Roberts is a famous example of what popular music style?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"popular music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Emma Roberts\" .   }"
  },
  {
    "qid": "train_2690",
    "input_seq": "Is the length of the visual artwork whose official website is http://www.mgm.com/#/our-titles/1816/Silkwood not 2.6 years?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.mgm.com/#/our-titles/1816/Silkwood\" . ?e <duration> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> ?v . FILTER ( ?v != \"2.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2691",
    "input_seq": "Which area is smaller, Tunis or Beirut (the one that is the twinned administrative body of Lyon)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tunis\" .  } UNION { ?e <pred:name> \"Beirut\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Lyon\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2692",
    "input_seq": "Is チズィック the kana name of an area in London whose TOID is 4000000074561090 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"area of London\" . ?e <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074561090\" . ?e <name_in_kana> ?pv . ?pv <pred:value> \"チズィック\" .  }"
  },
  {
    "qid": "train_2693",
    "input_seq": "Does the musician that has the occupation of Jon Lord (the one that is famous for piano), have an ISCO occupation code equal to 3474?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"musician\" . ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Jon Lord\" . ?e_2 <famous_people> ?e_1 . ?e_2 <pred:name> \"piano\" .  ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"3474\" .  }"
  },
  {
    "qid": "train_2694",
    "input_seq": "Who does Peter Cullen portray in the Transformers film with Hugo Weaving?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Transformers\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Hugo Weaving\" . ?e_2 <pred:name> \"Peter Cullen\" . ?e_2 <occupation> ?e_4 . ?e_4 <pred:name> \"voice actor\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2695",
    "input_seq": "What number of land-grant universities are located in time zone Central European Time or whose ISNI is 0000 0001 0737 1259?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" .  { ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Central European Time\" .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0737 1259\" .  } }"
  },
  {
    "qid": "train_2696",
    "input_seq": "About the movie written by Tori Morrison, and having publication date 1999-04-15, where did it get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <after_a_work_by> ?e_1 . ?e_1 <pred:name> \"Toni Morrison\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1999-04-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2697",
    "input_seq": "How is Bolt published on 2008-12-21 related to Walt Disney Animation Studios?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bolt\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2008-12-21\"^^xsd:date . ?e_2 <pred:name> \"Walt Disney Animation Studios\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2698",
    "input_seq": "Does Empire of the Sun (the one whose production company is Warner Bros.) or Wedding Crashers has lesser duration ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Empire of the Sun\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Warner Bros.\" .   } UNION { ?e <pred:name> \"Wedding Crashers\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2699",
    "input_seq": "What language is associated with the official website http://chichestercity.gov.uk/ for Chichester whose OS grid reference is SU860048?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Chichester\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SU860048\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://chichestercity.gov.uk/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2700",
    "input_seq": "Of the feature films longer than 150 minutes, which has the longest duration?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"150\"^^xsd:double ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2701",
    "input_seq": "What is the connection between This Is England to Ireland (the one that is the release region of 2012)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"This Is England\" . ?e_2 <pred:name> \"Ireland\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"2012\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2702",
    "input_seq": "What is the beginning date that Aichi Prefecture is the twinned administrative body of Bangkok?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Aichi Prefecture\" . ?e_2 <pred:name> \"Bangkok\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  }
]