[
  {
    "qid": "train_2134",
    "input_seq": "Which city became the twinned administrative body of Brunswick (whose German district key is 03101) in 1960?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Brunswick\" . ?e_1 <German_district_key> ?pv . ?pv <pred:value> \"03101\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 1960 .  }"
  },
  {
    "qid": "train_2135",
    "input_seq": "Which English ceremonial country's official website is http://www.wiltshire.gov.uk/ ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.wiltshire.gov.uk/\" .  }"
  },
  {
    "qid": "train_2136",
    "input_seq": "Toby Jones was nominated for a Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Toby Jones\" . ?e_2 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_2137",
    "input_seq": "Does Samuel Leroy Jackson have an official website of http://juno-jp.net/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Samuel Leroy Jackson\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://juno-jp.net/\" .  }"
  },
  {
    "qid": "train_2138",
    "input_seq": "When was the World Golf Hall of Fame established?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"World Golf Hall of Fame\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2139",
    "input_seq": "What role did Hayden Panettiere play in Heroes (which also featured cast member Zachary Quinto)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Heroes\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Zachary Quinto\" . ?e_2 <pred:name> \"Hayden Panettiere\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2140",
    "input_seq": "Does Fort Worth (whose postal code is 76155) or Minden have the higher elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fort Worth\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"76155\" . } UNION { ?e <pred:name> \"Minden\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2141",
    "input_seq": "Is the official website, for the human that is a member of Steely Dan, equal to http://www.davidguetta.com/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of> ?e_1 . ?e_1 <pred:name> \"Steely Dan\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.davidguetta.com/\" .  }"
  },
  {
    "qid": "train_2142",
    "input_seq": "What is the ISNI of Zodiac that casts James LeGros?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"Zodiac\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"James LeGros\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2143",
    "input_seq": "What is the relationship between Casablanca (the one that received Academy Award for Best Director) and Humphrey Bogart?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Casablanca\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Director\" . ?e_2 <pred:name> \"Humphrey Bogart\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2144",
    "input_seq": "What is the number of politicians that have the short name IND or that applies to jurisdiction over organization",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" .  { ?e <short_name> ?pv . ?pv <pred:value> \"IND\" .  } UNION { ?e <applies_to_jurisdiction> ?e_1 . ?e_1 <pred:name> \"organization\" .  } }"
  },
  {
    "qid": "train_2145",
    "input_seq": "Who is Jude Law's (the start time of this statement is 2009) partner?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <partner> ?e_1 . ?e_1 <pred:name> \"Jude Law\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <partner> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:year> 2009 .  }"
  },
  {
    "qid": "train_2146",
    "input_seq": "Which one of the census-designated places, located i Eastern Time Zone, has the lowest elevation above sea level ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"census-designated place\" . ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Eastern Time Zone\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2147",
    "input_seq": "Which among the administrative-territorial entities, that contains Atlanta (the one that contains Emory University), has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Atlanta\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"Emory University\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2148",
    "input_seq": "Who was nominated for an Academy Award for Best Costume Design for Curse of the Golden Flower?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Curse of the Golden Flower\" . ?e_2 <pred:name> \"Academy Award for Best Costume Design\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_2149",
    "input_seq": "What is the ISNI of Wallace Shawn?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wallace Shawn\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2150",
    "input_seq": "What is the time point of the county of Illinois whose official website is https://www.clintonco.illinois.gov/ and population is 37907?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.clintonco.illinois.gov/\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"37907\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2151",
    "input_seq": "What is the connection between Ethiopia to Zambia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ethiopia\" . ?e_2 <pred:name> \"Zambia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2152",
    "input_seq": "How many operating systems have official website https://www.apple.com/tw/ios/ or contain macOS?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"operating system\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"https://www.apple.com/tw/ios/\" .  } UNION { ?e_1 <part_of_the_series> ?e . ?e_1 <pred:name> \"macOS\" .  } }"
  },
  {
    "qid": "train_2153",
    "input_seq": "How was the population figure 141537 determined for the administrative territorial entity with FIPS 6-4 (US counties) code 49053?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"49053\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"141537\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_2154",
    "input_seq": "What is the connection between film score to Mark Isham?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"film score\" . ?e_2 <pred:name> \"Mark Isham\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2155",
    "input_seq": "Was the movie titled The Golden Compass released in Germany in a year other than 2003?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Golden Compass\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2003 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_2156",
    "input_seq": "What is the DfE URN for the higher learning institution whose headquarters is in Sheffield (that is the headquarters of Sheffield United F.C.)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Sheffield\" . ?e_2 <headquarters_location> ?e_1 . ?e_2 <pred:name> \"Sheffield United F.C.\" .  ?e <DfE_URN> ?pv .  }"
  },
  {
    "qid": "train_2157",
    "input_seq": "What is the connection between Neil Young (the one that has the occupation of judge) to Melbourne (the one that contains University of Melbourne)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Neil Young\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"judge\" . ?e_2 <pred:name> \"Melbourne\" . ?e_4 <located_in_the_administrative_territorial_entity> ?e_2 . ?e_4 <pred:name> \"University of Melbourne\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2158",
    "input_seq": "Is 210 yottagrams the weight of the person whose date of birth is 1980-02-11?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1980-02-11\"^^xsd:date . ?e <mass> ?pv . ?pv <pred:unit> \"yottagram\" . ?pv <pred:value> \"210\"^^xsd:double .  }"
  },
  {
    "qid": "train_2159",
    "input_seq": "How many mountain range are in United States and Canada?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <country> ?e_2 . ?e_2 <pred:name> \"Canada\" .  }"
  },
  {
    "qid": "train_2160",
    "input_seq": "When is the publication date for the single made before 2002?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 < 2002 ) . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_2161",
    "input_seq": "What is the Dewey Decimal classification for the food or dish that contains cheese?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"type of food or dish\" . ?e <has_part> ?e_1 . ?e_1 <pred:name> \"cheese\" .  ?e <Dewey_Decimal_Classification> ?pv .  }"
  },
  {
    "qid": "train_2162",
    "input_seq": "What point in time did Beauty and the Beast (the one whose director is Jean Cocteau) receive a Louis Delluc Prize?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Beauty and the Beast\" . ?e_1 <director> ?e_3 . ?e_3 <pred:name> \"Jean Cocteau\" . ?e_2 <pred:name> \"Louis Delluc Prize\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2163",
    "input_seq": "When did 24 (the one whose number of seasons is 2) premiere?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"24\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2\"^^xsd:double . ?e <start_time> ?pv .  }"
  },
  {
    "qid": "train_2164",
    "input_seq": "How many Critics' Choice Movie Award were nominated to the visual artwork whose official website is http://www.asingleman-movie.com/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Critics' Choice Movie Award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"visual artwork\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.asingleman-movie.com/\" .   }"
  },
  {
    "qid": "train_2165",
    "input_seq": "How many towns have a WOEID of 35398 or a TOID of 4000000074570326?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" .  { ?e <WOEID> ?pv . ?pv <pred:value> \"35398\" .  } UNION { ?e <TOID> ?pv . ?pv <pred:value> \"4000000074570326\" .  } }"
  },
  {
    "qid": "train_2166",
    "input_seq": "Is the light gun shooter game designated by the OLAC video game genre ID 1042 ?",
    "target_seq": "ASK { ?e <pred:name> \"light gun shooter\" . ?e <OLAC_video_game_genre_vocabulary> ?pv . ?pv <pred:value> \"1042\" .  }"
  },
  {
    "qid": "train_2167",
    "input_seq": "Is the more expensive project National Treasure, set in New York City, or Harry Potter and the Prisoner of Azkaban, with Timothy Spall as a cast member?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"National Treasure\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:name> \"New York City\" .   } UNION { ?e <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Timothy Spall\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2168",
    "input_seq": "Which Primetime Emmy Award annual ceremony edition number is 60?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award annual ceremony\" . ?e <edition_number> ?pv . ?pv <pred:value> \"60\" .  }"
  },
  {
    "qid": "train_2169",
    "input_seq": "What is the Instagram username for the band that runs the Twitter account known as whoisMGMT?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"whoisMGMT\" . ?e <Instagram_username> ?pv .  }"
  },
  {
    "qid": "train_2170",
    "input_seq": "Among the visual artworks whose fabrication method is stop-motion, which has the largest duration?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <fabrication_method> ?e_1 . ?e_1 <pred:name> \"stop-motion\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2171",
    "input_seq": "Who has more mass, Ryan Murphy born on 1993-03-31 or Chris Carter whose mass is 195 pounds?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Ryan Murphy\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1993-03-31\"^^xsd:date . } UNION { ?e <pred:name> \"Chris Carter\" . ?e <mass> ?pv_2 . ?pv_2 <pred:unit> \"pound\" . ?pv_2 <pred:value> \"195\"^^xsd:double . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2172",
    "input_seq": "Who is the U.S. citizen with Twitter username BrianWilson38?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"BrianWilson38\" . ?e <country_of_citizenship> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_2173",
    "input_seq": "What is the connection between Tiffani Thiessen to voice actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tiffani Thiessen\" . ?e_2 <pred:name> \"voice actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2174",
    "input_seq": "What language is http://www.co.madison.oh.us, the official website for the county of Ohio named after James Madison (the member of Episcopal Church), created in ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ohio\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"James Madison\" . ?e_1 <religion> ?e_2 . ?e_2 <pred:name> \"Episcopal Church\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.madison.oh.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2175",
    "input_seq": "What's the title of the animated feature film with additional voices supplied by Michael Bell (born 1938-07-30) as a character voice actor?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Michael Bell\" . ?e_1 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1938-07-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_1 ] <character_role> ?qpv . ?qpv <pred:value> \"additional voices\" . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2176",
    "input_seq": "Did the work period of the person who is the composer of Water (the one that was nominated for Academy Award for Best Foreign Language Film) start before 2002 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <composer> ?e . ?e_1 <pred:name> \"Water\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Foreign Language Film\" .  ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2002 ) .  }"
  },
  {
    "qid": "train_2177",
    "input_seq": "What is the connection between Paul Williams (the one that is a member of Bury F.C.) to Leicester?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paul Williams\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Bury F.C.\" . ?e_2 <pred:name> \"Leicester\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2178",
    "input_seq": "How was 513657 determined as the population of the county of New Jersey whose FIPS 6-4 (US counties) is 34007 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"34007\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"513657\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_2179",
    "input_seq": "Which is shorter, The Life Aquatic with Steve Zissou or Speed that received a BAFTA Award for Best Editing?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Life Aquatic with Steve Zissou\" .  } UNION { ?e <pred:name> \"Speed\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Editing\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2180",
    "input_seq": "How many scientists are different from Doctor of Medicine and whose Dewey Decimal Classification is 520.92?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <different_from> ?e_1 . ?e_1 <pred:name> \"Doctor of Medicine\" .  ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"520.92\" .  }"
  },
  {
    "qid": "train_2181",
    "input_seq": "Did The Prestige or J. Edgar have a larger box office?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Prestige\" .  } UNION { ?e <pred:name> \"J. Edgar\" .  } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2182",
    "input_seq": "How many ethnic communities contain an ethnic group from which there is a person that was, in 1990,  nominated for Independent Spirit Award?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic community\" . ?e_1 <ethnic_group> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Independent Spirit Award for Best Supporting Male\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv . ?qpv <pred:year> 1990 .   }"
  },
  {
    "qid": "train_2183",
    "input_seq": "What affiliation does Ross Turnbell (193 centimeters tall) have with association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ross Turnbull\" . ?e_1 <height> ?pv . ?pv <pred:unit> \"centimetre\" . ?pv <pred:value> \"193\"^^xsd:double . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2184",
    "input_seq": "When was the award whose official website is http://oscars.org/ founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://oscars.org/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2185",
    "input_seq": "Until when was Jack Thompson (the one that is in the military branch British Army) the member of Bristol City F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jack Thompson\" . ?e_1 <military_branch> ?e_3 . ?e_3 <pred:name> \"British Army\" . ?e_2 <pred:name> \"Bristol City F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2186",
    "input_seq": "Which IPTC Newscode refers to the product with Iconclass notation 41D2?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"41D2\" . ?e <IPTC_Newscode> ?pv .  }"
  },
  {
    "qid": "train_2187",
    "input_seq": "How many counties are there in North Carolina having a population less than 750000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of North Carolina\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"750000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2188",
    "input_seq": "How are the University of London and Royal Holloway, University of London related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of London\" . ?e_2 <pred:name> \"Royal Holloway, University of London\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2189",
    "input_seq": "What is the link between Steve Englehart and writer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Steve Englehart\" . ?e_2 <pred:name> \"writer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2190",
    "input_seq": "What role does Tom Cruise play in Mission: Impossible II?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mission: Impossible II\" . ?e_2 <pred:name> \"Tom Cruise\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_2191",
    "input_seq": "What is the connection between 2009 Major League Baseball season to baseball?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2009 Major League Baseball season\" . ?e_2 <pred:name> \"baseball\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2192",
    "input_seq": "What is the ISNI of the business whose motto text is Give light?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <motto_text> ?pv_1 . ?pv_1 <pred:value> \"Give light and the people will find their own way\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_2193",
    "input_seq": "Of high schools with a student enrollment over 1100, which has the biggest student body?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"1100\"^^xsd:double ) . ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2194",
    "input_seq": "What is Ross Turnbull's (the one that died in the manner of natural causes) birth date?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ross Turnbull\" . ?e <manner_of_death> ?e_1 . ?e_1 <pred:name> \"natural causes\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2195",
    "input_seq": "How many religions were established in a year other than 1868 or were founded by Gautama Buddha?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1868 ) .  } UNION { ?e <founded_by> ?e_1 . ?e_1 <pred:name> \"Gautama Buddha\" .  } }"
  },
  {
    "qid": "train_2196",
    "input_seq": "What person has the official website of http://www.lonchaney.tk/ and died of natural causes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.lonchaney.tk/\" . ?e <manner_of_death> ?e_1 . ?e_1 <pred:name> \"natural causes\" .  }"
  },
  {
    "qid": "train_2197",
    "input_seq": "Is ދިވެހިރާއްޖޭގެ ޖުމުހޫރިއްޔާ the native label of the written work that derives spy film Live and Let Die?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e_1 <based_on> ?e . ?e_1 <pred:name> \"Live and Let Die\" . ?e_1 <genre> ?e_2 . ?e_2 <pred:name> \"spy film\" .  ?e <native_label> ?pv . ?pv <pred:value> \"ދިވެހިރާއްޖޭގެ ޖުމުހޫރިއްޔާ\" .  }"
  },
  {
    "qid": "train_2198",
    "input_seq": "Which has a lower population count, Northampton which has a local dialing code of 413, or Lake Forest?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lake Forest\" . } UNION { ?e <pred:name> \"Northampton\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"413\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2199",
    "input_seq": "Was FC Anzhi Makhachkala started before 2004?",
    "target_seq": "ASK { ?e <pred:name> \"FC Anzhi Makhachkala\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2004 ) .  }"
  },
  {
    "qid": "train_2200",
    "input_seq": "Is the length of Night at the Museum something other than 50 minutes?",
    "target_seq": "ASK { ?e <pred:name> \"Night at the Museum\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"50\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_2202",
    "input_seq": "When did Robert Louis Stevenson take up residence in Bournemouth, headquarters of AFC Bournemouth?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Robert Louis Stevenson\" . ?e_2 <pred:name> \"Bournemouth\" . ?e_3 <headquarters_location> ?e_2 . ?e_3 <pred:name> \"AFC Bournemouth\" . ?e_1 <residence> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <residence> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2203",
    "input_seq": "What language is associated with the official website http://www.raiders.com for the American football team whose Twitter username is RAIDERS?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"American football team\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"RAIDERS\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.raiders.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_2204",
    "input_seq": "What number of rock music features the famous person Kid Rock or were not founded in 1978?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock music\" .  { ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Kid Rock\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1978 ) .  } }"
  },
  {
    "qid": "train_2205",
    "input_seq": "What is the official website of the public company that originates in Chicago (that is the resident city of Hillary Clinton)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public company\" . ?e <location_of_formation> ?e_1 . ?e_1 <pred:name> \"Chicago\" . ?e_2 <residence> ?e_1 . ?e_2 <pred:name> \"Hillary Clinton\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2206",
    "input_seq": "What's the relationship between Yugoslavia and Murder on the Orient Express (runtime 114 minute)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Murder on the Orient Express\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"114\"^^xsd:double . ?e_2 <pred:name> \"Yugoslavia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2207",
    "input_seq": "When was Melissa Leo a Broadcast Film Critics Association Award winner for Best Cast ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Broadcast Film Critics Association Award for Best Cast\" . ?e_2 <pred:name> \"Melissa Leo\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2208",
    "input_seq": "Which is the higher education institution that is located in Tehran?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Tehran\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Shohreh Aghdashloo\" .   }"
  },
  {
    "qid": "train_2209",
    "input_seq": "What country does an association football club, whose official name is Club Brugge Koninklijke Voetbalvereniging and the Twitter username is clubbrugge, belong to ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Club Brugge Koninklijke Voetbalvereniging\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"clubbrugge\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <country> ?qpv .  }"
  },
  {
    "qid": "train_2210",
    "input_seq": "What is the Libris-URI of the person whose birth name is Gianfranco Corsi?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Gianfranco Corsi\" . ?e <Libris-URI> ?pv .  }"
  },
  {
    "qid": "train_2211",
    "input_seq": "Which region of France has more weddings among the regions whose annual number of weddings is different to 2200?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"2200\"^^xsd:double ) . ?e <annual_number_of_weddings> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2212",
    "input_seq": "The story of X-Men: First Class takes place in London, also the story setting of Shine, at what point in time?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"X-Men: First Class\" . ?e_2 <pred:name> \"London\" . ?e_3 <narrative_location> ?e_2 . ?e_3 <pred:name> \"Shine\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  }
]