[
  {
    "qid": "train_1218",
    "input_seq": "Who has more children, Colin Firth or Jason Alexander?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Colin Firth\" .  } UNION { ?e <pred:name> \"Jason Alexander\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1219",
    "input_seq": "For the band that is famous for jangle pop, how many subscribers does the user have for its Twitter username of The_Byrds?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"jangle pop\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"The_Byrds\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1220",
    "input_seq": "What college at the University of Oxford has its headquarters location in Oxford and is the educational institution of Michael Winterbottom (whose date of birth is 1934-09-22)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Oxford\" .  ?e_2 <educated_at> ?e . ?e_2 <pred:name> \"Michael Winterbottom\" . ?e_2 <date_of_birth> ?pv . ?pv <pred:date> \"1934-09-22\"^^xsd:date .  }"
  },
  {
    "qid": "train_1221",
    "input_seq": "What is the CANTIC-ID for the person who has ISNI of 0000 0001 0891 9685?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0891 9685\" . ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_1222",
    "input_seq": "Is the CANTIC-ID of the human that is an executive producer of Vanity Fair (which has Eileen Atkins as a cast member) a10887441?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <executive_producer> ?e . ?e_1 <pred:name> \"Vanity Fair\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Eileen Atkins\" .  ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10887441\" .  }"
  },
  {
    "qid": "train_1223",
    "input_seq": "Which record label's official website is http://www.hollywoodrecords.com (the language of this statement is English)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hollywoodrecords.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .  }"
  },
  {
    "qid": "train_1224",
    "input_seq": "I would like to know the agent that has a political ideology of conservatism.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <political_ideology> ?e_1 . ?e_1 <pred:name> \"conservatism\" .   }"
  },
  {
    "qid": "train_1225",
    "input_seq": "Is Pete Townshend or Dave Foley (that is a member of the Buffalo Bills) shorter in height?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pete Townshend\" .  } UNION { ?e <pred:name> \"Dave Foley\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Buffalo Bills\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1226",
    "input_seq": "Which movie is longer, The Grudge or The Chronicles of Narnia: The Voyage of the Dawn Treader (the one that has Simon Pegg as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Grudge\" .  } UNION { ?e <pred:name> \"The Chronicles of Narnia: The Voyage of the Dawn Treader\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Simon Pegg\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1227",
    "input_seq": "Which has fewer episodes, Friday Night Lights which was nominated for a Primetime Emmy Award for Outstanding Lead Actress in a Drama Series or Taxi created by James L. Brooks?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Friday Night Lights\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actress in a Drama Series\" .   } UNION { ?e <pred:name> \"Taxi\" . ?e <creator> ?e_2 . ?e_2 <pred:name> \"James L. Brooks\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1228",
    "input_seq": "How was it determined that Australia (the one that uses the language Tamil) uses German language?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Australia\" . ?e_1 <language_used> ?e_3 . ?e_3 <pred:name> \"Tamil\" . ?e_2 <pred:name> \"German\" . ?e_1 <language_used> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <language_used> ; <pred:fact_t> ?e_2 ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1229",
    "input_seq": "Among the television programs with number of episodes not equal to 920,which one has the largest number of episodes ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television program\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"920\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1230",
    "input_seq": "Granada CF is represented in which language on its official website, www.granadacf.es?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Granada CF\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.granadacf.es/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1231",
    "input_seq": "Are there not 660 students in the year 1906 at the higher learning institution whose headquarters is located in Tokyo (that is the headquarters location of Bandai Namco Entertainment)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Tokyo\" . ?e_2 <headquarters_location> ?e_1 . ?e_2 <pred:name> \"Bandai Namco Entertainment\" .  ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"660\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 1906 .  }"
  },
  {
    "qid": "train_1232",
    "input_seq": "Which one, Scent of a Woman (the one that was nominated for Academy Award for Best Picture) or Bicentennial Man, has greater cost?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Scent of a Woman\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Picture\" .   } UNION { ?e <pred:name> \"Bicentennial Man\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1233",
    "input_seq": "How is The Three Musketeers whose duration is 116 minutes related to film based on literature?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Three Musketeers\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"116\"^^xsd:double . ?e_2 <pred:name> \"film based on literature\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1234",
    "input_seq": "What liberal arts college in the US is the place where someone, whose ISNI is 0000 0001 1652 1394, used to study ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"liberal arts college in the United States\" . ?e_1 <educated_at> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1652 1394\" .   }"
  },
  {
    "qid": "train_1235",
    "input_seq": "What is the number of family names that use the Persian language or have the Caverphone YKSN11?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"family name\" .  { ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"Persian\" .  } UNION { ?e <Caverphone> ?pv . ?pv <pred:value> \"YKSN11\" .  } }"
  },
  {
    "qid": "train_1236",
    "input_seq": "What is the number of woodwind instruments whose Hornbostel-Sachs classification is 423.121.11 or famous person is Paquito D'Rivera?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"woodwind instrument\" .  { ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"423.121.11\" .  } UNION { ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Paquito D'Rivera\" .  } }"
  },
  {
    "qid": "train_1237",
    "input_seq": "What is the Twitter username of the association football team whose official website is http://www.fcsg.ch?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.fcsg.ch\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_1238",
    "input_seq": "How was it determined that the Panama national football team was ranked 72?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Panama national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"72\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1239",
    "input_seq": "What is the series ordinal of Six Feet Under (the one that has Ray Romano as a cast member), which is a part of Everybody Loves Raymond?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Six Feet Under\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Ray Romano\" . ?e_2 <pred:name> \"Everybody Loves Raymond\" . ?e_1 <part_of_the_series> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }"
  },
  {
    "qid": "train_1240",
    "input_seq": "About the Academy Awards ceremony that has 58 as the edition number, is the point in time not in 2001?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <edition_number> ?pv_1 . ?pv_1 <pred:value> \"58\" . ?e <point_in_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2001 ) .  }"
  },
  {
    "qid": "train_1241",
    "input_seq": "ISNI 0000 0001 1449 6754 denotes whose sibling?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <sibling> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1449 6754\" .   }"
  },
  {
    "qid": "train_1242",
    "input_seq": "Which has more people, Barrow-in-Furness (the one whose inception time is 1974-04-01) or North Norfolk?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Barrow-in-Furness\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . } UNION { ?e <pred:name> \"North Norfolk\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1243",
    "input_seq": "Which language is associated with http://www.sundance.org/festival, the film festival edition that follows the 2011 Sundance Film Festival?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film festival edition\" . ?e <follows> ?e_1 . ?e_1 <pred:name> \"2011 Sundance Film Festival\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sundance.org/festival\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1244",
    "input_seq": "Does the Pennsylvania county with ISNI number 0000 0004 0413 3898 own the official website http://www.miramax.com/movie/chasing-amy ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0413 3898\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.miramax.com/movie/chasing-amy\" .  }"
  },
  {
    "qid": "train_1245",
    "input_seq": "Did the television series titled All in the Family start on 2010-05-15?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"All in the Family\" . ?e <start_time> ?pv . ?pv <pred:date> \"2010-05-15\"^^xsd:date .  }"
  },
  {
    "qid": "train_1246",
    "input_seq": "Which has more population, Craven or Guildford which was founded on 1974-04-01?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Craven\" . } UNION { ?e <pred:name> \"Guildford\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1247",
    "input_seq": "What is the subject of a statement 'Billy Bob Thornton was nominated for Academy Award for Best Actor'?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Billy Bob Thornton\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1248",
    "input_seq": "Is the official website of Douglas Count who's population is 47039  http://www.douglascountynv.gov,?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Douglas County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"47039\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.douglascountynv.gov\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1249",
    "input_seq": "Which place has a lower PPP GDP per capita, Morocco with a fertility rate of 2.611, or Liberia?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Morocco\" . ?e <total_fertility_rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.611\"^^xsd:double . } UNION { ?e <pred:name> \"Liberia\" . } ?e <PPP_GDP_per_capita> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1250",
    "input_seq": "How is Oliver Twist that origins from Hungary related to silent film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oliver Twist\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"Hungary\" . ?e_2 <pred:name> \"silent film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1251",
    "input_seq": "The USA's Cesar Romero scored how many points in the match as a member of FC Pyunik?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cesar Romero\" . ?e_1 <country_for_sport> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"FC Pyunik\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_points/goals/set_scored> ?qpv .  }"
  },
  {
    "qid": "train_1252",
    "input_seq": "Is the population of Seattle greater than 1500?",
    "target_seq": "ASK { ?e <pred:name> \"Seattle\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1500\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1253",
    "input_seq": "What is the title of the Interview with the Vampire (the one that is authored by Anne Rice)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Interview with the Vampire\" . ?e <author> ?e_1 . ?e_1 <pred:name> \"Anne Rice\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_1254",
    "input_seq": "What big city is located in the county of California whose official website is  http://www.sbcounty.gov ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"county of California\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.sbcounty.gov\" .   }"
  },
  {
    "qid": "train_1255",
    "input_seq": "In which time point was Mare Winningham nominated for a Best Supporting Actress Oscar?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mare Winningham\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actress\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1256",
    "input_seq": "What is the start date that Indianapolis becomes the twinned administrative body of Taipei?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Indianapolis\" . ?e_2 <pred:name> \"Taipei\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1257",
    "input_seq": "How many first-level administrative country subdivisions at an elevation above 210 feet have the capital Jeddah?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"foot\" . ?pv <pred:value> ?v . FILTER ( ?v > \"210\"^^xsd:double ) . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Jeddah\" .  }"
  },
  {
    "qid": "train_1258",
    "input_seq": "What written work derives from Along Came a Spider?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"visual artwork\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Along Came a Spider\" .   }"
  },
  {
    "qid": "train_1259",
    "input_seq": "Is the running time of Extremely Loud and Incredibly Close longer than 6 months?",
    "target_seq": "ASK { ?e <pred:name> \"Extremely Loud and Incredibly Close\" . ?e <duration> ?pv . ?pv <pred:unit> \"month\" . ?pv <pred:value> ?v . FILTER ( ?v > \"6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1260",
    "input_seq": "Was the person who lives in Bristol born after 1964?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <residence> ?e_1 . ?e_1 <pred:name> \"Bristol\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1964 ) .  }"
  },
  {
    "qid": "train_1261",
    "input_seq": "What county in Arizona with a population under 68000000 has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"68000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1262",
    "input_seq": "What is the connection between Richard Sylbert to 39th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard Sylbert\" . ?e_2 <pred:name> \"39th Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1263",
    "input_seq": "How many mountain ranges are partially contained in the New York county having the official website http://www.saratogacountyny.gov (in English)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e_1 <partially_contains> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"county of New York\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.saratogacountyny.gov\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .   }"
  },
  {
    "qid": "train_1264",
    "input_seq": "When did Richard Harris (the one that was born in Croydon) become a member of Woking F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Richard Harris\" . ?e_1 <place_of_birth> ?e_3 . ?e_3 <pred:name> \"Croydon\" . ?e_2 <pred:name> \"Woking F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1265",
    "input_seq": "How many German states belonged to Nazi Germany or served as the burial place of Danny Huston ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" .  { ?e <country> ?e_1 . ?e_1 <pred:name> \"Nazi Germany\" .  } UNION { ?e_1 <place_of_burial> ?e . ?e_1 <pred:name> \"Danny Huston\" .  } }"
  },
  {
    "qid": "train_1266",
    "input_seq": "The membership of the Association of American Universities includes how many land-grant universities?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" . ?e <member_of> ?e_1 . ?e_1 <pred:name> \"Association of American Universities\" .   }"
  },
  {
    "qid": "train_1267",
    "input_seq": "What is the birth date of the person who was an Academy Award nominee for Best Original Score for Block-Heads?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Original Score\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"Block-Heads\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1268",
    "input_seq": "Does Stanley Donen or Cheryl Hines have fewer kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Stanley Donen\" .  } UNION { ?e <pred:name> \"Cheryl Hines\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1269",
    "input_seq": "When did the Cape Verde national football team have a ranking of 7?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cape Verde national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"137\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1270",
    "input_seq": "Is Rambo:First Blood Part II or Galileo Galilei which was made in Italy shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rambo: First Blood Part II\" .  } UNION { ?e <pred:name> \"Galileo Galilei\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Italy\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1271",
    "input_seq": "How is Galway related to Auckland ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Galway\" . ?e_2 <pred:name> \"Auckland\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1272",
    "input_seq": "Is Ariel Winter's ISNI  0000 0001 2337 1208?",
    "target_seq": "ASK { ?e <pred:name> \"Ariel Winter\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2337 1208\" .  }"
  },
  {
    "qid": "train_1273",
    "input_seq": "Among the province of Canada whose population is not equal to 5600000, which one has the largest area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of Canada\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"5600000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1274",
    "input_seq": "Since when has Shane Smeltz been a member of Sydney FC?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Shane Smeltz\" . ?e_2 <pred:name> \"Sydney FC\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1275",
    "input_seq": "Which movie is shorter, Antarctica (the one whose producer is Vangelis) or A Man for All Seasons (the one that has Orson Welles as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Antarctica\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Vangelis\" .   } UNION { ?e <pred:name> \"A Man for All Seasons\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Orson Welles\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1276",
    "input_seq": "What is the connection between Six Feet Under (the one that was nominated for Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series) to Zachary Quinto?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Six Feet Under\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series\" . ?e_2 <pred:name> \"Zachary Quinto\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1277",
    "input_seq": "Arthur Rankin Jr. is what kind of designer by trade?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"designer\" . ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Arthur Rankin Jr.\" .   }"
  },
  {
    "qid": "train_1278",
    "input_seq": "Is the ISNI for Εθνικόν Πανεπιστήμιον, 0000 0004 1936 893X ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Εθνικόν Πανεπιστήμιον\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:year> 1862 . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 893X\" .  }"
  },
  {
    "qid": "train_1279",
    "input_seq": "Are there more students at Harvard University or State University of New York at Albany?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Harvard University\" .  } UNION { ?e <pred:name> \"State University of New York at Albany\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1280",
    "input_seq": "Does Burundi or United Arab Emirates have a smaller GDP (PPP)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Burundi\" .  } UNION { ?e <pred:name> \"United Arab Emirates\" .  } ?e <GDP_(PPP)> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1281",
    "input_seq": "What is the UN/LOCODE of Frankfurt?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Frankfurt\" . ?e <UN/LOCODE> ?pv .  }"
  },
  {
    "qid": "train_1282",
    "input_seq": "Which human has the official website http://www.pattyloveless.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.pattyloveless.com\" .  }"
  },
  {
    "qid": "train_1283",
    "input_seq": "How many philosophies are the work field of the human whose native language name is Arthur Schopenhauer?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e_1 <field_of_work> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Arthur Schopenhauer\" .   }"
  },
  {
    "qid": "train_1284",
    "input_seq": "Which animated feature film's release region is Israel (the one that has a diplomatic relation with Russia) and producer is Kathleen Kennedy ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Israel\" . ?e_1 <diplomatic_relation> ?e_2 . ?e_2 <pred:name> \"Russia\" .  ?e <producer> ?e_3 . ?e_3 <pred:name> \"Kathleen Kennedy\" .  }"
  },
  {
    "qid": "train_1285",
    "input_seq": "Does Republic of the Congo whose population is 4447632 or South Korea have the lower inflation rate?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Republic of the Congo\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4447632\"^^xsd:double . } UNION { ?e <pred:name> \"South Korea\" . } ?e <inflation_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1286",
    "input_seq": "How many administrative territorial entity whose population is higher than 5500000 or this is the capital of Washington County (the one that is located in Vermont).",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"5500000\"^^xsd:double ) .  } UNION { ?e_1 <capital> ?e . ?e_1 <pred:name> \"Washington County\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . ?e_2 <pred:name> \"Vermont\" .  } }"
  },
  {
    "qid": "train_1287",
    "input_seq": "For what work did Gustavo Santaolalla receive a Golden Globe Award for Best Original Song?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gustavo Santaolalla\" . ?e_2 <pred:name> \"Golden Globe Award for Best Original Song\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1288",
    "input_seq": "When was the release of the activity directed by John G. Avildsen?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <director> ?e_1 . ?e_1 <pred:name> \"John G. Avildsen\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_1289",
    "input_seq": "Does The Adventures of Tintin, a BAFTA nominee for Best Animated Film, or Sailor Moon S: The Movie have the longer run-time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Adventures of Tintin\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Animated Film\" .   } UNION { ?e <pred:name> \"Sailor Moon S: The Movie\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1290",
    "input_seq": "Tell me the organization that has the inception time after 1922 and that has an ISNI of 0000 0001 2177 3908",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1922 ) . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2177 3908\" .  }"
  },
  {
    "qid": "train_1291",
    "input_seq": "How many awards belong to the NFL or are natively labeled The Royal Victorian Chain?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" .  { ?e <owned_by> ?e_1 . ?e_1 <pred:name> \"National Football League\" .  } UNION { ?e <native_label> ?pv . ?pv <pred:value> \"The Royal Victorian Chain\" .  } }"
  },
  {
    "qid": "train_1292",
    "input_seq": "Is the publication date after 1981 for the television series episode whose production code is 327?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <production_code> ?pv_1 . ?pv_1 <pred:value> \"327\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1981 ) .  }"
  },
  {
    "qid": "train_1293",
    "input_seq": "What is the relationship between Rosario and Mexico City?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rosario\" . ?e_2 <pred:name> \"Mexico City\" . ?e_1 ?p ?e_2 .  }"
  }
]