[
  {
    "qid": "train_1138",
    "input_seq": "When was the Rock and Roll Hall of Fame award received by Chicago (whose Twitter username is chicagotheband)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chicago\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"chicagotheband\" . ?e_2 <pred:name> \"Rock and Roll Hall of Fame\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1139",
    "input_seq": "Which one has more running time between From Russia with Love and Iceland (the one whose genre is musical film)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"From Russia with Love\" .  } UNION { ?e <pred:name> \"Iceland\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"musical film\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1140",
    "input_seq": "Is the run-time of Barry Lyndon or Scary Movie longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Barry Lyndon\" .  } UNION { ?e <pred:name> \"Scary Movie\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1141",
    "input_seq": "What is the connection between A Civil Action to William H. Macy?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Civil Action\" . ?e_2 <pred:name> \"William H. Macy\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1142",
    "input_seq": "How many Screen Actors Guild Awards are won by Bradley Whitford and have the official website http://www.sagawards.org/?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Screen Actors Guild Award\" . ?e <winner> ?e_1 . ?e_1 <pred:name> \"Bradley Whitford\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sagawards.org/\" .  }"
  },
  {
    "qid": "train_1143",
    "input_seq": "When was Uzbekistan's inflation rate equal to 50.2 percent (Uzbekistan has a diplomatic relation with Iran) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <diplomatic_relation> ?e_1 . ?e_1 <pred:name> \"Iran\" . [ <pred:fact_h> ?e ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"Iran–Uzbekistan relations\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"50.2\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1144",
    "input_seq": "Does Saint Paul or Topeka have more people?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Saint Paul\" .  } UNION { ?e <pred:name> \"Topeka\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1145",
    "input_seq": "When did the person who owns the isabelle.huppert Instagram account start working?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"isabelle.huppert\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_1146",
    "input_seq": "Regarding the feature film that has Jackei Chan as its executve producer, and that was published on, 2004-06-16, where did it get published?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <executive_producer> ?e_1 . ?e_1 <pred:name> \"Jackie Chan\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2004-06-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1147",
    "input_seq": "Is Scary Movie 2 the title for The Great Gatsby whose release territory is Greece?",
    "target_seq": "ASK { ?e <pred:name> \"The Great Gatsby\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Greece\" .  ?e <title> ?pv . ?pv <pred:value> \"Scary Movie 2\" .  }"
  },
  {
    "qid": "train_1148",
    "input_seq": "What animated series that received a 63rd Primetime Emmy Award had the fewest number of seasons?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"63rd Primetime Emmy Awards\" .  ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1149",
    "input_seq": "Is 1893 not the year of the establishment date of the real property whose Minor Planet Center observatory code is 675?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"real property\" . ?e <Minor_Planet_Center_observatory_code> ?pv_1 . ?pv_1 <pred:value> \"675\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1863 ) .  }"
  },
  {
    "qid": "train_1150",
    "input_seq": "What person's name is Uwe Boll in their native language?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Uwe Boll\" .  }"
  },
  {
    "qid": "train_1151",
    "input_seq": "Is the recording label used by Noel Gallagher represented by the official website www.thenationalleague.org.uk ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e_1 <record_label> ?e . ?e_1 <pred:name> \"Noel Gallagher\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.thenationalleague.org.uk/\" .  }"
  },
  {
    "qid": "train_1152",
    "input_seq": "Does the liberal arts college that Wes Craven attended have more than 680 students?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"liberal arts college\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Wes Craven\" .  ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"680\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1153",
    "input_seq": "What association football club has official website https://reggina1914.it/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://reggina1914.it/\" .  }"
  },
  {
    "qid": "train_1154",
    "input_seq": "What is the connection between Los Angeles International Airport to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Los Angeles International Airport\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1155",
    "input_seq": "What is the short film titled The Fugitive and whose duration is not 740 minutes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"short film\" . ?e <title> ?pv . ?pv <pred:value> \"The Fugitive\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> ?v . FILTER ( ?v != \"740\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1157",
    "input_seq": "Which is shorter, Germany in Autumn or Apache originally in English?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Germany in Autumn\" .  } UNION { ?e <pred:name> \"Apache\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1158",
    "input_seq": "Where was the film titled Hannibal Rising publicly released on 2007-02-09?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hannibal Rising\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-02-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1159",
    "input_seq": "Which person is shorter in height, Shaquille O'Neal or Tom Brady (who was born on 1977-08-04)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tom Brady\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1977-08-04\"^^xsd:date . } UNION { ?e <pred:name> \"Shaquille O'Neal\" . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1160",
    "input_seq": "Which one, The Cleveland Show or Drive (the one that has Emma Stone as a cast member), has fewer number of episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Cleveland Show\" .  } UNION { ?e <pred:name> \"Drive\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Emma Stone\" .   } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1161",
    "input_seq": "Who was born on February 27, 1941?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1941-02-27\"^^xsd:date .  }"
  },
  {
    "qid": "train_1162",
    "input_seq": "What is the historical period drama Henry V which received an Academy Award for Best Costume Design about?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Henry V\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"historical period drama\" . ?e_2 <pred:name> \"Academy Award for Best Costume Design\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1163",
    "input_seq": "Which movie is longer, Honolulu (the one whose duration is 102 minute) or Octopussy?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Honolulu\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"102\"^^xsd:double . } UNION { ?e <pred:name> \"Octopussy\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1164",
    "input_seq": "When was the Hong Kong Film Award for Best Film founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hong Kong Film Award for Best Film\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1165",
    "input_seq": "When was the city where Paul Shaffer was born founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Paul Shaffer\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1166",
    "input_seq": "Tell me the relationship between 2007 NFL Draft to Pittsburg Steelers.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2007 NFL Draft\" . ?e_2 <pred:name> \"Pittsburgh Steelers\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1167",
    "input_seq": "How many association football clubs are in the ownership of an university that owns Club Universidad Nacional ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <owner_of> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"university\" . ?e_2 <owned_by> ?e_1 . ?e_2 <pred:name> \"Club Universidad Nacional\" .   }"
  },
  {
    "qid": "train_1168",
    "input_seq": "When was the association football club from Ecuador founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Ecuador\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1169",
    "input_seq": "How many record labels are there whose official website is http://www.decca.com/ or who employed Lady Gaga?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.decca.com/\" .  } UNION { ?e_1 <employer> ?e . ?e_1 <pred:name> \"Lady Gaga\" .  } }"
  },
  {
    "qid": "train_1170",
    "input_seq": "How many MTV Video Music Awards did a person with name in native language as Justin Timberlake win ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e <winner> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Justin Timberlake\" .   }"
  },
  {
    "qid": "train_1171",
    "input_seq": "What is Walter H. Tyler's ISNI?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Walter H. Tyler\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1172",
    "input_seq": "How many republics had military conflicts with Nazi Germany?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <military_conflicts> ?e_1 . ?e_1 <pred:name> \"Nazi Germany\" .   }"
  },
  {
    "qid": "train_1173",
    "input_seq": "Which one among former French regions, with a population of under 250 million, has the largest population ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"former French region\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"250000000\"^^xsd:double ) . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1174",
    "input_seq": "Regarding Gibraltar, (located in Europe continent) the demonym is gibraltarenc, which part does it apply to?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Gibraltar\" . ?e <continent> ?e_1 . ?e_1 <pred:name> \"Europe\" .  ?e <demonym> ?pv . ?pv <pred:value> \"gibraltarenc\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_1175",
    "input_seq": "How many MTV VMA awards were earned by The Smashing Pumpkins or established in a year except for 1989?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" .  { ?e_1 <award_received> ?e . ?e_1 <pred:name> \"The Smashing Pumpkins\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1989 ) .  } }"
  },
  {
    "qid": "train_1176",
    "input_seq": "Which association football club had as a member (beginning in 1924) the human that died in London Borough of Newham?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <place_of_death> ?e_3 . ?e_3 <pred:name> \"London Borough of Newham\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:year> 1924 .  }"
  },
  {
    "qid": "train_1177",
    "input_seq": "What is Chris Noth's official website?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Noth\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1178",
    "input_seq": "How many land-grant universities began after 1860?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1860 ) .  }"
  },
  {
    "qid": "train_1179",
    "input_seq": "Of all Chinese provinces established in a year other than 1368, which takes up the least space?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 1368 ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1180",
    "input_seq": "LeVar Burton was cast as what character on Star Trek: The Next Generation, which also included Majel Barrett as a cast member?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Star Trek: The Next Generation\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Majel Barrett\" . ?e_2 <pred:name> \"LeVar Burton\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1181",
    "input_seq": "Was the play with lyrics written by Don Black, who received a 39th Academy Award, performed for the first time after 1984?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <lyrics_by> ?e_1 . ?e_1 <pred:name> \"Don Black\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"39th Academy Awards\" .  ?e <date_of_first_performance> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1984 ) .  }"
  },
  {
    "qid": "train_1182",
    "input_seq": "For which work was Craig Barron awarded the Academy Award for Best Visual Effects?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Craig Barron\" . ?e_2 <pred:name> \"Academy Award for Best Visual Effects\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1183",
    "input_seq": "Is the area under 72000 hectares of the city that is the twinned administrative body of Cuba (whose life expectancy is 79.415 years) starting on the date 1999-05-27?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Cuba\" . ?e_1 <life_expectancy> ?pv_1 . ?pv_1 <pred:unit> \"year\" . ?pv_1 <pred:value> \"79.415\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_1 ] <start_time> ?qpv . ?qpv <pred:date> \"1999-05-27\"^^xsd:date . ?e <area> ?pv . ?pv <pred:unit> \"hectare\" . ?pv <pred:value> ?v . FILTER ( ?v < \"72000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1184",
    "input_seq": "Does Clint Black go by Clint_Black on Twitter ?",
    "target_seq": "ASK { ?e <pred:name> \"Clint Black\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Clint_Black\" .  }"
  },
  {
    "qid": "train_1185",
    "input_seq": "Was Vincent Kartheiser born before 1986?",
    "target_seq": "ASK { ?e <pred:name> \"Vincent Kartheiser\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1986 ) .  }"
  },
  {
    "qid": "train_1186",
    "input_seq": "Is Marlborough House, Pall Mall the street address of the Curtis Institute of Music?",
    "target_seq": "ASK { ?e <pred:name> \"Curtis Institute of Music\" . ?e <located_at_street_address> ?pv . ?pv <pred:value> \"Marlborough House, Pall Mall\" .  }"
  },
  {
    "qid": "train_1187",
    "input_seq": "Was True Lies or Mulholland Drive more expensive to make?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"True Lies\" .  } UNION { ?e <pred:name> \"Mulholland Drive\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1188",
    "input_seq": "What is the debut region of the film whose official website is http://www.sonypictures.com/homevideo/blackhawkdown and release date is 2002-10-10?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sonypictures.com/homevideo/blackhawkdown\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-10-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1189",
    "input_seq": "Who is more massive, Joe Jackson (the one whose height is 75 inch) or Ron Howard (the one whose position is shooting guard)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Joe Jackson\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"inch\" . ?pv_1 <pred:value> \"75\"^^xsd:double . } UNION { ?e <pred:name> \"Ron Howard\" . ?e <position_played_on_team_/_speciality> ?e_1 . ?e_1 <pred:name> \"shooting guard\" . } ?e <mass> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1190",
    "input_seq": "What is the connection between Jay Kogen to University of California, Los Angeles?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jay Kogen\" . ?e_2 <pred:name> \"University of California, Los Angeles\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1191",
    "input_seq": "Which human has an ISNI of 0000 0001 2131 2925?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2131 2925\" .  }"
  },
  {
    "qid": "train_1192",
    "input_seq": "What is the publication territory of the visual artwork titled Orange County whose release date is 2002-07-25?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Orange County\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-07-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1193",
    "input_seq": "Which has a greater majority age, Bahamas (whose nominal GDP is 3111160000 United States dollars) or South Korea?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bahamas\" . ?e <nominal_GDP> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"3111160000\"^^xsd:double . } UNION { ?e <pred:name> \"South Korea\" . } ?e <age_of_majority> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1194",
    "input_seq": "How many governor places are held by English-speaking George Clinton and have http://www.mass.gov/gov as their official website?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <officeholder> ?e_1 . ?e_1 <pred:name> \"George Clinton\" . ?e_1 <native_language> ?e_2 . ?e_2 <pred:name> \"English\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.mass.gov/gov\" .  }"
  },
  {
    "qid": "train_1195",
    "input_seq": "Which has a lesser population, Biloxi or Gloucester (whose inception time is 1623)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Biloxi\" . } UNION { ?e <pred:name> \"Gloucester\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1623 . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1196",
    "input_seq": "Among the Illinois counties with a population greater than 770,000, which has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"770000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1197",
    "input_seq": "What language is associated with http://www.usc.edu/, the official website of a private university whose British Museum person-institution is 205525 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private university\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"205525\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.usc.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1198",
    "input_seq": "The citizen from the Kingom of Great Britain John Mills, does he/she have a ISNI number of  0000 0000 7139 7341?",
    "target_seq": "ASK { ?e <pred:name> \"John Mills\" . ?e <country_of_citizenship> ?e_1 . ?e_1 <pred:name> \"Kingdom of Great Britain\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7139 7341\" .  }"
  },
  {
    "qid": "train_1199",
    "input_seq": "Is the box office for Pinocchio (the one that is cited by The Princess and the Frog) not equal to 7100000 euro?",
    "target_seq": "ASK { ?e <pred:name> \"Pinocchio\" . ?e_1 <cites> ?e . ?e_1 <pred:name> \"The Princess and the Frog\" .  ?e <box_office> ?pv . ?pv <pred:unit> \"euro\" . ?pv <pred:value> ?v . FILTER ( ?v != \"7100000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1200",
    "input_seq": "How many subscribers does the twitter user DamnGoodPie have who is also the composer of Blue Velvet?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <composer> ?e . ?e_1 <pred:name> \"Blue Velvet\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"DamnGoodPie\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1201",
    "input_seq": "When were Nick Lachey and Jessica Simpson divorced?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nick Lachey\" . ?e_2 <pred:name> \"Jessica Simpson\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_1202",
    "input_seq": "How many colleges of the University of Oxford have 1283283 as their National Heritage List for England number, or are the place where John Schlesinger studied?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" .  { ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1283283\" .  } UNION { ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"John Schlesinger\" .  } }"
  },
  {
    "qid": "train_1203",
    "input_seq": "What is the number of metropolitan borough that are different from newcastle-upon-tyne (which has a WOEID is 30079)",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e_1 <different_from> ?e . ?e_1 <pred:name> \"Newcastle upon Tyne\" . ?e_1 <WOEID> ?pv . ?pv <pred:value> \"30079\" .   }"
  },
  {
    "qid": "train_1204",
    "input_seq": "How many Maryland counties are located in time zone Eastern Time Zone?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Eastern Time Zone\" .   }"
  },
  {
    "qid": "train_1205",
    "input_seq": "When was Mary Tyler Moore nominated for a Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mary Tyler Moore\" . ?e_2 <pred:name> \"Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1206",
    "input_seq": "How many television films mainly depict association football and originate in the United Kingdom?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <main_subject> ?e_1 . ?e_1 <pred:name> \"association football\" .  ?e <country_of_origin> ?e_2 . ?e_2 <pred:name> \"United Kingdom\" .  }"
  },
  {
    "qid": "train_1207",
    "input_seq": "How is Daniel Radcliffe related to the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Daniel Radcliffe\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1208",
    "input_seq": "What is the work period start of the person that was nominated for an Academy Award for Best Supporting Actor for The Hours?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actor\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"The Hours\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_1209",
    "input_seq": "For Vicksburg, that has the official website http://www.vicksburg.org/, tell me the language associated with this creative work.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Vicksburg\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.vicksburg.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1210",
    "input_seq": "What number of subscribers does Amitabh Bachchan, Twitter username SrBachchan, have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Amitabh Bachchan\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SrBachchan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1211",
    "input_seq": "Does Vanuatu or Slovenia have greater real gross domestic product growth rate?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Vanuatu\" .  } UNION { ?e <pred:name> \"Slovenia\" .  } ?e <real_gross_domestic_product_growth_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1212",
    "input_seq": "When did Bangladesh (the one whose marriageable age is 21 years old) have a population of 91804318?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bangladesh\" . ?e <marriageable_age> ?pv_1 . ?pv_1 <pred:unit> \"years old\" . ?pv_1 <pred:value> \"21\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"91804318\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1213",
    "input_seq": "What is the relationship between Babyface to 1996 Grammy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Babyface\" . ?e_2 <pred:name> \"1996 Grammy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1214",
    "input_seq": "How is Steven Moffat related to Paisley?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Steven Moffat\" . ?e_2 <pred:name> \"Paisley\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1215",
    "input_seq": "How many Grammy Award nominations did Shania Twain, award winner for You're Still the One, receive for singles she released?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <award_received> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"Grammy Award\" . ?e_2 <nominated_for> ?e_1 . ?e_2 <pred:name> \"Shania Twain\" . [ <pred:fact_h> ?e_2 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"You're Still the One\" .   }"
  },
  {
    "qid": "train_1216",
    "input_seq": "How many video game console models whose subreddit is xbox360 or that were developed by Microsoft whose Corporate Number (Japan) is 8700150090374?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" .  { ?e <subreddit> ?pv . ?pv <pred:value> \"xbox360\" .  } UNION { ?e <developer> ?e_1 . ?e_1 <pred:name> \"Microsoft\" . ?e_1 <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"8700150090374\" .  } }"
  },
  {
    "qid": "train_1217",
    "input_seq": "What is the inception time of the City of Hamilton?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"City of Hamilton\" . ?e <inception> ?pv .  }"
  }
]