[
  {
    "qid": "train_82",
    "input_seq": "Does the person with a birthplace in Wilmington (PermID 5000381633) have the ISNI code 0000 0001 0941 5921 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Wilmington\" . ?e_1 <PermID> ?pv_1 . ?pv_1 <pred:value> \"5000381633\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0941 5921\" .  }"
  },
  {
    "qid": "train_83",
    "input_seq": "What is the connection between Menahem Golan to Hebrew?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Menahem Golan\" . ?e_2 <pred:name> \"Hebrew\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_84",
    "input_seq": "How many researchers are the occupation of Aristotle or practice motivational speaking?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" .  { ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Aristotle\" .  } UNION { ?e_1 <practiced_by> ?e . ?e_1 <pred:name> \"motivational speaking\" .  } }"
  },
  {
    "qid": "train_85",
    "input_seq": "How many Ireland counties have licence plate code DL or an ISO 3166-2 code of IE-CE?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ireland\" .  { ?e <licence_plate_code> ?pv . ?pv <pred:value> \"DL\" .  } UNION { ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"IE-CE\" .  } }"
  },
  {
    "qid": "train_86",
    "input_seq": "Which film originating in the USA is titled Kansas City?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <title> ?pv . ?pv <pred:value> \"Kansas City\" .  }"
  },
  {
    "qid": "train_87",
    "input_seq": "Which area is smaller, Czechoslovakia or Syria?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Czechoslovakia\" .  } UNION { ?e <pred:name> \"Syria\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_88",
    "input_seq": "When did T-Pain win the MTV Video Music Award for Best Visual Effects?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Video Music Award for Best Visual Effects\" . ?e_2 <pred:name> \"T-Pain\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_89",
    "input_seq": "What business is the parent organization of UPN starting in the year 1995?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e_1 <parent_organization> ?e . ?e_1 <pred:name> \"UPN\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <parent_organization> ; <pred:fact_t> ?e ] <start_time> ?qpv . ?qpv <pred:year> 1995 .  }"
  },
  {
    "qid": "train_90",
    "input_seq": "Is dbqsv79x1jqfz06 the Libris-URI of the person whose official website is http://www.tomjones.com?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tomjones.com\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"dbqsv79x1jqfz06\" .  }"
  },
  {
    "qid": "train_91",
    "input_seq": "When did Lowell have a population of 109945?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lowell\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"109945\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_92",
    "input_seq": "Does Styria or Chiapas cover a smaller area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Styria\" .  } UNION { ?e <pred:name> \"Chiapas\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_93",
    "input_seq": "Which has a higher mains voltage, Nigeria or Kuwait?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nigeria\" .  } UNION { ?e <pred:name> \"Kuwait\" .  } ?e <mains_voltage> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_94",
    "input_seq": "How many rock bands were founded pre-1973?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1973 ) .  }"
  },
  {
    "qid": "train_95",
    "input_seq": "Who is the nominee of the Academy Award for Best Actress for which Anne of the Thousand Days was nominated?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Anne of the Thousand Days\" . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <nominee> ?qpv .  }"
  },
  {
    "qid": "train_96",
    "input_seq": "What is the Deutsche Synchronkartei actor-ID for the person who wrote the screenplay for The Birdcage?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <screenwriter> ?e . ?e_1 <pred:name> \"The Birdcage\" .  ?e <Deutsche_Synchronkartei_actor-ID> ?pv .  }"
  },
  {
    "qid": "train_97",
    "input_seq": "What association football club has the official website of http://www.lemansfc.fr/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.lemansfc.fr/\" .  }"
  },
  {
    "qid": "train_98",
    "input_seq": "Where was Sabrina (which has Angie Dickinson as a cast member) published on 1996-01-11?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sabrina\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Angie Dickinson\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1996-01-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_99",
    "input_seq": "Of New Jersey cities with under 350000 in population, which is biggest in terms of area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"350000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_100",
    "input_seq": "Which show has fewer episodes, Great Expectations (the one whose number of seasons is 1) or Eve (the one that uses the language English)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Great Expectations\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1\"^^xsd:double . } UNION { ?e <pred:name> \"Eve\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_101",
    "input_seq": "How many high schools are there whose country is the sovereign state that has Germany-Guinea diplomatic relations with Germany?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <diplomatic_relation> ?e_2 . ?e_2 <pred:name> \"Germany\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"Germany-Guinea relations\" .   }"
  },
  {
    "qid": "train_102",
    "input_seq": "What is the official website for the New York city that is the birthplace of Harold Gould?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Harold Gould\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_103",
    "input_seq": "Is the local dialing code 0151 for the US city using the WOEID of 2385746?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2385746\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"0151\" .  }"
  },
  {
    "qid": "train_104",
    "input_seq": "How many geographic regions have the capital Jerusalem which uses Arabic and whose demonym is európai?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Jerusalem\" . ?e_1 <language_used> ?e_2 . ?e_2 <pred:name> \"Arabic\" .  ?e <demonym> ?pv . ?pv <pred:value> \"európai\" .  }"
  },
  {
    "qid": "train_105",
    "input_seq": "What is the reason that James Ivory (whose date of birth is 1765-02-17) received a Copley Medal?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"James Ivory\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1765-02-17\"^^xsd:date . ?e_2 <pred:name> \"Copley Medal\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <award_rationale> ?qpv .  }"
  },
  {
    "qid": "train_106",
    "input_seq": "Who has fewer children, Bryan Adams (the one whose genre is pop rock) or Barbara Walters?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bryan Adams\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"pop rock\" .   } UNION { ?e <pred:name> \"Barbara Walters\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_107",
    "input_seq": "The film associated with the official website www.wheninrome-themovie.com was published in what place on 2010-06-17?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.wheninrome-themovie.com/\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-06-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_108",
    "input_seq": "Which show produced by Dreamworks is the longest?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"DreamWorks\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_109",
    "input_seq": "What is the entertainment whose genre is action game and has Nintendo GameID GKLI69?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"action game\" .  ?e <Nintendo_GameID> ?pv . ?pv <pred:value> \"GKLI69\" .  }"
  },
  {
    "qid": "train_110",
    "input_seq": "How many master's degrees are granted by Technical University of Berlin or the University of New South Wales?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"master's degree\" .  { ?e_1 <grants> ?e . ?e_1 <pred:name> \"Technical University of Berlin\" .  } UNION { ?e_1 <grants> ?e . ?e_1 <pred:name> \"University of New South Wales\" .  } }"
  },
  {
    "qid": "train_111",
    "input_seq": "How many bowed-string instruments have famous person Johann Sebastian Bach (the one whose British Museum person-institution is 64954) or a Hornbostel-Sachs classification of 321.322-71?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"bowed string instrument\" .  { ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Johann Sebastian Bach\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"64954\" .  } UNION { ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322-71\" .  } }"
  },
  {
    "qid": "train_112",
    "input_seq": "Which area is smaller, Frederick (the one that is located in time zone Eastern Time Zone) or Augusta (the one that is the formation location of Southern Baptist Convention)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Frederick\" . ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Eastern Time Zone\" .   } UNION { ?e <pred:name> \"Augusta\" . ?e_2 <location_of_formation> ?e . ?e_2 <pred:name> \"Southern Baptist Convention\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_113",
    "input_seq": "Which first-level administrative country subdivision established post-1829 covers the biggest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1829 ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_114",
    "input_seq": "Which university has fewer students, George Washington University or University of Hamburg?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"George Washington University\" .  } UNION { ?e <pred:name> \"University of Hamburg\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_115",
    "input_seq": "Who is known for the new wave of European origin?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <famous_people> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"new wave\" . ?e_1 <country_of_origin> ?e_2 . ?e_2 <pred:name> \"Europe\" .   }"
  },
  {
    "qid": "train_116",
    "input_seq": "How is Bethlehem whose local dialing code is 610 related to Lehigh County?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bethlehem\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"610\" . ?e_2 <pred:name> \"Lehigh County\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_117",
    "input_seq": "When did Gale Anne Hurd marry James Cameron whose Deutsche Synchronkartei actor-ID is 27875?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gale Anne Hurd\" . ?e_2 <pred:name> \"James Cameron\" . ?e_2 <Deutsche_Synchronkartei_actor-ID> ?pv . ?pv <pred:value> \"27875\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_118",
    "input_seq": "Is the soccer club with the Twitter handle sunderlandafc nicknamed the Red and White Wizards ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"sunderlandafc\" . ?e <nickname> ?pv . ?pv <pred:value> \"Red and White Wizards\" .  }"
  },
  {
    "qid": "train_119",
    "input_seq": "Which town of the United States, whose local dialing code is 973, has the smallest population?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"973\" . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_120",
    "input_seq": "What animated film that didn't start in 2003 has the smallest number of episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 2003 ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_121",
    "input_seq": "What is the Dewey Decimal Classification for an independent city with Twitter hashtag Charlottesville ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <Twitter_hashtag> ?pv_1 . ?pv_1 <pred:value> \"Charlottesville\" . ?e <Dewey_Decimal_Classification> ?pv .  }"
  },
  {
    "qid": "train_122",
    "input_seq": "How many Winter Olympic Games have celebrated in the country that is the sovereign state that is the narrative location of The Girl with the Dragon Tattoo (the one that has Joely Richardson as a cast member)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Winter Olympic Games\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <narrative_location> ?e_1 . ?e_2 <pred:name> \"The Girl with the Dragon Tattoo\" . ?e_2 <cast_member> ?e_3 . ?e_3 <pred:name> \"Joely Richardson\" .   }"
  },
  {
    "qid": "train_123",
    "input_seq": "Who is the voice actor in Where the Wild Things Are (the one whose producer is Tom Hanks) where Catherine Keener is cast ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Where the Wild Things Are\" . ?e_1 <producer> ?e_3 . ?e_3 <pred:name> \"Tom Hanks\" . ?e_2 <pred:name> \"Catherine Keener\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <voice_actor> ?qpv .  }"
  },
  {
    "qid": "train_124",
    "input_seq": "What is the start date that Cook Islands becomes the member of Asian Development Bank?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cook Islands\" . ?e_2 <pred:name> \"Asian Development Bank\" . ?e_1 <member_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_125",
    "input_seq": "How many television series come from Germany?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Germany\" .   }"
  },
  {
    "qid": "train_126",
    "input_seq": "What is the date of birth for the person whose ISNI is 0000 0001 1474 6434?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1474 6434\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_127",
    "input_seq": "How is indie pop related to Modest Mouse?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"indie pop\" . ?e_2 <pred:name> \"Modest Mouse\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_128",
    "input_seq": "How is Subiaco related to Western Australia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Subiaco\" . ?e_2 <pred:name> \"Western Australia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_129",
    "input_seq": "How many human settlements are the capital of County Wexford or have an elevation above sea level less than 5800 feet?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human settlement\" .  { ?e_1 <capital> ?e . ?e_1 <pred:name> \"County Wexford\" .  } UNION { ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"foot\" . ?pv <pred:value> ?v . FILTER ( ?v < \"5800\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_130",
    "input_seq": "Does Coconino County or Gila County occupy a larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Coconino County\" .  } UNION { ?e <pred:name> \"Gila County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_131",
    "input_seq": "How many video game publishers are the distributor of the activity published by Bandai Namco Amusement?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game publisher\" . ?e_1 <distributor> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"activity\" . ?e_1 <publisher> ?e_2 . ?e_2 <pred:name> \"Bandai Namco Amusement\" .   }"
  },
  {
    "qid": "train_132",
    "input_seq": "Which area is smaller, Cameron County or Collin County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cameron County\" .  } UNION { ?e <pred:name> \"Collin County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_133",
    "input_seq": "Tell me the time point of the government that is the country Malawi and has an inflation rate of 7.4%.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Malawi\" .  ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"7.4\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <inflation_rate> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_134",
    "input_seq": "Which is longer, Mighty Joe Young that is 94 minutes long or The Silence of the Lambs?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mighty Joe Young\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"94\"^^xsd:double . } UNION { ?e <pred:name> \"The Silence of the Lambs\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_135",
    "input_seq": "When were the Poles Poland's ethnic group?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Poland\" . ?e_2 <pred:name> \"Poles\" . ?e_1 <ethnic_group> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <ethnic_group> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_136",
    "input_seq": "Which organization is the production company of The King and I (the one whose production company is Morgan Creek Productions) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e_1 <production_company> ?e . ?e_1 <pred:name> \"The King and I\" . ?e_1 <production_company> ?e_2 . ?e_2 <pred:name> \"Morgan Creek Productions\" .   }"
  },
  {
    "qid": "train_137",
    "input_seq": "What is the connection between John Spencer (the one whose date of birth is 1898-01-01) to Stoke City F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Spencer\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date . ?e_2 <pred:name> \"Stoke City F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_138",
    "input_seq": "Is Tiffani Thiessen or Bob Hope a parent of more kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tiffani Thiessen\" .  } UNION { ?e <pred:name> \"Bob Hope\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_139",
    "input_seq": "Which has fewer members, Scottish Labour Party or Alliance '90/The Greens?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Scottish Labour Party\" .  } UNION { ?e <pred:name> \"Alliance '90/The Greens\" .  } ?e <member_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_140",
    "input_seq": "What is the character role of Elisabeth Shue in CSI: Crime Scene Investigation?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"CSI: Crime Scene Investigation\" . ?e_2 <pred:name> \"Elisabeth Shue\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_141",
    "input_seq": "Which area is larger, Clark County (the one that shares border with San Bernardino County) or Delaware County (the one whose population is 17764)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Clark County\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"San Bernardino County\" . } UNION { ?e <pred:name> \"Delaware County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"17764\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_142",
    "input_seq": "Which movie is longer, The Opposite of Sex or The Blues Brothers?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Opposite of Sex\" .  } UNION { ?e <pred:name> \"The Blues Brothers\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_143",
    "input_seq": "Does Traffic (the one whose title is Traffic) have a publication date not in 1978 (the place of publication of this statement is Canada)?",
    "target_seq": "ASK { ?e <pred:name> \"Traffic\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Traffic\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1978 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Canada\" .  }"
  },
  {
    "qid": "train_144",
    "input_seq": "Meridian, originally in English, was published on 1996-02-23 in what location?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Meridian\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1996-02-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_145",
    "input_seq": "Was FK Khazar Lankaran founded later than 1473 ?",
    "target_seq": "ASK { ?e <pred:name> \"FK Khazar Lankaran\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1473 ) .  }"
  },
  {
    "qid": "train_146",
    "input_seq": "What is the connection between Oberlin Conservatory of Music to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oberlin Conservatory of Music\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_147",
    "input_seq": "What film was nominated for a Golden Raspberry Award for Worst Screen Couple/Ensemble and is titled Transformers: Revenge of the Fallen?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Golden Raspberry Award for Worst Screen Couple/Ensemble\" .  ?e <title> ?pv . ?pv <pred:value> \"Transformers: Revenge of the Fallen\" .  }"
  },
  {
    "qid": "train_148",
    "input_seq": "For Shame, which was written by Ingmar Bergman, tell me its publication date.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Shame\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Ingmar Bergman\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_149",
    "input_seq": "What is the connection between Verona (the one whose inception time is 1702) to Montclair?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Verona\" . ?e_1 <inception> ?pv . ?pv <pred:year> 1702 . ?e_2 <pred:name> \"Montclair\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_150",
    "input_seq": "Which movie is shorter, Swept Away or Night at the Museum: Battle of the Smithsonian (the one that has Ed Helms as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Swept Away\" .  } UNION { ?e <pred:name> \"Night at the Museum: Battle of the Smithsonian\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Ed Helms\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_151",
    "input_seq": "Which film received the BAFTA Award for Best Editing (the winner of this statement is Walter Murch)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Editing\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <winner> ?qpv . ?qpv <pred:value> \"Walter Murch\" .  }"
  },
  {
    "qid": "train_152",
    "input_seq": "How many New York counties are in New York (that contains the Albany County administrative division) or have 330000 hectares in land area?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" .  { ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"New York\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . ?e_2 <pred:name> \"Albany County\" .  } UNION { ?e <area> ?pv . ?pv <pred:unit> \"hectare\" . ?pv <pred:value> \"330000\"^^xsd:double .  } }"
  },
  {
    "qid": "train_153",
    "input_seq": "Was ska punk created in a year other than 1636 ?",
    "target_seq": "ASK { ?e <pred:name> \"ska punk\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1636 ) .  }"
  },
  {
    "qid": "train_154",
    "input_seq": "What is the visual artwork for Rope?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Rope\" .  }"
  },
  {
    "qid": "train_155",
    "input_seq": "How is Jon Stewart of Portsmouth F.C. related to Burnley F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jon Stewart\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Portsmouth F.C.\" . ?e_2 <pred:name> \"Burnley F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_156",
    "input_seq": "Is mediatopic/20000925 the IPTC Newscode for ski jumping?",
    "target_seq": "ASK { ?e <pred:name> \"ski jumping\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000925\" .  }"
  },
  {
    "qid": "train_157",
    "input_seq": "When did the sovereign state that shares a border with Vietnam (in the subject of Laos–Vietnam border) have a number of out-of-school children at 495997?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Vietnam\" . [ <pred:fact_h> ?e ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_1 ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"Laos–Vietnam border\" . ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"495997\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_out-of-school_children> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_158",
    "input_seq": "What is the relationship between Vallejo and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vallejo\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_159",
    "input_seq": "What is the name of the city with a population different to 8100000 in 2015, and that is the capital of Liguria?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"8100000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2015 . ?e <capital_of> ?e_1 . ?e_1 <pred:name> \"Liguria\" .  }"
  },
  {
    "qid": "train_160",
    "input_seq": "What is the local dialing code of Queensland?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Queensland\" . ?e <local_dialing_code> ?pv .  }"
  },
  {
    "qid": "train_161",
    "input_seq": "Dewey Decimal classifies as 2--79418 the US city that's the capital of which California county?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <capital> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79418\" .   }"
  }
]