[
  {
    "qid": "train_3953",
    "input_seq": "Which movie is longer, This Must Be the Place or The Fugitive (the one whose publication date is 1947-01-01)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"This Must Be the Place\" . } UNION { ?e <pred:name> \"The Fugitive\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1947-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3954",
    "input_seq": "Does Sean Astin or Andrew Jackson who was a member of the 5th U.S. Congress have fewer kids?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sean Astin\" .  } UNION { ?e <pred:name> \"Andrew Jackson\" . ?e_1 <participant> ?e . ?e_1 <pred:name> \"5th United States Congress\" .   } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3955",
    "input_seq": "Wathat is the language associated with Lahore subreddit,  which is connected to a city that is the birthplace of James Caan (the one whose Twitter username is jamescaan) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"James Caan\" . ?e_1 <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"jamescaan\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Lahore\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3956",
    "input_seq": "What is the official website for the governor who is the head of New Jersey government ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e_1 <office_held_by_head_of_government> ?e . ?e_1 <pred:name> \"New Jersey\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3957",
    "input_seq": "What county in California with a population not equal to 600000000 has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"600000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3958",
    "input_seq": "I need to know the Munzinger IBA for the person who has the official website of http://www.annie-hathaway.com/",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.annie-hathaway.com/\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_3959",
    "input_seq": "What is the number of guitars with the Hornbostel-Sachs classification 513 or association with the famous person named Arjen Anthony Lucassen?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" .  { ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"513\" .  } UNION { ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Arjen Anthony Lucassen\" .  } }"
  },
  {
    "qid": "train_3960",
    "input_seq": "Was Superman (the one whose genre is hip hop music) published before 2009?",
    "target_seq": "ASK { ?e <pred:name> \"Superman\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"hip hop music\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2009 ) .  }"
  },
  {
    "qid": "train_3961",
    "input_seq": "Does The Phantom of the Opera, published 1925-01-01, or psychological horror genre's The Haunting have a longer run-time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Phantom of the Opera\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1925-01-01\"^^xsd:date . } UNION { ?e <pred:name> \"The Haunting\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"psychological horror\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3962",
    "input_seq": "Is the run-time other than 320 minutes for the animated feature film with the official website www.pixar.com/feature-films/cars?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.pixar.com/feature-films/cars\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"320\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3963",
    "input_seq": "What is the OS grid reference for the city that contains the University of Lancaster?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"University of Lancaster\" .  ?e <OS_grid_reference> ?pv .  }"
  },
  {
    "qid": "train_3964",
    "input_seq": "Screen Gems won a Golden Raspberry Award for Worst Picture for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Golden Raspberry Award for Worst Picture\" . ?e_2 <pred:name> \"Screen Gems\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3965",
    "input_seq": "What is the birth name of the person whose pseudonym is Shemp Howard?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <pseudonym> ?pv_1 . ?pv_1 <pred:value> \"Shemp Howard\" . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_3966",
    "input_seq": "How many followers does Real Zaragoza have for its Twitter account name, RealZaragoza?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Real Zaragoza\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"RealZaragoza\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3967",
    "input_seq": "What is Robert Morse's CANTIC-ID?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Robert Morse\" . ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_3968",
    "input_seq": "Does Albert Einstein (born in Ulm) or Ernest Rutherford have a greater Erdős number?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Albert Einstein\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Ulm\" .   } UNION { ?e <pred:name> \"Ernest Rutherford\" .  } ?e <Erdős_number> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3969",
    "input_seq": "What was the character as a voice actor of Christopher Lee in  Star Wars: The Clone Wars (the one that was nominated for Golden Raspberry Award for Worst Prequel, Remake, Rip-off or Sequel)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Star Wars: The Clone Wars\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Golden Raspberry Award for Worst Prequel, Remake, Rip-off or Sequel\" . ?e_2 <pred:name> \"Christopher Lee\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3970",
    "input_seq": "What is the language that associated with the official website for the award that was nominated to Stockard Channing (the award-winning work of this statement is Out of Practice) which is http://www.emmys.com/?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Stockard Channing\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e ] <for_work> ?qpv_1 . ?qpv_1 <pred:value> \"Out of Practice\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emmys.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3971",
    "input_seq": "Is the release date for the film that has Ernst Lubitsch as an executive producer after 1936?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <executive_producer> ?e_1 . ?e_1 <pred:name> \"Ernst Lubitsch\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1936 ) .  }"
  },
  {
    "qid": "train_3972",
    "input_seq": "When did Mauricio Pinilla's membership in U.S. Grosseto F.C. conclude?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mauricio Pinilla\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"U.S. Grosseto F.C.\" . ?e_2 <pred:name> \"U.S. Grosseto F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3973",
    "input_seq": "Out of two movies—Brothers (with Jake Gyllenhaal in the cast) or Christopher Columbus (which comes from Germany)—which one has the shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Christopher Columbus\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Germany\" .   } UNION { ?e <pred:name> \"Brothers\" . ?e <cast_member> ?e_2 . ?e_2 <pred:name> \"Jake Gyllenhaal\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3974",
    "input_seq": "What is the connection between Hancock to Mike Epps?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hancock\" . ?e_2 <pred:name> \"Mike Epps\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3975",
    "input_seq": "What ethnic group is associated with the state in the United States known as the Sooner State?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic group\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"state of the United States\" . ?e_1 <nickname> ?pv . ?pv <pred:value> \"Sooner State\" .   }"
  },
  {
    "qid": "train_3976",
    "input_seq": "What is the FIPS 10-4 for the city that is the birthplace of W. H. Auden?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"W. H. Auden\" .  ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }"
  },
  {
    "qid": "train_3977",
    "input_seq": "Which movie is shorter, Book of Shadows: Blair Witch 2 or The Man Who Knew Too Much (the one that has Alfred Hitchcock as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Book of Shadows: Blair Witch 2\" .  } UNION { ?e <pred:name> \"The Man Who Knew Too Much\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Alfred Hitchcock\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3978",
    "input_seq": "Is Vantage Point or Prometheus shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Vantage Point\" .  } UNION { ?e <pred:name> \"Prometheus\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3979",
    "input_seq": "When did the marriage of James Newton Howard to Rosanna Arquette end?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"James Newton Howard\" . ?e_2 <pred:name> \"Rosanna Arquette\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3980",
    "input_seq": "How many colleges of the University of Oxford are the educational sites of Seth Green or are located in Oxford?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" .  { ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Seth Green\" .  } UNION { ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Oxford\" .  } }"
  },
  {
    "qid": "train_3981",
    "input_seq": "When did the first-level administrative country subdivision whose FIPS 10-4 (countries and regions) is AR01 have a population of 1796320?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"AR01\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1796320\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3982",
    "input_seq": "How is New Hampshire's 2nd congressional district related to New Hampshire ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Hampshire's 2nd congressional district\" . ?e_2 <pred:name> \"New Hampshire\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3983",
    "input_seq": "What is the ending date that Virginia Woolf is a citizen of the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Virginia Woolf\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 <country_of_citizenship> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country_of_citizenship> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3984",
    "input_seq": "Is the official website of the film that is based on The Three Musketeers (whose native label is Les trois mousquetaires) http://www.johnpauljones.com/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"The Three Musketeers\" . ?e_1 <native_label> ?pv_1 . ?pv_1 <pred:value> \"Les trois mousquetaires\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.johnpauljones.com/\" .  }"
  },
  {
    "qid": "train_3985",
    "input_seq": "How many former French regions have a country with the form of government whose demonym is francesa (the involved part of this statement is feminine)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"former French region\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"form of government\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"francesa\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv . ?qpv <pred:value> \"feminine\" .   }"
  },
  {
    "qid": "train_3987",
    "input_seq": "How many medications are also known as an egg nutrient?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e_1 <nutrient> ?e . ?e_1 <pred:name> \"egg\" .   }"
  },
  {
    "qid": "train_3988",
    "input_seq": "Is the Libris-URI of Winston Churchill (a member of of the Republican Party political party) equal to rp3572f958fk2g8?",
    "target_seq": "ASK { ?e <pred:name> \"Winston Churchill\" . ?e <member_of_political_party> ?e_1 . ?e_1 <pred:name> \"Republican Party\" .  ?e <Libris-URI> ?pv . ?pv <pred:value> \"rp3572f958fk2g8\" .  }"
  },
  {
    "qid": "train_3989",
    "input_seq": "What is the official website of Epsom?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Epsom\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3990",
    "input_seq": "When was Chuck Berry added to the Rock and Roll Hall of Fame?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chuck Berry\" . ?e_2 <pred:name> \"Rock and Roll Hall of Fame\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3991",
    "input_seq": "What is the Twitter handle of the Euro disco personality?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"Euro disco\" .  ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_3992",
    "input_seq": "How is House starring Joel David Moore related to Kal Penn?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"House\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Joel David Moore\" . ?e_2 <pred:name> \"Kal Penn\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3993",
    "input_seq": "Is 2122 the ISCO occupation code for the filmmaking occupation of Heather Graham?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"filmmaking occupation\" . ?e_1 <occupation> ?e . ?e_1 <pred:name> \"Heather Graham\" .  ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2122\" .  }"
  },
  {
    "qid": "train_3994",
    "input_seq": "Is http://www.wycokck.org/ the official website of Toronto Argonauts?",
    "target_seq": "ASK { ?e <pred:name> \"Toronto Argonauts\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.wycokck.org/\" .  }"
  },
  {
    "qid": "train_3995",
    "input_seq": "When was Democratic Party member Tony Bennett a Grammy Lifetime Achievement Award winner?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tony Bennett\" . ?e_1 <member_of_political_party> ?e_3 . ?e_3 <pred:name> \"Democratic Party\" . ?e_2 <pred:name> \"Grammy Lifetime Achievement Award\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3996",
    "input_seq": "How many activities were published before 2004, but not in 2000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2000 ) . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 < 2004 ) .  }"
  },
  {
    "qid": "train_3997",
    "input_seq": "What is the relationship between Bucky Larson: Born to Be a Star and Stephen Dorff?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bucky Larson: Born to Be a Star\" . ?e_2 <pred:name> \"Stephen Dorff\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3998",
    "input_seq": "What is the postal code of the US city that is the capital of Alaska (the one whose Swedish Anbytarforum is 6115.0)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <capital_of> ?e_1 . ?e_1 <pred:name> \"Alaska\" . ?e_1 <Swedish_Anbytarforum> ?pv_1 . ?pv_1 <pred:value> \"6115.0\" . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_3999",
    "input_seq": "Where was the film that received an MTV Movie Award for Best Comedic Performance (which Billy Crystal won) published on 1991-09-26?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"MTV Movie Award for Best Comedic Performance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <winner> ?qpv_1 . ?qpv_1 <pred:value> \"Billy Crystal\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1991-09-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_4000",
    "input_seq": "What is the ISNI of Justina Machado?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Justina Machado\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4001",
    "input_seq": "How many positions did Alan Bennet, who was born on 1931-11-05, play?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e_1 <position_played_on_team_/_speciality> ?e . ?e_1 <pred:name> \"Alan Bennett\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1931-11-05\"^^xsd:date .   }"
  },
  {
    "qid": "train_4002",
    "input_seq": "How many guitars are owned by the person that owns the Instagram username keithurban?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Instagram_username> ?pv . ?pv <pred:value> \"keithurban\" .   }"
  },
  {
    "qid": "train_4003",
    "input_seq": "Morning Musume is related in what way to Tokyo, birthplace of Masako Nozawa?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Morning Musume\" . ?e_2 <pred:name> \"Tokyo\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Masako Nozawa\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4004",
    "input_seq": "Is bluejacketsnhl the Twitter username for the Columbus Blue Jackets?",
    "target_seq": "ASK { ?e <pred:name> \"Columbus Blue Jackets\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"bluejacketsnhl\" .  }"
  },
  {
    "qid": "train_4005",
    "input_seq": "Was an association football club, related to the Twitter user RCDEspanyol_es, established in a year other than 1660 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"RCDEspanyol_es\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1660 ) .  }"
  },
  {
    "qid": "train_4006",
    "input_seq": "What is the Twitter username for the university located in Bonn?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Bonn\" .  ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_4007",
    "input_seq": "What is the link between Shakespeare in Love and Mark Williams who has 1 child?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shakespeare in Love\" . ?e_2 <pred:name> \"Mark Williams\" . ?e_2 <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4008",
    "input_seq": "Does tennis or association football have the lower maximum number of players?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"tennis\" .  } UNION { ?e <pred:name> \"association football\" .  } ?e <maximum_number_of_players> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4009",
    "input_seq": "How is the Central African Republic connected to African Development Bank?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Central African Republic\" . ?e_2 <pred:name> \"African Development Bank\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4010",
    "input_seq": "What Texas county has ISNI 0000 0004 0501 3767?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0501 3767\" .  }"
  },
  {
    "qid": "train_4011",
    "input_seq": "Who is shorter, John Wood (the one that died in Oakville) or Ron Howard (the one whose mass is 200 pound)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"John Wood\" . ?e <place_of_death> ?e_1 . ?e_1 <pred:name> \"Oakville\" . } UNION { ?e <pred:name> \"Ron Howard\" . ?e <mass> ?pv_1 . ?pv_1 <pred:unit> \"pound\" . ?pv_1 <pred:value> \"200\"^^xsd:double . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4012",
    "input_seq": "When was the population of the county of Ohio with official website http://www.co.allen.oh.us 105329 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ohio\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.co.allen.oh.us\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"105329\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4013",
    "input_seq": "What is the character role of Joan Allen as a cast member in The Bourne Supremacy?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Bourne Supremacy\" . ?e_2 <pred:name> \"Joan Allen\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4014",
    "input_seq": "Which movie is longer, Jerusalem (the one that origins from Sweden) or The Treasure of the Sierra Madre?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jerusalem\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"Sweden\" .   } UNION { ?e <pred:name> \"The Treasure of the Sierra Madre\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4015",
    "input_seq": "How many islands share a border with Elizabeth (whose postal code is 07208) or have a population greater than 7300?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" .  { ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Elizabeth\" . ?e_1 <postal_code> ?pv . ?pv <pred:value> \"07208\" .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"7300\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_4016",
    "input_seq": "What is the official website for the person with CANTIC-ID a1060814x?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a1060814x\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4017",
    "input_seq": "John Lennon was the voice of what character on Yellow Submarine, produced by United Artists?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Yellow Submarine\" . ?e_1 <production_company> ?e_3 . ?e_3 <pred:name> \"United Artists\" . ?e_2 <pred:name> \"John Lennon\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4018",
    "input_seq": "What is the establishment time for the record label whose official website is http://www.roughtraderecords.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.roughtraderecords.com/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_4019",
    "input_seq": "What is the character role of Watchmen (the one that has Carla Gugino as a cast member) which has Billy Crudup as a cast member?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Watchmen\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Carla Gugino\" . ?e_2 <pred:name> \"Billy Crudup\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_4020",
    "input_seq": "What is the connection between The Tree of Life to Denmark?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Tree of Life\" . ?e_2 <pred:name> \"Denmark\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4021",
    "input_seq": "How many theatrical genres whose number of seasons is not 0?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"0\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4022",
    "input_seq": "Is 0000 0001 2146 6844 the ISNI for Daniel Handler?",
    "target_seq": "ASK { ?e <pred:name> \"Daniel Handler\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2146 6844\" .  }"
  },
  {
    "qid": "train_4023",
    "input_seq": "What is the connection between Downton Abbey (the one whose publication date is 2019) to Michelle Dockery?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Downton Abbey\" . ?e_1 <publication_date> ?pv . ?pv <pred:year> 2019 . ?e_2 <pred:name> \"Michelle Dockery\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4024",
    "input_seq": "For which project was Garth Brooks a Grammy Award for Best Country Album nominee?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Garth Brooks\" . ?e_2 <pred:name> \"Grammy Award for Best Country Album\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4025",
    "input_seq": "When comparing Citrus County and Putnam County (the one that is located in Florida), which one is smaller by area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Putnam County\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Florida\" .   } UNION { ?e <pred:name> \"Citrus County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4026",
    "input_seq": "What is the connection between Peter Weir (the one that is educated at Queen's University Belfast) to Queen's University Belfast?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peter Weir\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"Queen's University Belfast\" . ?e_2 <pred:name> \"Queen's University Belfast\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4027",
    "input_seq": "Was Shelley Duval not born in 1958?",
    "target_seq": "ASK { ?e <pred:name> \"Shelley Duvall\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1958 ) .  }"
  },
  {
    "qid": "train_4028",
    "input_seq": "What is the number of independent cities in Germany that has the pronunciation audio LL-Q188 (deu)-Michael Schönitzer (WMDE)-Coburg.wav or that is where William Gibson (who was educated at Middlesex University) was buried",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city of Germany\" .  { ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"LL-Q188 (deu)-Michael Schönitzer (WMDE)-Coburg.wav\" .  } UNION { ?e_1 <place_of_burial> ?e . ?e_1 <pred:name> \"William Gibson\" . ?e_1 <educated_at> ?e_2 . ?e_2 <pred:name> \"Middlesex University\" .  } }"
  },
  {
    "qid": "train_4029",
    "input_seq": "Is 0000 0001 1490 4658 the ISNI of the person with CANTIC-ID a11822971 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11822971\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1490 4658\" .  }"
  },
  {
    "qid": "train_4030",
    "input_seq": "Which agent that employs Dmitri Shostakovich has the lowest number of students?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e_1 <employer> ?e . ?e_1 <pred:name> \"Dmitri Shostakovich\" .  ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4032",
    "input_seq": "Between Six Feet Under, first aired on HBO, or Homicide: Life on the Street, which boasts the most episodes?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Six Feet Under\" . ?e <original_network> ?e_1 . ?e_1 <pred:name> \"HBO\" .   } UNION { ?e <pred:name> \"Homicide: Life on the Street\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4033",
    "input_seq": "What is the connection between Calvin College to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Calvin College\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  }
]