[
  {
    "qid": "train_1713",
    "input_seq": "What is cast member Ron Perlman's character role in Sons of Anarchy?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Sons of Anarchy\" . ?e_2 <pred:name> \"Ron Perlman\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1714",
    "input_seq": "What theatre award is the one that was given to The Sound of Music (the one that received Tony Award for Best Musical) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"The Sound of Music\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"Tony Award for Best Musical\" .   }"
  },
  {
    "qid": "train_1715",
    "input_seq": "What is the connection between Savannah Guthrie to 39th Daytime Emmy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Savannah Guthrie\" . ?e_2 <pred:name> \"39th Daytime Emmy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1716",
    "input_seq": "Does Egypt (which has a demonym of Ägypterin) or Peru have a less marriageable age?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Egypt\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Ägypterin\" . } UNION { ?e <pred:name> \"Peru\" . } ?e <marriageable_age> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1717",
    "input_seq": "For the religion of the person whose religious name is Никон, what is its belief system?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"belief system\" . ?e_1 <religion> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <religious_name> ?pv_1 . ?pv_1 <pred:value> \"Никон\" .   }"
  },
  {
    "qid": "train_1718",
    "input_seq": "Did Yale Divinity School not originate in 1887?",
    "target_seq": "ASK { ?e <pred:name> \"Yale Divinity School\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1887 ) .  }"
  },
  {
    "qid": "train_1719",
    "input_seq": "What is the title of The Amazing Spider-Man which was published on 1977-01-01?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"The Amazing Spider-Man\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1977-01-01\"^^xsd:date . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_1720",
    "input_seq": "Which area is smaller, Atlantic County or Bergen County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Atlantic County\" .  } UNION { ?e <pred:name> \"Bergen County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1721",
    "input_seq": "What is the connection between The Rock to Robert Towne?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Rock\" . ?e_2 <pred:name> \"Robert Towne\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1722",
    "input_seq": "Club Atlético San Lorenzo de Almagro is related in what way to Buenos Aires?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Club Atlético San Lorenzo de Almagro\" . ?e_2 <pred:name> \"Buenos Aires\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1723",
    "input_seq": "Among counties of Massachusetts that comprise the administrative division of Massachusetts (which is the burial place of Ralph Waldo Emerson), which one covers the smallest area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Massachusetts\" . ?e_2 <place_of_burial> ?e_1 . ?e_2 <pred:name> \"Ralph Waldo Emerson\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1724",
    "input_seq": "When did Brian De Palma's career get underway?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brian De Palma\" . ?e <work_period_(start)> ?pv .  }"
  },
  {
    "qid": "train_1725",
    "input_seq": "What is the ISNI for Capcom?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Capcom\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1726",
    "input_seq": "What is the date of birth of Hellboy (which derives Hellboy II: The Golden Army)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hellboy\" . ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"Hellboy II: The Golden Army\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1727",
    "input_seq": "What is the association between Pembroke College, whose ISNI is 0000 0001 2290 4834, and the United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pembroke College\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2290 4834\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1728",
    "input_seq": "How many belief systems are involved with the religion held by the person with the Munzinger IBA of 00000009460?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"belief system\" . ?e_1 <religion> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000009460\" .   }"
  },
  {
    "qid": "train_1729",
    "input_seq": "Lamar Odom has what connection to the 2004 Summer Olympics?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lamar Odom\" . ?e_2 <pred:name> \"2004 Summer Olympics\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1730",
    "input_seq": "When is the date of death for the human that was the production designer of Sullivan's Travels?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <production_designer> ?e . ?e_1 <pred:name> \"Sullivan's Travels\" .  ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1731",
    "input_seq": "Is the fairy tale film less than 13.6 hours?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"fairy tale\" .  ?e <duration> ?pv . ?pv <pred:unit> \"hour\" . ?pv <pred:value> ?v . FILTER ( ?v < \"13.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1732",
    "input_seq": "How many Illinois counties are located in Illinois (the one that shares a border with Michigan)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Illinois\" . ?e_2 <shares_border_with> ?e_1 . ?e_2 <pred:name> \"Michigan\" .   }"
  },
  {
    "qid": "train_1733",
    "input_seq": "Which one is smaller, Craig Rocastle or Jackie Robinson that is 180 centimetres tall?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Craig Rocastle\" . } UNION { ?e <pred:name> \"Jackie Robinson\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"180\"^^xsd:double . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1734",
    "input_seq": "What is the connection between German-Soviet War to World War II?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"German-Soviet War\" . ?e_2 <pred:name> \"World War II\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1735",
    "input_seq": "Does Blood Diamond or Forgetting Sarah Marshall clock in at a longer run time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Blood Diamond\" .  } UNION { ?e <pred:name> \"Forgetting Sarah Marshall\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1736",
    "input_seq": "For the cities with dialing code 415 in the United States, which has the smallest population?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"415\" . ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1737",
    "input_seq": "Does the person with Twitter username deionsanders weigh less than 310 pounds ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"deionsanders\" . ?e <mass> ?pv . ?pv <pred:unit> \"pound\" . ?pv <pred:value> ?v . FILTER ( ?v < \"310\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1738",
    "input_seq": "Tell me the one with a smaller area, Yamhill County or Columbia County (which is named after Columbia River)",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Yamhill County\" .  } UNION { ?e <pred:name> \"Columbia County\" . ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Columbia River\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1739",
    "input_seq": "What is the birth date of the director of The Family Man, filmed in New Jersey?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"The Family Man\" . ?e_1 <filming_location> ?e_2 . ?e_2 <pred:name> \"New Jersey\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1740",
    "input_seq": "Tell me the administrative territorial entity that has Beaufort as a capital.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Beaufort\" .   }"
  },
  {
    "qid": "train_1741",
    "input_seq": "Which area has lower elevation above sea level, Lake Charles or Boulder?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lake Charles\" .  } UNION { ?e <pred:name> \"Boulder\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1742",
    "input_seq": "How is The Fugitive published on 1910-01-01 related to drama film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Fugitive\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1910-01-01\"^^xsd:date . ?e_2 <pred:name> \"drama film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1743",
    "input_seq": "Where was the film following The Expendables 2 published on 2010-10-14?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e_1 <follows> ?e . ?e_1 <pred:name> \"The Expendables 2\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2010-10-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1744",
    "input_seq": "How is the French-language Orlando related to France?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Orlando\" . ?e_1 <languages_spoken,_written_or_signed> ?e_3 . ?e_3 <pred:name> \"French\" . ?e_2 <pred:name> \"France\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1745",
    "input_seq": "Tell me the one with the least population within the ethnic group that has the Ukraine country.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic group\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Ukraine\" .  ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1746",
    "input_seq": "What geographic region is located in Japan?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Japan\" .   }"
  },
  {
    "qid": "train_1747",
    "input_seq": "Where was the feature film whose official website is http://disney.go.com/muppets/ published on 2011-11-23?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://disney.go.com/muppets/\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-11-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1748",
    "input_seq": "Which person's RePEc Short-ID is pca539?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <RePEc_Short-ID> ?pv . ?pv <pred:value> \"pca539\" .  }"
  },
  {
    "qid": "train_1750",
    "input_seq": "What is the connection between Tower of London (the one that has Boris Karloff as a cast member) to Universal Pictures (the one that is the production company of Do the Right Thing)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tower of London\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Boris Karloff\" . ?e_2 <pred:name> \"Universal Pictures\" . ?e_4 <production_company> ?e_2 . ?e_4 <pred:name> \"Do the Right Thing\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1751",
    "input_seq": "What national association football team's country is Japan and ranking is not 210th?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Japan\" .  ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"210\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1752",
    "input_seq": "When was the death of the Academy Award nominee for Best Original Musical Score for The Strawberry Blonde?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Original Musical Score\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <for_work> ?qpv . ?qpv <pred:value> \"The Strawberry Blonde\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1753",
    "input_seq": "How long is Community?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Community\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_1754",
    "input_seq": "Is the area less than 180 square miles for the Pennsylvania city that borders Lake Erie?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of Pennsylvania\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Lake Erie\" .  ?e <area> ?pv . ?pv <pred:unit> \"square mile\" . ?pv <pred:value> ?v . FILTER ( ?v < \"180\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1755",
    "input_seq": "Which mountain range whose elevation is more than 730 meters above sea level has the highest elevation above sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"730\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1756",
    "input_seq": "How many belief systems have an origination date that is not in 1448?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"belief system\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1448 ) .  }"
  },
  {
    "qid": "train_1757",
    "input_seq": "What is the connection between Amy Winehouse to Universal Music Group?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Amy Winehouse\" . ?e_2 <pred:name> \"Universal Music Group\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1758",
    "input_seq": "What is the relationship between Conservative Party of Canada (the one that is replaced by Progressive Conservative Party of Canada) to Progressive Conservative Party of Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Conservative Party of Canada\" . ?e_1 <replaced_by> ?e_3 . ?e_3 <pred:name> \"Progressive Conservative Party of Canada\" . ?e_2 <pred:name> \"Progressive Conservative Party of Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1759",
    "input_seq": "How is Ipswich, at an elevation of 50 meters, related to Australia, where 65 is the retirement age?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ipswich\" . ?e_1 <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"50\"^^xsd:double . ?e_2 <pred:name> \"Australia\" . ?e_2 <retirement_age> ?pv_1 . ?pv_1 <pred:unit> \"years old\" . ?pv_1 <pred:value> \"65\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1761",
    "input_seq": "Bethesda Softworks has what connection to Rockville?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bethesda Softworks\" . ?e_2 <pred:name> \"Rockville\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1762",
    "input_seq": "Who is taller, Parker Posey or the Canadian John Wood?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Parker Posey\" .  } UNION { ?e <pred:name> \"John Wood\" . ?e <country_for_sport> ?e_1 . ?e_1 <pred:name> \"Canada\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1763",
    "input_seq": "How is Jeff Bridges related to Blue Note Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jeff Bridges\" . ?e_2 <pred:name> \"Blue Note Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1764",
    "input_seq": "What is the connection between Virginia (the one that includes Chesapeake as a part) to Fauquier County?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Virginia\" . ?e_1 <has_part> ?e_3 . ?e_3 <pred:name> \"Chesapeake\" . ?e_2 <pred:name> \"Fauquier County\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1765",
    "input_seq": "Which business has the IPv6 routing prefix 2a00:c38:121:1::/64 and belongs to the industry of marketing?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <IPv6_routing_prefix> ?pv . ?pv <pred:value> \"2a00:c38:121:1::/64\" . ?e <industry> ?e_1 . ?e_1 <pred:name> \"marketing\" .  }"
  },
  {
    "qid": "train_1766",
    "input_seq": "Is 1955-05-27 the birth date of Richard Schiff?",
    "target_seq": "ASK { ?e <pred:name> \"Richard Schiff\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1955-05-27\"^^xsd:date .  }"
  },
  {
    "qid": "train_1767",
    "input_seq": "Where is the film published which has Faith Hill as a cast member and a publication date of 2004-07-15?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Faith Hill\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2004-07-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1768",
    "input_seq": "Which city has the largest area in New Jersey having elevation (above sea level) not equal to 860 metre?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"860\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1769",
    "input_seq": "What is the connection between One Flew Over the Cuckoo's Nest (the one whose inception time is 1962) to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"One Flew Over the Cuckoo's Nest\" . ?e_1 <inception> ?pv . ?pv <pred:year> 1962 . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1770",
    "input_seq": "Is 97mpq6nt0br14h7 the Libris-URI for the person who is the father of John Milton (whose ISNI is 0000 0001 2099 3562)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <father> ?e . ?e_1 <pred:name> \"John Milton\" . ?e_1 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2099 3562\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"97mpq6nt0br14h7\" .  }"
  },
  {
    "qid": "train_1771",
    "input_seq": "Area-wise, which is the biggest New York county bordering the Washington County corresponding to FIPS 6-4 (US counties) code 36115?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Washington County\" . ?e_1 <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"36115\" . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1772",
    "input_seq": "What is the connection between Dennis Hopper to cancer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dennis Hopper\" . ?e_2 <pred:name> \"cancer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1773",
    "input_seq": "Is the date of birth of the person having the ISNI of 0000 0000 2740 8269 after 1972?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 2740 8269\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1972 ) .  }"
  },
  {
    "qid": "train_1774",
    "input_seq": "How many kinds of science share the time period of Edmund Husserl or correspond to MeSH Code E02.642.249.265?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" .  { ?e_1 <time_period> ?e . ?e_1 <pred:name> \"Edmund Husserl\" .  } UNION { ?e <MeSH_Code> ?pv . ?pv <pred:value> \"E02.642.249.265\" .  } }"
  },
  {
    "qid": "train_1775",
    "input_seq": "What is the language of this inventive creation, Summit's official website, http://www.cityofsummit.org/?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Summit\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofsummit.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1776",
    "input_seq": "Is the date of death for businessperson Ben Harper 2006-04-28?",
    "target_seq": "ASK { ?e <pred:name> \"Ben Harper\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"businessperson\" .  ?e <date_of_death> ?pv . ?pv <pred:date> \"2006-04-28\"^^xsd:date .  }"
  },
  {
    "qid": "train_1777",
    "input_seq": "Did the legislative term that concluded on 1997-04-27 begin in a year other than 1998 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"legislative term\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1997-04-27\"^^xsd:date . ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1998 ) .  }"
  },
  {
    "qid": "train_1778",
    "input_seq": "Does Dewey Decimal classify as 2--75921 the US city with the official English-language website www.codb.us ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.codb.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--75921\" .  }"
  },
  {
    "qid": "train_1779",
    "input_seq": "Charles Brackett was an Academy Award winner for Best Writing, Adapted Screenplay for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Charles Brackett\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1780",
    "input_seq": "Was James Hetfield born on 1967-02-10?",
    "target_seq": "ASK { ?e <pred:name> \"James Hetfield\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1967-02-10\"^^xsd:date .  }"
  },
  {
    "qid": "train_1781",
    "input_seq": "How many law schools have the official website http://www.law.upenn.edu or have an ISNI of 0000 0001 0945 3442?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"law school\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.law.upenn.edu\" .  } UNION { ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0945 3442\" .  } }"
  },
  {
    "qid": "train_1782",
    "input_seq": "How is Hugo, WIth the Twitter username of HugoOfficial, related to Islam?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hugo\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"HugoOfficial\" . ?e_2 <pred:name> \"Islam\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1783",
    "input_seq": "When was founded Portland State University?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Portland State University\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1784",
    "input_seq": "How is baroque pop related to the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"baroque pop\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1785",
    "input_seq": "Which area is larger, Santa Cruz or Bay City?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Santa Cruz\" .  } UNION { ?e <pred:name> \"Bay City\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1786",
    "input_seq": "Which has a lesser number of episodes, Fresno (which has Dabney Coleman as a cast member) or Star Trek: Deep Space Nine?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fresno\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Dabney Coleman\" .   } UNION { ?e <pred:name> \"Star Trek: Deep Space Nine\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1787",
    "input_seq": "What is the subject of 'nominated for' in 'The Wiz was nominated for Academy Award for Best Production Design' ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Wiz\" . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1788",
    "input_seq": "Dresden (population 479273) which is located in Saxony (located in the Weimer Republic) when was it established?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dresden\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"479273\"^^xsd:double . ?e_2 <pred:name> \"Saxony\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_3 . ?e_3 <pred:name> \"Weimar Republic\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1789",
    "input_seq": "What is the connection between ska to Calle 13?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"ska\" . ?e_2 <pred:name> \"Calle 13\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1790",
    "input_seq": "Which model of video game console whose sold units are greater than 19000000 has the lowest number of sold units?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <units_sold> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"19000000\"^^xsd:double ) . ?e <units_sold> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1791",
    "input_seq": "What is the relation between RCD Espanyol de Barcelona to Spain?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"RCD Espanyol de Barcelona\" . ?e_2 <pred:name> \"Spain\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1792",
    "input_seq": "How many TV movies have a release year besides 1999 or a run-time other than 1.1 academic terms?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1999 ) .  } UNION { ?e <duration> ?pv . ?pv <pred:unit> \"academic term\" . ?pv <pred:value> ?v . FILTER ( ?v != \"1.1\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_1793",
    "input_seq": "What state in the United States is the narrative location of the visual artwork titled House?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e_1 <narrative_location> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"visual artwork\" . ?e_1 <title> ?pv . ?pv <pred:value> \"House\" .   }"
  },
  {
    "qid": "train_1794",
    "input_seq": "How many follow the Twitter handle of Marg Helgenberger, MargHelgen?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Marg Helgenberger\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"MargHelgen\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1795",
    "input_seq": "Since when did Al Green (the one whose Instagram username is repalgreen) study at FLorida A&M University ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Al Green\" . ?e_1 <Instagram_username> ?pv . ?pv <pred:value> \"repalgreen\" . ?e_2 <pred:name> \"Florida A&M University\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1796",
    "input_seq": "When did Richard Wright (the one that is a member of Manchester City F.C.) become a member of Arsenal F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Richard Wright\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Manchester City F.C.\" . ?e_2 <pred:name> \"Arsenal F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1797",
    "input_seq": "Who was the Pulp Fiction winner of the National Board of Review Award for Best Director?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pulp Fiction\" . ?e_2 <pred:name> \"National Board of Review Award for Best Director\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <winner> ?qpv .  }"
  },
  {
    "qid": "train_1798",
    "input_seq": "Who is shorter, Avril Lavigne or Jane Alexander (the one that is the citizen of United Kingdom)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Avril Lavigne\" .  } UNION { ?e <pred:name> \"Jane Alexander\" . ?e <country_of_citizenship> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1799",
    "input_seq": "Of animated feature films, whose composer is John Powell (the composer of The Bourne Supremacy), which one is the longest ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"John Powell\" . ?e_2 <composer> ?e_1 . ?e_2 <pred:name> \"The Bourne Supremacy\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]