[
  {
    "qid": "train_4763",
    "input_seq": "How many belief systems are distinct from agnostic philosophy or have a creation date other than 1812 BC?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"belief system\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != -1812 ) .  } UNION { ?e <different_from> ?e_1 . ?e_1 <pred:name> \"agnosticism\" .  } }"
  },
  {
    "qid": "train_4764",
    "input_seq": "How many singles were not published in 2003?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2003 ) .  }"
  },
  {
    "qid": "train_4765",
    "input_seq": "What is the smallest country in area which its currency is pound sterling ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <currency> ?e_1 . ?e_1 <pred:name> \"pound sterling\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4766",
    "input_seq": "For which work was Fran Walsh awarded the Academy Award for Best Writing, Adapted Screenplay?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Fran Walsh\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Adapted Screenplay\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4767",
    "input_seq": "When was Western Australia's population size 2,565,600?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Western Australia\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2565600\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4768",
    "input_seq": "What is the native language name of the person whose ISNI is 0000 0001 2148 7506?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2148 7506\" . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_4769",
    "input_seq": "What is the birth name for the person whose official website is http://www.peteseeger.net/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.peteseeger.net/\" . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_4771",
    "input_seq": "Which city has less land area, Bloomington (the birthplace of Jeri Taylor) or Annapolis ( the capital of Anne Arundel County)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bloomington\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Jeri Taylor\" .   } UNION { ?e <pred:name> \"Annapolis\" . ?e <capital_of> ?e_2 . ?e_2 <pred:name> \"Anne Arundel County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4773",
    "input_seq": "Trevor Horn famously exemplifies which electronic music style?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"electronic music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Trevor Horn\" .   }"
  },
  {
    "qid": "train_4774",
    "input_seq": "Who has more net worth, Jennifer Lopez or Bill Cosby?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jennifer Lopez\" .  } UNION { ?e <pred:name> \"Bill Cosby\" .  } ?e <net_worth> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4775",
    "input_seq": "Is 7833508878.9666 United States dollars the nominal GDP for the sovereign state that has China–Republic of the Congo diplomatic relations with the People's Republic of China?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <diplomatic_relation> ?e . ?e_1 <pred:name> \"People's Republic of China\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e ] <statement_is_subject_of> ?qpv_1 . ?qpv_1 <pred:value> \"China–Republic of the Congo relations\" . ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"7833508878.9666\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4776",
    "input_seq": "How many Golden Raspberry Awards did either Cats & Dogs or Battlefield Earth receive?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Golden Raspberry Awards\" .  { ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Cats & Dogs\" .  } UNION { ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Battlefield Earth\" .  } }"
  },
  {
    "qid": "train_4777",
    "input_seq": "What is the publication date of the visual artwork whose official website is http://www.darwindoc.com?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.darwindoc.com\" . ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_4778",
    "input_seq": "Is Heavy Metal or Spice World longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Heavy Metal\" .  } UNION { ?e <pred:name> \"Spice World\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4779",
    "input_seq": "Was the director of Norbit not born in 1943?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"Norbit\" .  ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1943 ) .  }"
  },
  {
    "qid": "train_4780",
    "input_seq": "What mythical creature has an Iconclass notation of 13D211?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythical creature\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"13D211\" .  }"
  },
  {
    "qid": "train_4781",
    "input_seq": "How many non-metro districts are there that report the population of below 400,000 or have Ravenna as the capital ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan district\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"400000\"^^xsd:double ) .  } UNION { ?e <capital> ?e_1 . ?e_1 <pred:name> \"Ravenna\" .  } }"
  },
  {
    "qid": "train_4782",
    "input_seq": "How are William S. Burroughs and the book Naked Lunch related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Naked Lunch\" . ?e_1 <ISBN-10> ?pv . ?pv <pred:value> \"85-00-01649-3\" . ?e_2 <pred:name> \"William S. Burroughs\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4783",
    "input_seq": "Is the smaller area covered by Clark County in Ohio, or by Greene County with a population of 164427?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Clark County\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Ohio\" . } UNION { ?e <pred:name> \"Greene County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"164427\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4784",
    "input_seq": "Tell me the title For Amazing Grace (which was shot in Baltimore)",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Amazing Grace\" . ?e <filming_location> ?e_1 . ?e_1 <pred:name> \"Baltimore\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_4785",
    "input_seq": "What is the connection between Death on the Nile (the one that has Kenneth Branagh as a cast member) to English?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Death on the Nile\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Kenneth Branagh\" . ?e_2 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4786",
    "input_seq": "Who is taller, Didier Six or Lars Hirschfeld?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Didier Six\" .  } UNION { ?e <pred:name> \"Lars Hirschfeld\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4787",
    "input_seq": "Which movie is titled Zodiac?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Zodiac\" .  }"
  },
  {
    "qid": "train_4788",
    "input_seq": "How many entertainment entities were published after 2007, or come with GICP78 as Nintendo GameID?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" .  { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2007 ) .  } UNION { ?e <Nintendo_GameID> ?pv . ?pv <pred:value> \"GICP78\" .  } }"
  },
  {
    "qid": "train_4789",
    "input_seq": "What is the number of secondary schools whose beginning date is after 1861 or not in 1842?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"secondary school\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1861 ) .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1842 ) .  } }"
  },
  {
    "qid": "train_4790",
    "input_seq": "Which ISO 3166-2 code designates England, which borders Wales?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"England\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Wales\" .  ?e <ISO_3166-2_code> ?pv .  }"
  },
  {
    "qid": "train_4791",
    "input_seq": "Tell me the work that got awarded London Film Critics circle Award for Director of the Year that was won by Spike Jonze.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"London Film Critics Circle Award for Director of the Year\" . ?e_2 <pred:name> \"Spike Jonze\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_4793",
    "input_seq": "I'd like to know the Latin American music that has an Inception time of not 1901",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Latin American music\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1901 ) .  }"
  },
  {
    "qid": "train_4794",
    "input_seq": "The written property known as The Lord of the Rings received a nomination for what literary prize?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"written work\" . ?e_1 <title> ?pv . ?pv <pred:value> \"The Lord of the Rings\" .   }"
  },
  {
    "qid": "train_4795",
    "input_seq": "How many Massachusetts counties are the birthplace of Heath Ledger or have a population under 870,000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" .  { ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"Heath Ledger\" .  } UNION { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"870000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_4797",
    "input_seq": "Of TV series that are Family Guy spin-offs, which has the longest run-time?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e_1 <series_spin-off> ?e . ?e_1 <pred:name> \"Family Guy\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4798",
    "input_seq": "When did Get Smart (the one whose duration is 24 minute) begin?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Get Smart\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"24\"^^xsd:double . ?e <start_time> ?pv .  }"
  },
  {
    "qid": "train_4799",
    "input_seq": "Is Austria-Hungary's official language designated by Ethnologue.com language code pol ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e_1 <official_language> ?e . ?e_1 <pred:name> \"Austria-Hungary\" .  ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"pol\" .  }"
  },
  {
    "qid": "train_4800",
    "input_seq": "Does the website www.cityofdover.com represent the US capital city of the Kent County that occupies 2072 square km?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <capital> ?e . ?e_1 <pred:name> \"Kent County\" . ?e_1 <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"2072\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofdover.com/\" .  }"
  },
  {
    "qid": "train_4801",
    "input_seq": "Which is shorter in length, Jonah Hex, with the official website http://www.jonah-hex.com, or Collateral which stars Tom Cruise?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jonah Hex\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.jonah-hex.com\" . } UNION { ?e <pred:name> \"Collateral\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Tom Cruise\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4802",
    "input_seq": "When did Jack Benny die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jack Benny\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_4803",
    "input_seq": "Which has less duration, Sweeney Todd: The Demon Barber of Fleet Street (which received at the 80th Academy Awards) or Night at the Museum?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sweeney Todd: The Demon Barber of Fleet Street\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"80th Academy Awards\" .   } UNION { ?e <pred:name> \"Night at the Museum\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4804",
    "input_seq": "Was Thomas Newman born in the year 1946?",
    "target_seq": "ASK { ?e <pred:name> \"Thomas Newman\" . ?e <date_of_birth> ?pv . ?pv <pred:year> 1946 .  }"
  },
  {
    "qid": "train_4805",
    "input_seq": "What is the number of metropolitan boroughs that has the capital Bury (which has a 30.1 square kilometre area)",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Bury\" . ?e_1 <area> ?pv . ?pv <pred:unit> \"square kilometre\" . ?pv <pred:value> \"30.1\"^^xsd:double .   }"
  },
  {
    "qid": "train_4806",
    "input_seq": "Does the website youngstownohio.gov represent the MTV Video Music Award won by Counting Crows?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Counting Crows\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://youngstownohio.gov\" .  }"
  },
  {
    "qid": "train_4807",
    "input_seq": "Which one has the greater number of episodes, Sex and the City (recipient of 60th Golden Globe Awards) or  Sense and Sensibility (duration of 180 minutes)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sex and the City\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"60th Golden Globe Awards\" . } UNION { ?e <pred:name> \"Sense and Sensibility\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"180\"^^xsd:double . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4808",
    "input_seq": "When did Michael Moorcock receive the Nebula Award for Best Novella?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Michael Moorcock\" . ?e_2 <pred:name> \"Nebula Award for Best Novella\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4809",
    "input_seq": "Does the university with a Name Assigning Authority Number of 27361 have a PermID equal to 5000410798?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <Name_Assigning_Authority_Number> ?pv_1 . ?pv_1 <pred:value> \"27361\" . ?e <PermID> ?pv . ?pv <pred:value> \"5000410798\" .  }"
  },
  {
    "qid": "train_4810",
    "input_seq": "Which has less elevation above sea level, Reading (which is located in or next to River Thames) or Northampton (which is the residence of Errol Flynn)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Reading\" . ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:name> \"River Thames\" .   } UNION { ?e <pred:name> \"Northampton\" . ?e_2 <residence> ?e . ?e_2 <pred:name> \"Errol Flynn\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4811",
    "input_seq": "What is the running time of the film with an Ōsaka release region?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Ōsaka\" .  ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_4812",
    "input_seq": "Among the animated-feature films with a publication date not in 1988, which one has the largest duration?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 != 1988 ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4813",
    "input_seq": "How many states in Germany were founded before 1946 or have the demonym of Bayerinnen?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1946 ) .  } UNION { ?e <demonym> ?pv . ?pv <pred:value> \"Bayerinnen\" .  } }"
  },
  {
    "qid": "train_4814",
    "input_seq": "ISNI 0000 0001 1494 6671 matches to the cast member of which TV movie?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <cast_member> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1494 6671\" .   }"
  },
  {
    "qid": "train_4815",
    "input_seq": "I'd like to know the elevation (over sea level) of Maastricht.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Maastricht\" . ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_4816",
    "input_seq": "Does the movie titled Reversal of Fortune have a run-time different from 1.6 years ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Reversal of Fortune\" . ?e <duration> ?pv . ?pv <pred:unit> \"year\" . ?pv <pred:value> ?v . FILTER ( ?v != \"1.6\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_4817",
    "input_seq": "Of the Washington counties with less than 470000 people, which covers the least amount of area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"470000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4818",
    "input_seq": "What is the connection between Kent County (the one whose population is 20197) to Kent County (the one whose official website is http://www.co.kent.de.us)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kent County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20197\"^^xsd:double . ?e_2 <pred:name> \"Kent County\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.co.kent.de.us\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4819",
    "input_seq": "What are the number of people whose honorific prefix is Sir (the one that is the honorific prefix of Ringo Starr) or whose date of death is after 1915",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" .  { ?e <honorific_prefix> ?e_1 . ?e_1 <pred:name> \"Sir\" . ?e_2 <honorific_prefix> ?e_1 . ?e_2 <pred:name> \"Ringo Starr\" .  } UNION { ?e <date_of_death> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1915 ) .  } }"
  },
  {
    "qid": "train_4820",
    "input_seq": "What is the time period that 17534 is the population of the administrative territorial entity whose FIPS 6-4 for US counties is 19055?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"19055\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"17534\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4821",
    "input_seq": "Which person is part of Chesterfield F.C. (the end time of this statement is 1949)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Chesterfield F.C.\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_1 ] <end_time> ?qpv . ?qpv <pred:year> 1949 .  }"
  },
  {
    "qid": "train_4822",
    "input_seq": "When was Ingrid Bergman a BAFTA winner for Best Actress in a Supporting Role ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"BAFTA Award for Best Actress in a Supporting Role\" . ?e_2 <pred:name> \"Ingrid Bergman\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_4823",
    "input_seq": "What administrative territorial entity contains Paddington (that shares a border with Marylebone) where Seal (whose pseudonym is Seal) was born?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Seal\" . ?e_1 <pseudonym> ?pv . ?pv <pred:value> \"Seal\" . ?e_2 <pred:name> \"Paddington\" . ?e_3 <shares_border_with> ?e_2 . ?e_3 <pred:name> \"Marylebone\" . ?e_1 <place_of_birth> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_birth> ; <pred:fact_t> ?e_2 ] <located_in_the_administrative_territorial_entity> ?qpv .  }"
  },
  {
    "qid": "train_4824",
    "input_seq": "How many female given names use the Dutch language (whose IAB code is 1146)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"female given name\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"Dutch\" . ?e_1 <IAB_code> ?pv . ?pv <pred:value> \"1146\" .   }"
  },
  {
    "qid": "train_4825",
    "input_seq": "Is China the subreddit for college basketball?",
    "target_seq": "ASK { ?e <pred:name> \"college basketball\" . ?e <subreddit> ?pv . ?pv <pred:value> \"China\" .  }"
  },
  {
    "qid": "train_4826",
    "input_seq": "What is the connection between Days of Thunder (the one whose script is wrote by Robert Towne) to auto racing?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Days of Thunder\" . ?e_1 <screenwriter> ?e_3 . ?e_3 <pred:name> \"Robert Towne\" . ?e_2 <pred:name> \"auto racing\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4827",
    "input_seq": "Was the movie titled 南極物語 published after 2004?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"南極物語\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2004 ) .  }"
  },
  {
    "qid": "train_4828",
    "input_seq": "What is the connection between The Contender (the one whose distributor is DreamWorks) to United Kingdom?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Contender\" . ?e_1 <distributor> ?e_3 . ?e_3 <pred:name> \"DreamWorks\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4829",
    "input_seq": "How many former French regions are bordering a sovereign state whose nominal GDP was equal to 17086956521.7391 USD on 1st January 1970 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"former French region\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"17086956521.7391\"^^xsd:double . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"1970-01-01\"^^xsd:date .   }"
  },
  {
    "qid": "train_4830",
    "input_seq": "What is the ISNI of the human that is a film editor of The Postman (which received a Golden Raspberry Award for Worst Screenplay)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <film_editor> ?e . ?e_1 <pred:name> \"The Postman\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"Golden Raspberry Award for Worst Screenplay\" .  ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_4831",
    "input_seq": "Which movie is titled Slumdog Millionaire?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Slumdog Millionaire\" .  }"
  },
  {
    "qid": "train_4832",
    "input_seq": "Which Florida county is affiliated with the English-language website www.bocc.citrus.fl.us?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Florida\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.bocc.citrus.fl.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .  }"
  },
  {
    "qid": "train_4833",
    "input_seq": "What is the relationship between Judy Greer and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Judy Greer\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4834",
    "input_seq": "The film titled For Your Eyes Only is based on how many different genres?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e_1 <based_on> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_1 <title> ?pv . ?pv <pred:value> \"For Your Eyes Only\" .   }"
  },
  {
    "qid": "train_4835",
    "input_seq": "Which country has a lower retirement age, United States of America or Bosnia and Herzegovina?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"United States of America\" .  } UNION { ?e <pred:name> \"Bosnia and Herzegovina\" .  } ?e <retirement_age> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_4836",
    "input_seq": "What is the connection between 3:10 to Yuma (the one whose director is Delmer Daves) to 3:10 to Yuma (the one that has Christian Bale as a cast member)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"3:10 to Yuma\" . ?e_1 <director> ?e_3 . ?e_3 <pred:name> \"Delmer Daves\" . ?e_2 <pred:name> \"3:10 to Yuma\" . ?e_2 <cast_member> ?e_4 . ?e_4 <pred:name> \"Christian Bale\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4837",
    "input_seq": "Which person has Munzinger IBA 00000017478?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000017478\" .  }"
  },
  {
    "qid": "train_4838",
    "input_seq": "When was the scientific taxon name Dinosauria officially given to the dinosaur?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"dinosaur\" . ?e <taxon_name> ?pv . ?pv <pred:value> \"Dinosauria\" . [ <pred:fact_h> ?e ; <pred:fact_r> <taxon_name> ; <pred:fact_t> ?pv ] <year_of_taxon_name_publication> ?qpv .  }"
  },
  {
    "qid": "train_4839",
    "input_seq": "Which movie is longer, The Edge (the one whose director of photography is Donald McAlpine) or The Cardinal (the one whose color is black-and-white)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Edge\" . ?e <director_of_photography> ?e_1 . ?e_1 <pred:name> \"Donald McAlpine\" .   } UNION { ?e <pred:name> \"The Cardinal\" . ?e <color> ?e_2 . ?e_2 <pred:name> \"black-and-white\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_4840",
    "input_seq": "What is the relationship between Ankara and Minsk?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ankara\" . ?e_2 <pred:name> \"Minsk\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4841",
    "input_seq": "How is Delaware County whose population is 46722 related to Sullivan County whose population is 77442?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Delaware County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"46722\"^^xsd:double . ?e_2 <pred:name> \"Sullivan County\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"77442\"^^xsd:double . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_4842",
    "input_seq": "What is the number of city in Pennsylvania who has the website http://www.yorkcity.org or whose native name is Pittsburgh",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of Pennsylvania\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.yorkcity.org\" .  } UNION { ?e <native_label> ?pv . ?pv <pred:value> \"Pittsburgh\" .  } }"
  },
  {
    "qid": "train_4843",
    "input_seq": "What is the official website of Jefferson County (the one whose population is 44857)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jefferson County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"44857\"^^xsd:double . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_4844",
    "input_seq": "What is the beginning date that 110498 is the exploitation visa number for Spider-Man 2 whose official website is http://spiderman.sonypictures.com/index.php?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Spider-Man 2\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://spiderman.sonypictures.com/index.php\" . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"110498\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_4845",
    "input_seq": "How many former French regions have a native label of Basse-Normandie?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"former French region\" . ?e <native_label> ?pv . ?pv <pred:value> \"Basse-Normandie\" .  }"
  },
  {
    "qid": "train_4846",
    "input_seq": "Which area is smaller, Bristol County (the one whose population is 49875) or County Antrim?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bristol County\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"49875\"^^xsd:double . } UNION { ?e <pred:name> \"County Antrim\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  }
]