[
  {
    "qid": "train_3126",
    "input_seq": "Which area is smaller, Escondido or Pocatello?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Escondido\" .  } UNION { ?e <pred:name> \"Pocatello\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3127",
    "input_seq": "How many Academy Awards use http://www.oscars.org/  as the official website or report Uniyed 93 as their discipline ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards\" .  { ?e <award_disciplines_or_subjects> ?e_1 . ?e_1 <pred:name> \"United 93\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.oscars.org/\" .  } }"
  },
  {
    "qid": "train_3128",
    "input_seq": "Gary Cooper, a winner at the 25th Academy Awards, has what connection to the Catholic Church?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gary Cooper\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"25th Academy Awards\" . ?e_2 <pred:name> \"Catholic Church\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3129",
    "input_seq": "Is Twitter username of a band, famous for hardcore, eigapaddington ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"hardcore\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"eigapaddington\" .  }"
  },
  {
    "qid": "train_3130",
    "input_seq": "Which university has more students, Indiana State University or University of Cambridge?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Indiana State University\" .  } UNION { ?e <pred:name> \"University of Cambridge\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3131",
    "input_seq": "What is the area of Hackensack?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hackensack\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_3132",
    "input_seq": "How many estates are in the land whose location is Kōbe or whose native label is تاج محل?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"estate in land\" .  { ?e <location> ?e_1 . ?e_1 <pred:name> \"Kōbe\" .  } UNION { ?e <native_label> ?pv . ?pv <pred:value> \"تاج محل\" .  } }"
  },
  {
    "qid": "train_3133",
    "input_seq": "How many Illinois counties contain the Chicago administrative division (whose elevation is 205 meters above sea level) or have the FIPS 6-4 (US counties) 17143?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" .  { ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Chicago\" . ?e_1 <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"205\"^^xsd:double .  } UNION { ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"17143\" .  } }"
  },
  {
    "qid": "train_3134",
    "input_seq": "Which has a lesser duration, About a Boy (whose producer is Tim Bevan) or The Firm ( whose script is writen by Robert Towne)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"About a Boy\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Tim Bevan\" .   } UNION { ?e <pred:name> \"The Firm\" . ?e <screenwriter> ?e_2 . ?e_2 <pred:name> \"Robert Towne\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3135",
    "input_seq": "Among the cities in New Jersey that is located in Middlesex County (the one that is an administrative division of New Jersey), which one has the largest area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city in New Jersey\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Middlesex County\" . ?e_2 <contains_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"New Jersey\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3136",
    "input_seq": "What is its TOID For Rotherham (the one whose WOEID is 33591)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rotherham\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"33591\" . ?e <TOID> ?pv .  }"
  },
  {
    "qid": "train_3137",
    "input_seq": "How are influenza and fatigue related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"influenza\" . ?e_2 <pred:name> \"fatigue\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3138",
    "input_seq": "Which administrative territorial entity has the GSS code (2011) of W06000022?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <GSS_code_(2011)> ?pv . ?pv <pred:value> \"W06000022\" .  }"
  },
  {
    "qid": "train_3139",
    "input_seq": "Is The Incredible Hulk, published on 1977-11-28, titled Gigante ?",
    "target_seq": "ASK { ?e <pred:name> \"The Incredible Hulk\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1977-11-28\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Gigante\" .  }"
  },
  {
    "qid": "train_3140",
    "input_seq": "Is the FIFA country code of the national association football team whose ranking was 194 in 1999 equal to EQG?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <ranking> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"194\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1999 . ?e <FIFA_country_code> ?pv . ?pv <pred:value> \"EQG\" .  }"
  },
  {
    "qid": "train_3141",
    "input_seq": "What is the connection between The Mission (the one that was nominated for Academy Award for Best Production Design) to Stuart Craig?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Mission\" . ?e_1 <nominated_for> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Production Design\" . ?e_2 <pred:name> \"Stuart Craig\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3142",
    "input_seq": "London, the birthplace of Friedrich Hollaender and Gary Oldman, is in which country?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gary Oldman\" . ?e_2 <pred:name> \"London\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Friedrich Hollaender\" . ?e_1 <place_of_birth> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_birth> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_3143",
    "input_seq": "What animated film has a voice actor with an ISNI of 0000 0001 1443 297X?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <voice_actor> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1443 297X\" .   }"
  },
  {
    "qid": "train_3144",
    "input_seq": "How many video games are there whose software engine is Havok (that is the software engine of Super Smash Bros. Brawl) or Nintendo GameID is SXEP52?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" .  { ?e <software_engine> ?e_1 . ?e_1 <pred:name> \"Havok\" . ?e_2 <software_engine> ?e_1 . ?e_2 <pred:name> \"Super Smash Bros. Brawl\" .  } UNION { ?e <Nintendo_GameID> ?pv . ?pv <pred:value> \"SXEP52\" .  } }"
  },
  {
    "qid": "train_3145",
    "input_seq": "Of all the visual artworks that have received a 75th Academy Award, which is the longest in duration?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"75th Academy Awards\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3146",
    "input_seq": "What person's name is John Williams in native language and work location is London (that is the headquarters site of Leyton Orient F.C.)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"John williams\" . ?e <work_location> ?e_1 . ?e_1 <pred:name> \"London\" . ?e_2 <headquarters_location> ?e_1 . ?e_2 <pred:name> \"Leyton Orient F.C.\" .  }"
  },
  {
    "qid": "train_3147",
    "input_seq": "Pianist Keith Richards was cast in which role on Pirates of the Caribbean: On Stranger Tides?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pirates of the Caribbean: On Stranger Tides\" . ?e_2 <pred:name> \"Keith Richards\" . ?e_3 <famous_people> ?e_2 . ?e_3 <pred:name> \"piano\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3148",
    "input_seq": "How many reds are the official color of Occidental College or have the sRGB color hex triplet C41E3A?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" .  { ?e_1 <official_color> ?e . ?e_1 <pred:name> \"Occidental College\" .  } UNION { ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"C41E3A\" .  } }"
  },
  {
    "qid": "train_3149",
    "input_seq": "What's the contemporary date of Jesus Christ has the occupation of preacher.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jesus Christ\" . ?e_2 <pred:name> \"preacher\" . ?e_1 <occupation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <occupation> ; <pred:fact_t> ?e_2 ] <latest_date> ?qpv .  }"
  },
  {
    "qid": "train_3150",
    "input_seq": "What university is headquartered in Fairfield and has an elevation of 18 metres above sea level",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Fairfield\" . ?e_1 <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"18\"^^xsd:double .   }"
  },
  {
    "qid": "train_3151",
    "input_seq": "Which visual artwork scripted by Aaron Sorkin is longest in run-time?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Aaron Sorkin\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3152",
    "input_seq": "Is the ISNI of an university, whose official website, in English language, is  http://www.utep.edu, 0000 0000 7839 8566 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.utep.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7839 8566\" .  }"
  },
  {
    "qid": "train_3153",
    "input_seq": "Which has a lesser area, Los Angeles County or Santa Barbara County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Los Angeles County\" .  } UNION { ?e <pred:name> \"Santa Barbara County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3154",
    "input_seq": "What is the language of http://www.co.fayette.pa.us/fayette/site/default.asp, the official website of a Pennsylvanian county with the population of exactly 134,999 on 1st July 2013?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"134999\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2013-07-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.fayette.pa.us/fayette/site/default.asp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3155",
    "input_seq": "What is the association of John Hartford with banjo?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Hartford\" . ?e_2 <pred:name> \"banjo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3156",
    "input_seq": "Which is longer, drama film Detroit or Out of Sight produced by Barry Sonnenfeld?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Detroit\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"drama film\" .   } UNION { ?e <pred:name> \"Out of Sight\" . ?e <producer> ?e_2 . ?e_2 <pred:name> \"Barry Sonnenfeld\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3157",
    "input_seq": "Regarding the film making company that is the production company of Paris (which has Warner Bros. as its distributor) is the inception time not in 969?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e_1 <production_company> ?e . ?e_1 <pred:name> \"Paris\" . ?e_1 <distributor> ?e_2 . ?e_2 <pred:name> \"Warner Bros.\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 969 ) .  }"
  },
  {
    "qid": "train_3158",
    "input_seq": "What is the connection between Kentucky (the one that contains Louisville metropolitan area) to Franklin County (the one that contains Frankfort)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kentucky\" . ?e_3 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_3 <pred:name> \"Louisville metropolitan area\" . ?e_2 <pred:name> \"Franklin County\" . ?e_4 <located_in_the_administrative_territorial_entity> ?e_2 . ?e_4 <pred:name> \"Frankfort\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3159",
    "input_seq": "Does Hamilton, postal code ML3, or Doncaster have less population?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Hamilton\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"ML3\" . } UNION { ?e <pred:name> \"Doncaster\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3160",
    "input_seq": "How many classes are there of an award that was won by Anne Hathaway (the one that was nominated for Academy Award for Best Supporting Actress) or whose discipline is a film director ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of award\" .  { ?e <winner> ?e_1 . ?e_1 <pred:name> \"Anne Hathaway\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Supporting Actress\" .  } UNION { ?e <award_disciplines_or_subjects> ?e_1 . ?e_1 <pred:name> \"film director\" .  } }"
  },
  {
    "qid": "train_3161",
    "input_seq": "Who has a greater net worth, Madonna or Jay-Z?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Madonna\" .  } UNION { ?e <pred:name> \"Jay-Z\" .  } ?e <net_worth> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3162",
    "input_seq": "What is the connection between The Heiress to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Heiress\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3163",
    "input_seq": "What United States city has the local area code 651 and is the birthplace of F. Scott Fitzgerald (this statement's administrative location is Minnesota)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"651\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:name> \"F. Scott Fitzgerald\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_birth> ; <pred:fact_t> ?e ] <located_in_the_administrative_territorial_entity> ?qpv . ?qpv <pred:value> \"Minnesota\" .  }"
  },
  {
    "qid": "train_3164",
    "input_seq": "What is the connection between St Hilda's College to University of Oxford?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"St Hilda's College\" . ?e_2 <pred:name> \"University of Oxford\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3165",
    "input_seq": "Which soccer club with the official website www.tolucafc.com was established post-1892?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.tolucafc.com/\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> ?v . FILTER ( ?v > 1892 ) .  }"
  },
  {
    "qid": "train_3166",
    "input_seq": "When was Hapoel Be'er Sheva F.C. founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hapoel Be'er Sheva F.C.\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3167",
    "input_seq": "Of colleges without exactly 9400 employees, which has the biggest work staff?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"9400\"^^xsd:double ) . ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3168",
    "input_seq": "What is the connection between Harry Potter and the Prisoner of Azkaban (the one that received Locus Award for Best Fantasy Novel) to Harry Potter and the Prisoner of Azkaban (the one that has Alan Rickman as a cast member)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Locus Award for Best Fantasy Novel\" . ?e_2 <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e_2 <cast_member> ?e_4 . ?e_4 <pred:name> \"Alan Rickman\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3169",
    "input_seq": "What language is associated with subreddit bxsci for the high school where Bobby Darin was educated?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"high school\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Bobby Darin\" .  ?e <subreddit> ?pv . ?pv <pred:value> \"bxsci\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3170",
    "input_seq": "What is the connection between Game of Thrones (the one whose distributor is HBO) to Android (the one that uses the language English)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Game of Thrones\" . ?e_1 <distributor> ?e_3 . ?e_3 <pred:name> \"HBO\" . ?e_2 <pred:name> \"Android\" . ?e_2 <language_of_work_or_name> ?e_4 . ?e_4 <pred:name> \"English\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3171",
    "input_seq": "What number of German states have an elevation (above sea level) of less than 8100 metres?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of Germany\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"8100\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3172",
    "input_seq": "Does the landform that is located in Massachusetts (the one that contains Appalachian Mountains) have fewer than 1600000 people (the point in time of this statement is 2011-07-01)?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Massachusetts\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"Appalachian Mountains\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"1600000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-07-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_3173",
    "input_seq": "What is the determination method for finding out Colombia national football team has a ranking of 43?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Colombia national football team\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"43\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_3174",
    "input_seq": "Which area has higher elevation above sea level, Bonn or Bandung?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Bonn\" .  } UNION { ?e <pred:name> \"Bandung\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3175",
    "input_seq": "Which movie is longer, Quills or Transformers (the one that has Megan Fox as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Quills\" .  } UNION { ?e <pred:name> \"Transformers\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Megan Fox\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3176",
    "input_seq": "Is the birth date of Wong Jing at a time that's after 1753?",
    "target_seq": "ASK { ?e <pred:name> \"Wong Jing\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1743 ) .  }"
  },
  {
    "qid": "train_3177",
    "input_seq": "When did the video game developer whose English language official website is http://web.archive.org/web/*/http://atarigames.com dissolve?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://web.archive.org/web/*/http://atarigames.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <dissolved,_abolished_or_demolished> ?pv .  }"
  },
  {
    "qid": "train_3178",
    "input_seq": "For Jefferson Parish, what is the time point for its population of 434123?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Jefferson Parish\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"434123\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3179",
    "input_seq": "Who has less children, Jerry Lewis (born in 1956) or Tony Goldwyn?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jerry Lewis\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:year> 1956 . } UNION { ?e <pred:name> \"Tony Goldwyn\" . } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3180",
    "input_seq": "What is the connection between Valletta to UNESCO World Heritage Site?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Valletta\" . ?e_2 <pred:name> \"UNESCO World Heritage Site\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3181",
    "input_seq": "What criterion is used for Walmart's net profit of 14694000000 United States dollars?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Walmart\" . ?e <net_profit> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"14694000000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <net_profit> ; <pred:fact_t> ?pv ] <criterion_used> ?qpv .  }"
  },
  {
    "qid": "train_3182",
    "input_seq": "Does Dan Aykroyd's university alma mater have a student population different from 5000?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Dan Aykroyd\" .  ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"5000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3183",
    "input_seq": "I would like to know the time point of MTV Video Music Award for Best Cinematography is won by Jamiroquai",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Video Music Award for Best Cinematography\" . ?e_2 <pred:name> \"Jamiroquai\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3184",
    "input_seq": "Is there more area in Midland where the postal code is 79701-12 or in Newport Beach?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Midland\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"79701-12\" . } UNION { ?e <pred:name> \"Newport Beach\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3185",
    "input_seq": "When did Maya Angelou receive the National Women's Hall of Fame?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Maya Angelou\" . ?e_2 <pred:name> \"National Women's Hall of Fame\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3186",
    "input_seq": "Was the film nominated for a Primetime Emmy Award for Outstanding Lead Actress in a Drama Series not published in Sweden in 1995?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Lead Actress in a Drama Series\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1995 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }"
  },
  {
    "qid": "train_3187",
    "input_seq": "What is the relationship between Illeana Douglas and screenwriter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Illeana Douglas\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3188",
    "input_seq": "How many Maryland counties whose population is not 820000?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"820000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3189",
    "input_seq": "Does the organization that is the parent organization of Saint Mary's College of California, have an ISNI equal to 0000 0001 2222 3895?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e_1 <parent_organization> ?e . ?e_1 <pred:name> \"Saint Mary's College of California\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2222 3895\" .  }"
  },
  {
    "qid": "train_3190",
    "input_seq": "Tell me the one with the biggest area within the United States town that has an area of under 280000000 square metre",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town of the United States\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"280000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3191",
    "input_seq": "What is the publication territory of the animated feature film that contains Winnie the Pooh (that has Sterling Holloway as a performer and has the release date 2011-10-21?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated feature film\" . ?e_1 <present_in_work> ?e . ?e_1 <pred:name> \"Winnie the Pooh\" . ?e_1 <performer> ?e_2 . ?e_2 <pred:name> \"Sterling Holloway\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2011-10-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3192",
    "input_seq": "What is the connection between County Wicklow to County Kildare?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"County Wicklow\" . ?e_2 <pred:name> \"County Kildare\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3193",
    "input_seq": "Jaws, released in Norway, has what link to David Brown, producer of Deep Impact?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jaws\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Norway\" . ?e_2 <pred:name> \"David Brown\" . ?e_4 <producer> ?e_2 . ?e_4 <pred:name> \"Deep Impact\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3194",
    "input_seq": "What is the relationship between Ohio and the Eastern Time Zone?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ohio\" . ?e_2 <pred:name> \"Eastern Time Zone\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3195",
    "input_seq": "Is the duration less for Brothers (the one whose publication date is 2005-03-31) or Eastern Promises?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brothers\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-03-31\"^^xsd:date . } UNION { ?e <pred:name> \"Eastern Promises\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3196",
    "input_seq": "Does Trinidad or Kyushu have more people?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Trinidad\" .  } UNION { ?e <pred:name> \"Kyushu\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3197",
    "input_seq": "Which activity is related to the sport of baseball and whose country is the United States of America?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <sport> ?e_1 . ?e_1 <pred:name> \"baseball\" .  ?e <country> ?e_2 . ?e_2 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_3198",
    "input_seq": "Which movie is longer, Dilwale Dulhania Le Jayenge or Mumford?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dilwale Dulhania Le Jayenge\" .  } UNION { ?e <pred:name> \"Mumford\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3199",
    "input_seq": "How many dramas are the genre of Pirates of the Caribbean: At World's End (whose duration is 162 minute) and have an IAB code of 642?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e_1 <genre> ?e . ?e_1 <pred:name> \"Pirates of the Caribbean: At World's End\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"162\"^^xsd:double .  ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" .  }"
  },
  {
    "qid": "train_3200",
    "input_seq": "Who has more children, Neve Campbell or John Leguizamo?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Neve Campbell\" .  } UNION { ?e <pred:name> \"John Leguizamo\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3202",
    "input_seq": "What is voice actor Don Rickles' role in Toy Story 2?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Toy Story 2\" . ?e_2 <pred:name> \"Don Rickles\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3203",
    "input_seq": "When did Bradley Cooper (the one whose birth name is Bradley Charles Cooper) win the MTV Movie Award for Best Kiss?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Movie Award for Best Kiss\" . ?e_2 <pred:name> \"Bradley Cooper\" . ?e_2 <birth_name> ?pv . ?pv <pred:value> \"Bradley Charles Cooper\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  }
]