[
  {
    "qid": "train_491",
    "input_seq": "What is the connection between Craig Robinson (the one that is a member of San Francisco Giants) to San Francisco Giants?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Craig Robinson\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"San Francisco Giants\" . ?e_2 <pred:name> \"San Francisco Giants\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_492",
    "input_seq": "What academic degree did Al Green (the one whose Twitter username is RepAlGreen) get at Texas Southern University?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Al Green\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"RepAlGreen\" . ?e_2 <pred:name> \"Texas Southern University\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <academic_degree> ?qpv .  }"
  },
  {
    "qid": "train_493",
    "input_seq": "When was the director of photography on Nixon born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director_of_photography> ?e . ?e_1 <pred:name> \"Nixon\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_494",
    "input_seq": "Was the record label headquartered In Durham (the one whose postal code is 27715) created after 1841?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Durham\" . ?e_1 <postal_code> ?pv_1 . ?pv_1 <pred:value> \"27715\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1841 ) .  }"
  },
  {
    "qid": "train_495",
    "input_seq": "When was the video game developer whose Twitter username is snkpofficial_jp conceived?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"snkpofficial_jp\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_496",
    "input_seq": "Does Dick Tracy (the one that was nominated for BAFTA Award for Best Editing) or Tom Jones (the one that received Academy Award for Best Picture) have greater duration ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Dick Tracy\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"BAFTA Award for Best Editing\" .   } UNION { ?e <pred:name> \"Tom Jones\" . ?e <award_received> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Picture\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_497",
    "input_seq": "What number of independent cities have more than 5300000000 people?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"5300000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_498",
    "input_seq": "How many episodes of the TV show Versailles were produced?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Versailles\" . ?e <number_of_episodes> ?pv .  }"
  },
  {
    "qid": "train_499",
    "input_seq": "Among the region of France with population not equal to 82000000,which one has the smallest area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of France\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"82000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_500",
    "input_seq": "Tell me the relationship between The Fast and the Furious (which has the official website http://www.thefastandthefurious.com/) to Neal H. Moritz.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Fast and the Furious\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.thefastandthefurious.com/\" . ?e_2 <pred:name> \"Neal H. Moritz\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_501",
    "input_seq": "What is the local dialing code of the capital of Preston (the one whose population is 141300)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <capital_of> ?e_1 . ?e_1 <pred:name> \"Preston\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"141300\"^^xsd:double . ?e <local_dialing_code> ?pv .  }"
  },
  {
    "qid": "train_502",
    "input_seq": "How many theatrical awards come from a sovereign state which is the release region of Aliens (the one that was nominated for BAFTA Award for Best Special Visual Effects) ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <film_release_region> ?e_1 . ?e_2 <pred:name> \"Aliens\" . ?e_2 <nominated_for> ?e_3 . ?e_3 <pred:name> \"BAFTA Award for Best Special Visual Effects\" .   }"
  },
  {
    "qid": "train_503",
    "input_seq": "Regarding the person that has pseudonym Michael Douglas and official website of http://www.michaelcrichton.com/, tell me the language associated with this creative work.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <pseudonym> ?pv_1 . ?pv_1 <pred:value> \"Michael Douglas\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.michaelcrichton.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_504",
    "input_seq": "When was the population of the capital that is the twinned administrative body of Tampere 586000?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Tampere\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"586000\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_505",
    "input_seq": "What is the connection between Didier Six to France?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Didier Six\" . ?e_2 <pred:name> \"France\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_506",
    "input_seq": "Was the closing time of the 1928 Summer Olympics not 1991 ?",
    "target_seq": "ASK { ?e <pred:name> \"1928 Summer Olympics\" . ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1991 ) .  }"
  },
  {
    "qid": "train_507",
    "input_seq": "Does Mark Wahlberg or Carmelo Anthony have more number of children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mark Wahlberg\" .  } UNION { ?e <pred:name> \"Carmelo Anthony\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_508",
    "input_seq": "Is the population of Taunton (125.394178 square KM in size) not 200000 ?",
    "target_seq": "ASK { ?e <pred:name> \"Taunton\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"125.394178\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"200000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_509",
    "input_seq": "What is the calculation process used to establish a landform's 139400-person population and a FIPS 10-4 (countries and regions) of UKG2?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKG2\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"139400\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_510",
    "input_seq": "Which is longer, Jarhead or Yellow Submarine whose release region is Hungary?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jarhead\" .  } UNION { ?e <pred:name> \"Yellow Submarine\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"Hungary\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_511",
    "input_seq": "The 162-cm tall person was born in which US city?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <place_of_birth> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <height> ?pv . ?pv <pred:unit> \"centimetre\" . ?pv <pred:value> \"162\"^^xsd:double .   }"
  },
  {
    "qid": "train_512",
    "input_seq": "Is the elevation higher in Baton Rouge, or in Highland Park in the USA?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Baton Rouge\" .  } UNION { ?e <pred:name> \"Highland Park\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .   } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_513",
    "input_seq": "What is the connection between tech house to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"tech house\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_514",
    "input_seq": "What is the relationship between Lena Horne and Blue Note Records?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lena Horne\" . ?e_2 <pred:name> \"Blue Note Records\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_515",
    "input_seq": "Whose birth name is John Herndon Mercer, who is also the composer of Robin Hood (the one whose box office is 32056467 United States dollar) (the series ordinal of this statement is 4) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv . ?pv <pred:value> \"John Herndon Mercer\" . ?e_1 <composer> ?e . ?e_1 <pred:name> \"Robin Hood\" . ?e_1 <box_office> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"32056467\"^^xsd:double . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <composer> ; <pred:fact_t> ?e ] <series_ordinal> ?qpv . ?qpv <pred:value> \"4\" .  }"
  },
  {
    "qid": "train_516",
    "input_seq": "What television series stars Sylvester Stallone and has less than 670 episodes?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Sylvester Stallone\" .  ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"670\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_517",
    "input_seq": "For the school whose inception time is in 1900, what is the language associated with this creative work for its official website of http://www.stern.nyu.edu/?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1900 . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.stern.nyu.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_518",
    "input_seq": "Which movie is shorter, Air Force One or The Longest Yard (the one that has Nelly as a cast member)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Air Force One\" .  } UNION { ?e <pred:name> \"The Longest Yard\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Nelly\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_519",
    "input_seq": "How is Gone with the Wind, in English, related to the USA?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gone with the Wind\" . ?e_1 <language_of_work_or_name> ?e_3 . ?e_3 <pred:name> \"English\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_520",
    "input_seq": "Which English language work is shorter: Back to the Future or Neighbours?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Back to the Future\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" .   } UNION { ?e <pred:name> \"Neighbours\" . ?e <language_of_work_or_name> ?e_2 . ?e_2 <pred:name> \"English\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_521",
    "input_seq": "Jurassic Park, authored by Michael Crichton, was a recipient at which Academy Awards event?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Jurassic Park\" . ?e_1 <after_a_work_by> ?e_2 . ?e_2 <pred:name> \"Michael Crichton\" .   }"
  },
  {
    "qid": "train_522",
    "input_seq": "How many airlines have MCA Inc. as their airport hub or have the Corporate Number (Japan) 1700150004605?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" .  { ?e <airline_hub> ?e_1 . ?e_1 <pred:name> \"MCA Inc.\" .  } UNION { ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"1700150004605\" .  } }"
  },
  {
    "qid": "train_523",
    "input_seq": "Is 00000017630 the Munzinger IBA of the person whose ISNI is 0000 0001 2134 3633?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2134 3633\" . ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000017630\" .  }"
  },
  {
    "qid": "train_524",
    "input_seq": "Is De-Lovely or Memoirs of a Geisha the longer work?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"De-Lovely\" .  } UNION { ?e <pred:name> \"Memoirs of a Geisha\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_525",
    "input_seq": "How many ethnic communities are in the sovereign state country that includes lawyer Alfred Newman as a citizen?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic community\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_2 <country_of_citizenship> ?e_1 . ?e_2 <pred:name> \"Alfred Newman\" . ?e_2 <occupation> ?e_3 . ?e_3 <pred:name> \"lawyer\" .   }"
  },
  {
    "qid": "train_526",
    "input_seq": "What is the connection between Al-Arabi SC to Doha?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Al-Arabi SC\" . ?e_2 <pred:name> \"Doha\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_528",
    "input_seq": "What is the connection between New Castle County to Kent County (the one whose inception time is 1683-01-01)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Castle County\" . ?e_2 <pred:name> \"Kent County\" . ?e_2 <inception> ?pv . ?pv <pred:date> \"1683-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_529",
    "input_seq": "How many animated films have the producer Danny Elfman or have less than 55 number of seasons?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" .  { ?e <producer> ?e_1 . ?e_1 <pred:name> \"Danny Elfman\" .  } UNION { ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"55\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_530",
    "input_seq": "What is the elevation above sea level of the United States city that is an administrative division of Mahoning County?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Mahoning County\" .  ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_531",
    "input_seq": "Elliott Gould was nominated for an Academy Award for Best Supporting Actor for which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Elliott Gould\" . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_532",
    "input_seq": "Which person has ISNI 0000 0001 2021 3909?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2021 3909\" .  }"
  },
  {
    "qid": "train_533",
    "input_seq": "What is the Common Procurement Vocabulary for police?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"police\" . ?e <Common_Procurement_Vocabulary> ?pv .  }"
  },
  {
    "qid": "train_534",
    "input_seq": "How is Emma Roberts related to the profession of actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Emma Roberts\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_535",
    "input_seq": "How many New York cities border Amarillo?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Amarillo\" .   }"
  },
  {
    "qid": "train_536",
    "input_seq": "Tell me the Munzinger IBA for Ellen Barkin.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ellen Barkin\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_537",
    "input_seq": "Twitter handle jonfavs belongs to the person who studied at which university?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"jonfavs\" .   }"
  },
  {
    "qid": "train_538",
    "input_seq": "What is the number of New York cities that are the twinned administrative body of Aleppo or are located in or adjacent to the Hudson River?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of New York\" .  { ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Aleppo\" .  } UNION { ?e <located_in_or_next_to_body_of_water> ?e_1 . ?e_1 <pred:name> \"Hudson River\" .  } }"
  },
  {
    "qid": "train_539",
    "input_seq": "Is the official website of the Montreal Canadiens http://canadiens.nhl.com/?",
    "target_seq": "ASK { ?e <pred:name> \"Montreal Canadiens\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://canadiens.nhl.com/\" .  }"
  },
  {
    "qid": "train_540",
    "input_seq": "When did a department, or departments, of France with INSEE department code eqial to 02, reach 538659 people?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"departments of France\" . ?e <INSEE_department_code> ?pv_1 . ?pv_1 <pred:value> \"02\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"538659\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_541",
    "input_seq": "Which person has ISNI 0000 0000 8367 3390?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8367 3390\" .  }"
  },
  {
    "qid": "train_542",
    "input_seq": "What is the height of the film character whose publisher is Marvel Comics ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film character\" . ?e <publisher> ?e_1 . ?e_1 <pred:name> \"Marvel Comics\" .  ?e <height> ?pv .  }"
  },
  {
    "qid": "train_543",
    "input_seq": "How many University of Cambridge colleges are different from Trinity Hall or own Albany (beginning in 1776)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Cambridge\" .  { ?e <different_from> ?e_1 . ?e_1 <pred:name> \"Trinity Hall\" .  } UNION { ?e_1 <owned_by> ?e . ?e_1 <pred:name> \"Albany\" . ?e_1 <inception> ?pv . ?pv <pred:year> 1776 .  } }"
  },
  {
    "qid": "train_544",
    "input_seq": "What is the connection between Saginaw County to Michigan?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saginaw County\" . ?e_2 <pred:name> \"Michigan\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_545",
    "input_seq": "What is the topic of the statement that All the King's Men whose genre is film based on literature was nominated for an Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"All the King's Men\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"film based on literature\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_546",
    "input_seq": "Is the title of the film produced by Dan Curtis Bram Stoker's Dracula?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Dan Curtis\" .  ?e <title> ?pv . ?pv <pred:value> \"Bram Stoker's Dracula\" .  }"
  },
  {
    "qid": "train_547",
    "input_seq": "Earth, clocking in at 115 minutes, had which region of release on 2019-05-17?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Earth\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"115\"^^xsd:double . ?e <publication_date> ?pv . ?pv <pred:date> \"2019-05-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_548",
    "input_seq": "When did Jefferson City become the capital of Missouri?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jefferson City\" . ?e_2 <pred:name> \"Missouri\" . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_550",
    "input_seq": "What is the connection between Pyongyang to Georgetown?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pyongyang\" . ?e_2 <pred:name> \"Georgetown\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_551",
    "input_seq": "How many private not-for-profit learning institutions are affiliated with the Carnegie Institute of Technology or have the establishment date 1887-01-01?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"private not-for-profit educational institution\" .  { ?e <affiliation> ?e_1 . ?e_1 <pred:name> \"Carnegie Institute of Technology\" .  } UNION { ?e <inception> ?pv . ?pv <pred:date> \"1887-01-01\"^^xsd:date .  } }"
  },
  {
    "qid": "train_552",
    "input_seq": "What are the number of counties of Massachusetts whose area is less than 45 square versta or whose inception time is before 1793 ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Massachusetts\" .  { ?e <area> ?pv . ?pv <pred:unit> \"square versta\" . ?pv <pred:value> ?v . FILTER ( ?v < \"45\"^^xsd:double ) .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1793 ) .  } }"
  },
  {
    "qid": "train_553",
    "input_seq": "Name the Twitter account belonging to the person who has a12357790 as their CANTIC-ID.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a12357790\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_554",
    "input_seq": "What does the bass guitar have to do with Frank Zappa?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"bass guitar\" . ?e_2 <pred:name> \"Frank Zappa\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_555",
    "input_seq": "Who died on 1998-01-01?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv . ?pv <pred:date> \"1998-01-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_556",
    "input_seq": "How many master's degrees are the academic degrees of the person who sets up in Worcester (the one whose population is 100842)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"master's degree\" . ?e_1 <academic_degree> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <location_of_formation> ?e_3 . ?e_3 <pred:name> \"Worcester\" . ?e_3 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"100842\"^^xsd:double .   }"
  },
  {
    "qid": "train_557",
    "input_seq": "What is the birth date of Jonah Hex, born Jonah Woodson Hex?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jonah Hex\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Jonah Woodson Hex\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_558",
    "input_seq": "What is the postal code of the city whose TERYT municipality code is 2469011?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <TERYT_municipality_code> ?pv_1 . ?pv_1 <pred:value> \"2469011\" . ?e <postal_code> ?pv .  }"
  },
  {
    "qid": "train_559",
    "input_seq": "How is the single-player video game Pinocchio related to the musical film Pinocchio?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pinocchio\" . ?e_1 <game_mode> ?e_3 . ?e_3 <pred:name> \"single-player video game\" . ?e_2 <pred:name> \"Pinocchio\" . ?e_2 <genre> ?e_4 . ?e_4 <pred:name> \"musical film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_560",
    "input_seq": "How many forms of government have the Human Development Index of .7 and a Human Development Index greater than .8?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.7\"^^xsd:double . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"0.8\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_561",
    "input_seq": "What is OFI Crete's native label?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"OFI Crete\" . ?e <native_label> ?pv .  }"
  },
  {
    "qid": "train_562",
    "input_seq": "Which one of video game console models comprising the platform of G.I. Joe: The Rise of Cobra (the one whose Nintendo GameID is RIJP69) recorded the smallest number of sold units ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e_1 <platform> ?e . ?e_1 <pred:name> \"G.I. Joe: The Rise of Cobra\" . ?e_1 <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"RIJP69\" . ?e <units_sold> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_563",
    "input_seq": "Which has the fewest episodes among the television series composed by musician Walter Murphy?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Walter Murphy\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"musician\" .  ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_564",
    "input_seq": "What was the theatre award that nominated Tony Shalhoub in 2013?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Tony Shalhoub\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e ] <point_in_time> ?qpv . ?qpv <pred:year> 2013 .  }"
  },
  {
    "qid": "train_565",
    "input_seq": "What language is https://www.highpointnc.gov/, the official webiste of a city in the United States whose PermID is 5000412555?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"5000412555\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.highpointnc.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_566",
    "input_seq": "What is the official website of Irvine (the one whose postal code is 92603)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Irvine\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"92603\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_567",
    "input_seq": "What is the name of the higher education institution that is located on  7777 S Lewis Ave., Tulsa, OK, 74171?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <located_at_street_address> ?pv . ?pv <pred:value> \"7777 S Lewis Ave., Tulsa, OK, 74171\" .  }"
  },
  {
    "qid": "train_568",
    "input_seq": "Does Vilnius or Invercargill occupy a larger area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Vilnius\" .  } UNION { ?e <pred:name> \"Invercargill\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_569",
    "input_seq": "Which Twitter handle belongs to the public company distinct from the Nokia with Finnish municipality number 536?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public company\" . ?e_1 <different_from> ?e . ?e_1 <pred:name> \"Nokia\" . ?e_1 <Finnish_municipality_number> ?pv_1 . ?pv_1 <pred:value> \"536\" . ?e <Twitter_username> ?pv .  }"
  },
  {
    "qid": "train_570",
    "input_seq": "What is the IAB code of tennis?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"tennis\" . ?e <IAB_code> ?pv .  }"
  },
  {
    "qid": "train_571",
    "input_seq": "When was the population of Leeds (area code 0113) 766399?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Leeds\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"0113\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"766399\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_572",
    "input_seq": "Is the episode count lower for Rogue (official website www.directv.com/premiums/audience/rogue) or for Rosemary's Baby, with Jason Isaacs as a cast member?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rogue\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.directv.com/premiums/audience/rogue\" . } UNION { ?e <pred:name> \"Rosemary's Baby\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jason Isaacs\" . } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_573",
    "input_seq": "How is Paul Francis Webster related to 26th Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paul Francis Webster\" . ?e_2 <pred:name> \"26th Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  }
]