[
  {
    "qid": "train_1378",
    "input_seq": "Which is longer, Iris with run-time 99 minutes or My Fair Lady?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Iris\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"99\"^^xsd:double . } UNION { ?e <pred:name> \"My Fair Lady\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1379",
    "input_seq": "How many subscribers does the band whose Instagram username is limpbizkit have under the Twitter username limpbizkit?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"limpbizkit\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"limpbizkit\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1380",
    "input_seq": "Which person's pseudonym is Кит Ричард?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Кит Ричард\" .  }"
  },
  {
    "qid": "train_1381",
    "input_seq": "Does Mary Tyler Moore or Shigeru Miyamoto have the less number of children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mary Tyler Moore\" .  } UNION { ?e <pred:name> \"Shigeru Miyamoto\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1382",
    "input_seq": "What is the role of Jason Bateman in Arrested Development?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Arrested Development\" . ?e_2 <pred:name> \"Jason Bateman\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1383",
    "input_seq": "Steve Blum is the head coach or trailblazers is the Instagram handle of how many total basketball teams?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball team\" .  { ?e <head_coach> ?e_1 . ?e_1 <pred:name> \"Steve Blum\" .  } UNION { ?e <Instagram_username> ?pv . ?pv <pred:value> \"trailblazers\" .  } }"
  },
  {
    "qid": "train_1384",
    "input_seq": "What city has the official website of http://www.bradford.gov.uk?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.bradford.gov.uk\" .  }"
  },
  {
    "qid": "train_1385",
    "input_seq": "Tell me the one with the least area within the historic England county that has an area not exactly 31000000 square kilometre",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"historic county of England\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"31000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1386",
    "input_seq": "What's the date of birth of the person who died on 1973-11-19?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1973-11-19\"^^xsd:date . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1387",
    "input_seq": "How many news programs originating in the USA have an episode count other than 8100?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v != \"8100\"^^xsd:double ) . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_1388",
    "input_seq": "Was the person with ISNI 0000 0001 1652 1351 born before 1976?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1652 1351\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1976 ) .  }"
  },
  {
    "qid": "train_1389",
    "input_seq": "Tell me the one that has a smaller area, Citrus County or Palm Beach County.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Citrus County\" .  } UNION { ?e <pred:name> \"Palm Beach County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1390",
    "input_seq": "Is the native language name for the person with an ISNI of 0000 0001 2141 1448, Anjelica Huston?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2141 1448\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Anjelica Huston\" .  }"
  },
  {
    "qid": "train_1391",
    "input_seq": "What is the connection between Portland Pirates to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Portland Pirates\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1392",
    "input_seq": "Where was the 1966-10-05 release of the visual artwork that earned 111700000 USD at the box office?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <box_office> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"111700000\"^^xsd:double . ?e <publication_date> ?pv . ?pv <pred:date> \"1966-10-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1393",
    "input_seq": "How is J. R. R. Tolkien related to military officer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"J. R. R. Tolkien\" . ?e_2 <pred:name> \"military officer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1394",
    "input_seq": "Which has the least area among the Wisconsin counties whose area is not 380 square miles?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Wisconsin\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square mile\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"380\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1395",
    "input_seq": "Which work did The Heiress receive National Board of Review Award for Best Actor for?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Heiress\" . ?e_2 <pred:name> \"National Board of Review Award for Best Actor\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1396",
    "input_seq": "For Merton College, of which class is its establishment in 1264 a special example?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Merton College\" . ?e <inception> ?pv . ?pv <pred:year> 1264 . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv .  }"
  },
  {
    "qid": "train_1397",
    "input_seq": "Who is the person with ISNI 0000 0001 2130 5098?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2130 5098\" .  }"
  },
  {
    "qid": "train_1398",
    "input_seq": "Tell me which person has less children, Mary McCormack or Madonna.",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Madonna\" .  } UNION { ?e <pred:name> \"Mary McCormack\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1399",
    "input_seq": "Which county is smaller, Milwaukee County or La Crosse County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Milwaukee County\" .  } UNION { ?e <pred:name> \"La Crosse County\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1400",
    "input_seq": "Which movie is longer, Blood Diamond or Lady in the Water?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Blood Diamond\" .  } UNION { ?e <pred:name> \"Lady in the Water\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1401",
    "input_seq": "What national association football team's country is Liechtenstein and affiliation is with sport association football?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"Liechtenstein\" .  ?e <sport> ?e_2 . ?e_2 <pred:name> \"association football\" .  }"
  },
  {
    "qid": "train_1402",
    "input_seq": "How many independent recording labels in the UK were established later than 1977?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent record label\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1977 ) .  }"
  },
  {
    "qid": "train_1403",
    "input_seq": "Which has the smallest area among the Illinois counties that border McHenry County?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Illinois\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"McHenry County\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1404",
    "input_seq": "Is the ISNI of the agent whose official English language website is https://www.nysenate.gov/ equal to 0000 0000 7823 7869?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.nysenate.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7823 7869\" .  }"
  },
  {
    "qid": "train_1405",
    "input_seq": "What is the ending date that the capital of the Confederate States of America is Richmond (whose local area code is 804)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Confederate States of America\" . ?e_2 <pred:name> \"Richmond\" . ?e_2 <local_dialing_code> ?pv . ?pv <pred:value> \"804\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_1406",
    "input_seq": "Which film is titled Grease?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv . ?pv <pred:value> \"Grease\" .  }"
  },
  {
    "qid": "train_1407",
    "input_seq": "When was the person with ISNI 0000 0001 1679 4173 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1679 4173\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1408",
    "input_seq": "Is the CANTIC-ID of Dino De Laurentiis a11121890?",
    "target_seq": "ASK { ?e <pred:name> \"Dino De Laurentiis\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11121890\" .  }"
  },
  {
    "qid": "train_1409",
    "input_seq": "Was the entertainment with http://storarovittorio.com/ not published in 1989?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"GKJS78\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1989 ) .  }"
  },
  {
    "qid": "train_1410",
    "input_seq": "In what location was the visual artwork titled Looney Tunes: Back in Action released on 2003-12-04?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Looney Tunes: Back in Action\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2003-12-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_1411",
    "input_seq": "How is David Kaye (received an education from UC Berkeley School of Law) related to Georgetown University Law Center?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"David Kaye\" . ?e_1 <educated_at> ?e_3 . ?e_3 <pred:name> \"UC Berkeley School of Law\" . ?e_2 <pred:name> \"Georgetown University Law Center\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1412",
    "input_seq": "What method determines that 169822 is the population of the Pennsylvania county whose official website is http://www.co.monroe.pa.us (this statement's language is English)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.co.monroe.pa.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv_1 . ?qpv_1 <pred:value> \"English\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"169822\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1413",
    "input_seq": "Is 0000 0001 2108 3878 the ISNI of the individual who directed The Simpsons Movie?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"The Simpsons Movie\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2108 3878\" .  }"
  },
  {
    "qid": "train_1414",
    "input_seq": "How is Sonic the Hedgehog, released on 2007-01-30, related to Knuckles the Echidna?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sonic the Hedgehog\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2007-01-30\"^^xsd:date . ?e_2 <pred:name> \"Knuckles the Echidna\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1415",
    "input_seq": "When wa born the person that was nominated for Tony Award for Best Actor in a Musical jn 1967?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Tony Award for Best Actor in a Musical\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1967 . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1416",
    "input_seq": "What language is associated with http://www.morgancreek.com/, the official website for Morgan Creek Productions?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Morgan Creek Productions\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.morgancreek.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1417",
    "input_seq": "As of 2009, what TV series aired originally on the station whose site is http://www.ctv.ca?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <original_network> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"television station\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.ctv.ca/\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <original_network> ; <pred:fact_t> ?e_1 ] <end_time> ?qpv . ?qpv <pred:year> 2009 .  }"
  },
  {
    "qid": "train_1418",
    "input_seq": "ISNI number 0000 0001 2026 9638 identifies which person?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2026 9638\" .  }"
  },
  {
    "qid": "train_1419",
    "input_seq": "How was it determined that Sonoma County has a population of 490596?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sonoma County\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"490596\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_1420",
    "input_seq": "What is the relationship between Heartbeats (the one whose release region is Germany) and IFC Films?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Heartbeats\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"Germany\" . ?e_2 <pred:name> \"IFC Films\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1421",
    "input_seq": "Is http://www.ketteringtownfc.co.uk/ the official website of Kettering Town F.C.?",
    "target_seq": "ASK { ?e <pred:name> \"Kettering Town F.C.\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ketteringtownfc.co.uk/\" .  }"
  },
  {
    "qid": "train_1422",
    "input_seq": "Which has more students, Knox College or Royal College of Art?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Knox College\" .  } UNION { ?e <pred:name> \"Royal College of Art\" .  } ?e <students_count> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1423",
    "input_seq": "Chris Messina was a SAG Award nominee for Outstanding Performance by a Cast in a Motion Picture for his work on which project?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chris Messina\" . ?e_2 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1424",
    "input_seq": "Upstairs, Downstairs earned a Peabody Award for which winning individual?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Upstairs, Downstairs\" . ?e_2 <pred:name> \"Peabody Award\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <winner> ?qpv .  }"
  },
  {
    "qid": "train_1425",
    "input_seq": "When did the 22-minute Neighbours reach 7750 episodes?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Neighbours\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"22\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7750\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1426",
    "input_seq": "When was the birth of the 2007 SAG nominee for Outstanding Performance by a Female Actor in a Supporting Role?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 2007 . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1427",
    "input_seq": "Tell me the end time of Quincy (that had started on 1976-10-03) that was originally aired on NBC.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Quincy\" . ?e_1 <start_time> ?pv . ?pv <pred:date> \"1976-10-03\"^^xsd:date . ?e_2 <pred:name> \"NBC\" . ?e_1 <original_network> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <original_network> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_1429",
    "input_seq": "For which work did Drake receive the Grammy Award for Best Rap/Sung Performance?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Drake\" . ?e_2 <pred:name> \"Grammy Award for Best Rap/Sung Performance\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1430",
    "input_seq": "Is A Christmas Carol the title of A Christmas Carol whose release date is 2010-12-25?",
    "target_seq": "ASK { ?e <pred:name> \"A Christmas Carol\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-12-25\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"A Christmas Carol\" .  }"
  },
  {
    "qid": "train_1431",
    "input_seq": "Whose work on Black Hawk Down earned an Academy Award nomination for Best Sound Mixing?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Black Hawk Down\" . ?e_2 <pred:name> \"Academy Award for Best Sound Mixing\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_1432",
    "input_seq": "What feature film is 0 minutes long and titled The Three Musketeers ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v != \"0\"^^xsd:double ) . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Three Musketeers\" .  }"
  },
  {
    "qid": "train_1433",
    "input_seq": "How many democracies have a population greater than 5.9 or a nominal GDP greater than 2500000000000 United States dollars?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"5.9\"^^xsd:double ) .  } UNION { ?e <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> ?v . FILTER ( ?v > \"2500000000000\"^^xsd:double ) .  } }"
  },
  {
    "qid": "train_1434",
    "input_seq": "When did the city with Dewey Decimal Classification is 2--764135 and population of 11679 originate?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--764135\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"11679\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1435",
    "input_seq": "I would like to know the relationship between Miracle at St. Anna to John Leguizamo.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Miracle at St. Anna\" . ?e_2 <pred:name> \"John Leguizamo\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1436",
    "input_seq": "What is the number of Christianity that has a religion the male given name that is the given name of Bobby Cannavale",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <religion> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"male given name\" . ?e_2 <given_name> ?e_1 . ?e_2 <pred:name> \"Bobby Cannavale\" .   }"
  },
  {
    "qid": "train_1437",
    "input_seq": "What person with ISNI 000 0001 1577 8462 was born in New York City ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"New York City\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1577 8462\" .  }"
  },
  {
    "qid": "train_1438",
    "input_seq": "What person was born in July 27, 1946?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1946-07-27\"^^xsd:date .  }"
  },
  {
    "qid": "train_1439",
    "input_seq": "How many states have a total rate of fertility exceeding 3.1 or a Human Development Index of 0.3?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" .  { ?e <total_fertility_rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"3.1\"^^xsd:double ) .  } UNION { ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.3\"^^xsd:double .  } }"
  },
  {
    "qid": "train_1440",
    "input_seq": "What is the connection between Manorama (the one whose date of birth is 1937-05-26) to playback singer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Manorama\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1937-05-26\"^^xsd:date . ?e_2 <pred:name> \"playback singer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1441",
    "input_seq": "Who is shorter, Mark Williams (the one that is a member of Wimbledon F.C.) or Richard Rodgers (the one whose height is 193 centimetre)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mark Williams\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Wimbledon F.C.\" . } UNION { ?e <pred:name> \"Richard Rodgers\" . ?e <height> ?pv_1 . ?pv_1 <pred:unit> \"centimetre\" . ?pv_1 <pred:value> \"193\"^^xsd:double . } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1442",
    "input_seq": "When did the person who won a Japan Academy Prize for Picture of the Year for The Ballad of Narayama die?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <winner> ?e . ?e_1 <pred:name> \"Japan Academy Prize for Picture of the Year\" .  [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e ] <for_work> ?qpv . ?qpv <pred:value> \"The Ballad of Narayama\" . ?e <date_of_death> ?pv .  }"
  },
  {
    "qid": "train_1443",
    "input_seq": "What is the connection between Shanghai (the one that is the twinned administrative body of Basel) to Dunedin?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shanghai\" . ?e_3 <twinned_administrative_body> ?e_1 . ?e_3 <pred:name> \"Basel\" . ?e_2 <pred:name> \"Dunedin\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1445",
    "input_seq": "What is the connection between Beauty and the Beast (the one that has Ewan McGregor as a cast member) to Emma Thompson?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Beauty and the Beast\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Ewan McGregor\" . ?e_2 <pred:name> \"Emma Thompson\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1446",
    "input_seq": "When was the Matthew Fox cast in Smokin' Aces born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Matthew Fox\" . ?e_1 <cast_member> ?e . ?e_1 <pred:name> \"Smokin' Aces\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_1447",
    "input_seq": "How is Death on the Nile, with Nino Rota as composer, connected to the 51st Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Death on the Nile\" . ?e_1 <composer> ?e_3 . ?e_3 <pred:name> \"Nino Rota\" . ?e_2 <pred:name> \"51st Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1448",
    "input_seq": "When did the county of California whose official website is http://www.smcgov.org have 765135 people?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.smcgov.org\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"765135\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1449",
    "input_seq": "Which language is associated with skateboarding, the subreddit of the type of sport whose video is Freeride Skateboarding & Downhill Slides.webm?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"type of sport\" . ?e <video> ?pv_1 . ?pv_1 <pred:value> \"Freeride Skateboarding & Downhill Slides.webm\" . ?e <subreddit> ?pv . ?pv <pred:value> \"skateboarding\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1450",
    "input_seq": "Is the FIPS 10-4 (countries and regions) of a Japanese prefecture that is the twinned administrative body of Ho Chi Minh City, SZ01 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"prefecture of Japan\" . ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:name> \"Ho Chi Minh City\" .  ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"SZ01\" .  }"
  },
  {
    "qid": "train_1452",
    "input_seq": "What art school was attended by the person with the official website of http://www.tim-roth.com/?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art school\" . ?e_1 <educated_at> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.tim-roth.com/\" .   }"
  },
  {
    "qid": "train_1453",
    "input_seq": "What work did Martin Sheen receive  Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series for ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series\" . ?e_2 <pred:name> \"Martin Sheen\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1454",
    "input_seq": "The is name Billy Dee Williams the same native language name as Michael J. Fox?",
    "target_seq": "ASK { ?e <pred:name> \"Billy Dee Williams\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Michael J. Fox\" .  }"
  },
  {
    "qid": "train_1455",
    "input_seq": "What is the main subject of Dr. Strangelove?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e_1 <main_subject> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"film\" . ?e_1 <title> ?pv_1 . ?pv_1 <pred:value> \"Dr. Strangelove\" .   }"
  },
  {
    "qid": "train_1456",
    "input_seq": "Is 0000 0001 1605 1927 the ISNI of the person born in Dehradun?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"Dehradun\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1605 1927\" .  }"
  },
  {
    "qid": "train_1457",
    "input_seq": "When was Club Universitario de Deportes founded?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Club Universitario de Deportes\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1458",
    "input_seq": "Tell me the one with a smaller duration, Anatomy of a Murder or Raging Bull",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Anatomy of a Murder\" .  } UNION { ?e <pred:name> \"Raging Bull\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1459",
    "input_seq": "Is the area of South America or the Andes smaller?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"South America\" .  } UNION { ?e <pred:name> \"Andes\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1460",
    "input_seq": "What is the connection between Akira Toriyama to Shueisha?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Akira Toriyama\" . ?e_2 <pred:name> \"Shueisha\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1461",
    "input_seq": "Which state in India with an urban population over 145000 has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <urban_population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"145000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  }
]