[
  {
    "qid": "train_2374",
    "input_seq": "What work is titled Cleopatra and casts John Carradine?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Cleopatra\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"John Carradine\" .  }"
  },
  {
    "qid": "train_2377",
    "input_seq": "What is the official website of the city of the United States that is the residence of John Hughes (the one that lives in Lake Forest) ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <residence> ?e . ?e_1 <pred:name> \"John Hughes\" . ?e_1 <residence> ?e_2 . ?e_2 <pred:name> \"Lake Forest\" .  ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_2378",
    "input_seq": "What county is the largest in California?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of California\" . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2379",
    "input_seq": "What number of feature films orginate from France?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <country_of_origin> ?e_1 . ?e_1 <pred:name> \"France\" .   }"
  },
  {
    "qid": "train_2380",
    "input_seq": "The website www.laskerfoundation.org/awards/formerwin.htm represents which award for science?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science award\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.laskerfoundation.org/awards/formerwin.htm\" .  }"
  },
  {
    "qid": "train_2381",
    "input_seq": "What is the native language name of the person who has On the Waterfront as a notable work?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <notable_work> ?e_1 . ?e_1 <pred:name> \"On the Waterfront\" .  ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_2382",
    "input_seq": "What is the time period that 3360581 is the population of the first-level administrative country subdivision whose detail map is POL województwo małopolskie map marked.svg?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <detail_map> ?pv_1 . ?pv_1 <pred:value> \"POL województwo małopolskie map marked.svg\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3360581\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2383",
    "input_seq": "Tell me the start time of Gerry Conway (who is a United Kingdom citizen) is a member of Jethro Tull.",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gerry Conway\" . ?e_1 <country_of_citizenship> ?e_3 . ?e_3 <pred:name> \"United Kingdom\" . ?e_2 <pred:name> \"Jethro Tull\" . ?e_1 <member_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2384",
    "input_seq": "When was Punjab in British Raj no longer the location of Rawalpindi ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rawalpindi\" . ?e_2 <pred:name> \"Punjab\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_3 . ?e_3 <pred:name> \"British Raj\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2385",
    "input_seq": "Of visual artworks that won at the 75th Academy Awards, which has the shortest run-time?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"75th Academy Awards\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2386",
    "input_seq": "What does Carrie (whose color is black-and-white) have to do with Chicago (the working location of Billy Corgan)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Carrie\" . ?e_1 <color> ?e_3 . ?e_3 <pred:name> \"black-and-white\" . ?e_2 <pred:name> \"Chicago\" . ?e_4 <work_location> ?e_2 . ?e_4 <pred:name> \"Billy Corgan\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2387",
    "input_seq": "Which one, Annie (the one whose cost is 65000000 United States dollar) or The Dark Knight (the one whose official website is https://www.warnerbros.com/dark-knight), has greater duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Annie\" . ?e <cost> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"65000000\"^^xsd:double . } UNION { ?e <pred:name> \"The Dark Knight\" . ?e <official_website> ?pv_2 . ?pv_2 <pred:value> \"https://www.warnerbros.com/dark-knight\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2388",
    "input_seq": "When did the administrative territorial entity with Bern as its capital have a population numbering 1031126?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Bern\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1031126\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2390",
    "input_seq": "How many chemical elements are named after Moon (the narrative location of 2001: A Space Odyssey) or use J41CSQ7QDS as UNII ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical element\" .  { ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Moon\" . ?e_2 <narrative_location> ?e_1 . ?e_2 <pred:name> \"2001: A Space Odyssey\" .  } UNION { ?e <UNII> ?pv . ?pv <pred:value> \"J41CSQ7QDS\" .  } }"
  },
  {
    "qid": "train_2391",
    "input_seq": "What sectarian violence is localized in the first-level administrative country subdivision whose female citizens are the Nordirin people?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sectarian violence\" . ?e <location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"first-level administrative country subdivision\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"Nordirin\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv . ?qpv <pred:value> \"feminine\" .   }"
  },
  {
    "qid": "train_2392",
    "input_seq": "Which is sorter, Casino Royale designed by Peter Lamont or Cowboys & Aliens?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Casino Royale\" . ?e <production_designer> ?e_1 . ?e_1 <pred:name> \"Peter Lamont\" .   } UNION { ?e <pred:name> \"Cowboys & Aliens\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2393",
    "input_seq": "When was Russi Taylor born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Russi Taylor\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2394",
    "input_seq": "Was an 'activity' whose Nintendo GameID is SA3P5G, published after 2012 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"SA3P5G\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2012 ) .  }"
  },
  {
    "qid": "train_2395",
    "input_seq": "What is the title of the television film whose release date is in 1992?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:year> 1992 . ?e <title> ?pv .  }"
  },
  {
    "qid": "train_2396",
    "input_seq": "Long Beach, birthplace of Ed Lauter, is in which administrative territorial entity ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ed Lauter\" . ?e_2 <pred:name> \"Long Beach\" . ?e_3 <place_of_birth> ?e_2 . ?e_3 <pred:name> \"Ed Lauter\" . ?e_1 <place_of_birth> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <place_of_birth> ; <pred:fact_t> ?e_2 ] <located_in_the_administrative_territorial_entity> ?qpv .  }"
  },
  {
    "qid": "train_2397",
    "input_seq": "Since when is the Hichamal Pradesh administrative division (bordering Jammu and Kashmir) a part of India (the one that has a diplomatic relation with Iran)  ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"India\" . ?e_3 <diplomatic_relation> ?e_1 . ?e_3 <pred:name> \"Iran\" . ?e_2 <pred:name> \"Himachal Pradesh\" . ?e_2 <shares_border_with> ?e_4 . ?e_4 <pred:name> \"Jammu and Kashmir\" . ?e_1 <contains_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_2398",
    "input_seq": "When was Brownsville established?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brownsville\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2399",
    "input_seq": "Some Like It Hot, an Academy Award nominee for Best Director, was published in what location on 1959-09-17?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Some Like It Hot\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Director\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1959-09-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_2400",
    "input_seq": "Is 0000 0004 0378 0882 the ISNI of the person whose Libris-URI is fcrtwcjz2nsw253?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"fcrtwcjz2nsw253\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0378 0882\" .  }"
  },
  {
    "qid": "train_2401",
    "input_seq": "How many subscribers does the twitter user JeremySisto, who has an ISNI number of 0000 0001 1472 9810, have?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1472 9810\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"JeremySisto\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2402",
    "input_seq": "I'd like to know the relationship between Michael Stuhlbarg to the University of London.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Stuhlbarg\" . ?e_2 <pred:name> \"University of London\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2403",
    "input_seq": "Among the states of India whose country is India (whose population is 1252139596), which has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"India\" . ?e_1 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1252139596\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2404",
    "input_seq": "What rock band has a beginning date that is after 1967 and is famous for alternative dance?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1967 ) . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"alternative dance\" .  }"
  },
  {
    "qid": "train_2405",
    "input_seq": "What number of art movements were founded not in 1950?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art movement\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1950 ) .  }"
  },
  {
    "qid": "train_2406",
    "input_seq": "When did the public university that goes by the Twitter name fu_berlin have a student enrollment of 34,518?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"public university\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"fu_berlin\" . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"34518\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2407",
    "input_seq": "Kelly Osbourne has how many hair colors?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" . ?e_1 <hair_color> ?e . ?e_1 <pred:name> \"Kelly Osbourne\" .   }"
  },
  {
    "qid": "train_2408",
    "input_seq": "Is Iron Man 3 or Shakespeare in Love longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Iron Man 3\" .  } UNION { ?e <pred:name> \"Shakespeare in Love\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2409",
    "input_seq": "What is the connection between Genesis (the one whose production code is 271) to Brent Spiner?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Genesis\" . ?e_1 <production_code> ?pv . ?pv <pred:value> \"271\" . ?e_2 <pred:name> \"Brent Spiner\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2410",
    "input_seq": "Which Texas county that is located in Texas (that is situated in the Central Time Zone) has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Texas\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Texas\" . ?e_1 <located_in_time_zone> ?e_2 . ?e_2 <pred:name> \"Central Time Zone\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2411",
    "input_seq": "What number of video game developers are the parent organization of U.S. Gold?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e_1 <parent_organization> ?e . ?e_1 <pred:name> \"U.S. Gold\" .   }"
  },
  {
    "qid": "train_2412",
    "input_seq": "Which person's ISNI is 0000 0003 6510 0582?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 6510 0582\" .  }"
  },
  {
    "qid": "train_2413",
    "input_seq": "Is the ISNI of Jeetendra 0000 0003 8237 7380 ?",
    "target_seq": "ASK { ?e <pred:name> \"Jeetendra\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 8237 7380\" .  }"
  },
  {
    "qid": "train_2414",
    "input_seq": "What is the number of newscast having the official website http://www.today.com or the talk show genre?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.today.com\" .  } UNION { ?e <genre> ?e_1 . ?e_1 <pred:name> \"talk show\" .  } }"
  },
  {
    "qid": "train_2415",
    "input_seq": "Does Caverphone P11111 belong to the masculine first name with the nickname Pol?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"male given name\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Pol\" . ?e <Caverphone> ?pv . ?pv <pred:value> \"P11111\" .  }"
  },
  {
    "qid": "train_2416",
    "input_seq": "Which is longer in duration, My Neighbor Totoro or Bird?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"My Neighbor Totoro\" .  } UNION { ?e <pred:name> \"Bird\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2417",
    "input_seq": "What is the number of points in the match for Oscar (that is a member of FC Inter Milan) as a member of S.C. Internacional?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Oscar\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"FC Inter Milan\" . ?e_2 <pred:name> \"S.C. Internacional\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <number_of_points/goals/set_scored> ?qpv .  }"
  },
  {
    "qid": "train_2418",
    "input_seq": "What is the Snapchat username of the person whose official website is https://www.ellentube.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.ellentube.com/\" . ?e <Snapchat_username> ?pv .  }"
  },
  {
    "qid": "train_2419",
    "input_seq": "Is soccer's Lima or is Leon Trotsky taller?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lima\" . ?e <sport> ?e_1 . ?e_1 <pred:name> \"association football\" .   } UNION { ?e <pred:name> \"Leon Trotsky\" .  } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_2420",
    "input_seq": "Is On the Waterfront or Live and Let Die (featuring cast member Jane Seymour) shorter in duration?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"On the Waterfront\" .  } UNION { ?e <pred:name> \"Live and Let Die\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jane Seymour\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2421",
    "input_seq": "When did Hindi-language Gujarat record a population of 31,491,260 males?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Gujarat\" . ?e <language_used> ?e_1 . ?e_1 <pred:name> \"Hindi\" .  ?e <male_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"31491260\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <male_population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2422",
    "input_seq": "Which movie is shorter, 13 Assassins (the one whose release region is New Zealand) or Batman (the one whose production company is 20th Century Fox)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"13 Assassins\" . ?e <film_release_region> ?e_1 . ?e_1 <pred:name> \"New Zealand\" .   } UNION { ?e <pred:name> \"Batman\" . ?e <production_company> ?e_2 . ?e_2 <pred:name> \"20th Century Fox\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2423",
    "input_seq": "Does Vittorio De Sica or Lyndon B. Johnson have fewer children?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Vittorio De Sica\" .  } UNION { ?e <pred:name> \"Lyndon B. Johnson\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2424",
    "input_seq": "What is the Wisconsin county whose FIPS 6-4 (US counties) is 55079?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Wisconsin\" . ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"55079\" .  }"
  },
  {
    "qid": "train_2425",
    "input_seq": "Between Rushmore or Chocolat, an Academy Award nominee for Best Supporting Actress, which is shorter?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rushmore\" .  } UNION { ?e <pred:name> \"Chocolat\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actress\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2426",
    "input_seq": "How many feminine first names are in French or are the first name of Laura Dern?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"female given name\" .  { ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"French\" .  } UNION { ?e_1 <given_name> ?e . ?e_1 <pred:name> \"Laura Dern\" .  } }"
  },
  {
    "qid": "train_2427",
    "input_seq": "For the association football club whose nickname is Αστικοί Πολεμιστές, how many subscribers does the user have for its Twitter username of ajaxct?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Αστικοί Πολεμιστές\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"ajaxct\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_2428",
    "input_seq": "How many art schools have the street address 36 S Wabash, Chicago, IL, 60603?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art school\" . ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"36 S Wabash, Chicago, IL, 60603\" .  }"
  },
  {
    "qid": "train_2429",
    "input_seq": "What is the connection between Veracruz (the one that is located in Mexico) to Chiapas?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Veracruz\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_3 . ?e_3 <pred:name> \"Mexico\" . ?e_2 <pred:name> \"Chiapas\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2430",
    "input_seq": "How is Roger Taylor whose ISNI is 0000 0001 1451 0544 related to new wave?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roger Taylor\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1451 0544\" . ?e_2 <pred:name> \"new wave\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2431",
    "input_seq": "What capital is the twinned administrative body of Stavanger?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Stavanger\" .   }"
  },
  {
    "qid": "train_2432",
    "input_seq": "What is the relationship between Samson and Delilah (the one that is shot in Mexico) and Max von Sydow?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Samson and Delilah\" . ?e_1 <filming_location> ?e_3 . ?e_3 <pred:name> \"Mexico\" . ?e_2 <pred:name> \"Max von Sydow\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2433",
    "input_seq": "What is the date of birth for the human whose ISNI is 0000 0001 2146 7732?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2146 7732\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_2434",
    "input_seq": "For what did John Barry (whose date of birth is 1935-07-03) receive an Academy Award for Best Production Design?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"John Barry\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1935-07-03\"^^xsd:date . ?e_2 <pred:name> \"Academy Award for Best Production Design\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_2435",
    "input_seq": "What is the commencement date of the band whose official website is http://www.inxs.com",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.inxs.com\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_2436",
    "input_seq": "When did an administrative territorial entity, containing Jackson (the one whose inception time is 1821 administrative division, reach the population of 98,511 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Jackson\" . ?e_1 <inception> ?pv_1 . ?pv_1 <pred:year> 1821 . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"98511\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2437",
    "input_seq": "What is the local dialing code of the human settlement where Donald M. Payne died?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human settlement\" . ?e_1 <place_of_death> ?e . ?e_1 <pred:name> \"Donald M. Payne\" .  ?e <local_dialing_code> ?pv .  }"
  },
  {
    "qid": "train_2438",
    "input_seq": "What is the number of chemical compound that is a nutrient of Allium cepa ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e_1 <nutrient> ?e . ?e_1 <pred:name> \"Allium cepa\" .   }"
  },
  {
    "qid": "train_2439",
    "input_seq": "What independent city has the FIPS 6-4 (US counties) 51790?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"51790\" .  }"
  },
  {
    "qid": "train_2440",
    "input_seq": "What is the video game published before 2013 and that has Kevin Michael Richardson as a voice actor?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2013 ) . ?e <voice_actor> ?e_1 . ?e_1 <pred:name> \"Kevin Michael Richardson\" .  }"
  },
  {
    "qid": "train_2441",
    "input_seq": "What is the area of the ceremonial county of England where Anne Hathaway, who was born on 1556-01-01, is buried?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e_1 <place_of_burial> ?e . ?e_1 <pred:name> \"Anne Hathaway\" . ?e_1 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1556-01-01\"^^xsd:date . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_2442",
    "input_seq": "When was Kharkiv no longer the capital of the Ukrainian Soviet Socialist Republic?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ukrainian Soviet Socialist Republic\" . ?e_2 <pred:name> \"Kharkiv\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_2443",
    "input_seq": "what is the OSM tag or key for Joseon?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Joseon\" . ?e <OSM_tag_or_key> ?pv .  }"
  },
  {
    "qid": "train_2444",
    "input_seq": "What is the connection between Michael Redgrave to knight (the one that is the military rank of Michael Redgrave)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Redgrave\" . ?e_2 <pred:name> \"knight\" . ?e_3 <military_rank> ?e_2 . ?e_3 <pred:name> \"Michael Redgrave\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2445",
    "input_seq": "What visual artwork, which is more than 60 minutes long and whose official website is http://syrianamovie.warnerbros.com/, do we know ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v > \"60\"^^xsd:double ) . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://syrianamovie.warnerbros.com/\" .  }"
  },
  {
    "qid": "train_2446",
    "input_seq": "What war's location is the Russian Empire and end time is before 1909?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <location> ?e_1 . ?e_1 <pred:name> \"Russian Empire\" .  ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1909 ) .  }"
  },
  {
    "qid": "train_2447",
    "input_seq": "When did the English ceremonial county, whose FIPS 10-4 (countries and regions) is UKE2, reach the population of 800,200 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKE2\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"800200\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_2448",
    "input_seq": "How is Smallville related to the fantasy genre?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Smallville\" . ?e_2 <pred:name> \"fantasy\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2449",
    "input_seq": "Was College Boy the nickname of Tom Johnson (born 1889-04-22)?",
    "target_seq": "ASK { ?e <pred:name> \"Tom Johnson\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1889-04-22\"^^xsd:date . ?e <nickname> ?pv . ?pv <pred:value> \"College Boy\" .  }"
  },
  {
    "qid": "train_2450",
    "input_seq": "Which has a lesser number of episodes, Lost, season 3 or Cranford?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lost, season 3\" .  } UNION { ?e <pred:name> \"Cranford\" .  } ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_2451",
    "input_seq": "How is Clash of the Titans published on 1981-01-01 related to children's film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Clash of the Titans\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1981-01-01\"^^xsd:date . ?e_2 <pred:name> \"children's film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2452",
    "input_seq": "Which Washington county's population surpassed 850000 in 2010?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Washington\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"850000\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:year> 2010 .  }"
  },
  {
    "qid": "train_2453",
    "input_seq": "Is the local dialing code of Palm Beach 207?",
    "target_seq": "ASK { ?e <pred:name> \"Palm Beach\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"207\" .  }"
  },
  {
    "qid": "train_2454",
    "input_seq": "How is Donald Crisp related to stroke?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Donald Crisp\" . ?e_2 <pred:name> \"stroke\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_2455",
    "input_seq": "How many associations are headquartered in the US city officially called Beverly Hills?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city of the United States\" . ?e_1 <official_name> ?pv . ?pv <pred:value> \"Beverly Hills\" .   }"
  },
  {
    "qid": "train_2456",
    "input_seq": "What cable channel is the production company of the television film whose title is Babylon 5: The Gathering?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cable channel\" . ?e_1 <production_company> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"television film\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Babylon 5: The Gathering\" .   }"
  }
]