[
  {
    "qid": "train_3789",
    "input_seq": "What was the inception time for the organization whose dissolution date was on 2005-12-31?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2005-12-31\"^^xsd:date . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_3790",
    "input_seq": "Which person is the movement postmodernism?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <movement> ?e_1 . ?e_1 <pred:name> \"postmodernism\" .   }"
  },
  {
    "qid": "train_3791",
    "input_seq": "Metro-Goldwyn-Mayer has produced how many TV shows?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television program\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Metro-Goldwyn-Mayer\" .   }"
  },
  {
    "qid": "train_3792",
    "input_seq": "What military branch's headquarter location is Moscow (the one whose population is 241500) and country is the Russian Soviet Federative Socialist Republic (the one that is the country of Turku)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"military branch\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Moscow\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"241500\"^^xsd:double .  ?e <country> ?e_2 . ?e_2 <pred:name> \"Russian Soviet Federative Socialist Republic\" . ?e_3 <country> ?e_2 . ?e_3 <pred:name> \"Turku\" .  }"
  },
  {
    "qid": "train_3793",
    "input_seq": "What is Eric Bana's scope as a performer in Hulk, which uses English as the native language?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hulk\" . ?e_1 <native_language> ?e_3 . ?e_3 <pred:name> \"English\" . ?e_2 <pred:name> \"Eric Bana\" . ?e_1 <performer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <performer> ; <pred:fact_t> ?e_2 ] <of> ?qpv .  }"
  },
  {
    "qid": "train_3795",
    "input_seq": "What is the connection between Calgary Stampeders to Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Calgary Stampeders\" . ?e_2 <pred:name> \"Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3796",
    "input_seq": "What is the relationship between Scrubs and George Takei?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Scrubs\" . ?e_2 <pred:name> \"George Takei\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3797",
    "input_seq": "How does ISNI designate the John Byrne corresponding to CANTIC-ID a11793533?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John Byrne\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11793533\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3798",
    "input_seq": "Between Alice in Wonderland (which features Json Flemyng in the cast) or Jesus of Nazareth, which has a shorter running time?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Alice in Wonderland\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Jason Flemyng\" .   } UNION { ?e <pred:name> \"Jesus of Nazareth\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3799",
    "input_seq": "Which has less of an elevation above sea level, Holyoke or Midland (the one whose postal code is 48640–48686)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Holyoke\" . } UNION { ?e <pred:name> \"Midland\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"48640–48686\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3800",
    "input_seq": "Between the 99-minute version of Cheyenne and Pride & Prejudice, which one of them is longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cheyenne\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"99\"^^xsd:double . } UNION { ?e <pred:name> \"Pride & Prejudice\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3801",
    "input_seq": "What are the number of woodwind instruments used by the person whose birth name is Robert Scott Smith ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"woodwind instrument\" . ?e_1 <instrument> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Robert Scott Smith\" .   }"
  },
  {
    "qid": "train_3802",
    "input_seq": "Which band is famous for ambient music and is the composer of Catch Me If You Can (which has Grant Heslov as a cast member)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"ambient music\" .  ?e_2 <composer> ?e . ?e_2 <pred:name> \"Catch Me If You Can\" . ?e_2 <cast_member> ?e_3 . ?e_3 <pred:name> \"Grant Heslov\" .  }"
  },
  {
    "qid": "train_3803",
    "input_seq": "Did the person who was born on 1870-01-11 die on 1942-10-22?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1870-01-11\"^^xsd:date . ?e <date_of_death> ?pv . ?pv <pred:date> \"1942-10-22\"^^xsd:date .  }"
  },
  {
    "qid": "train_3804",
    "input_seq": "When did James Taylor (the one whose genre is country music) become the spouse of Carly Simon?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"James Taylor\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"country music\" . ?e_2 <pred:name> \"Carly Simon\" . ?e_1 <spouse> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <spouse> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3805",
    "input_seq": "What person studied at Sarah Lawrence College and stopped working in 2016?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <educated_at> ?e_1 . ?e_1 <pred:name> \"Sarah Lawrence College\" .  ?e <work_period_(end)> ?pv . ?pv <pred:year> 2016 .  }"
  },
  {
    "qid": "train_3806",
    "input_seq": "How many of the China provinces either have the administrative division of Qingdao or have the official website of http://www.shanxigov.cn?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" .  { ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Qingdao\" .  } UNION { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.shanxigov.cn\" .  } }"
  },
  {
    "qid": "train_3807",
    "input_seq": "Which is physically smaller, Wayne County (ISNI 0000 0004 0400 9088) or Berrien County?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wayne County\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0400 9088\" . } UNION { ?e <pred:name> \"Berrien County\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3808",
    "input_seq": "Among the news whose number of seasons is less than 50, which has the smallest number of episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"50\"^^xsd:double ) . ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3809",
    "input_seq": "What is the connection between University of San Francisco to United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of San Francisco\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3810",
    "input_seq": "For the school with a headquarter location in NYC (the postal code is 10032), what language is its official website, http://ps.columbia.edu/?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"New York City\" . [ <pred:fact_h> ?e ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_1 ] <postal_code> ?qpv_1 . ?qpv_1 <pred:value> \"10032\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://ps.columbia.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3811",
    "input_seq": "How does Dewey Decimal classify the city whose official website is www.montevideo.gub.uy?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.montevideo.gub.uy\" . ?e <Dewey_Decimal_Classification> ?pv .  }"
  },
  {
    "qid": "train_3812",
    "input_seq": "How is the BAFTA Award for Best Editing related to Sam O'Steen?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"BAFTA Award for Best Editing\" . ?e_2 <pred:name> \"Sam O'Steen\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3813",
    "input_seq": "How many ethnic groups are of the Catholic faith or have the demonym רוסיה?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic group\" .  { ?e <religion> ?e_1 . ?e_1 <pred:name> \"Catholic Church\" .  } UNION { ?e <demonym> ?pv . ?pv <pred:value> \"רוסיה\" .  } }"
  },
  {
    "qid": "train_3814",
    "input_seq": "When did Taiwo Atieno join the Puerto Rico Islanders team?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Taiwo Atieno\" . ?e_2 <pred:name> \"Puerto Rico Islanders\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3815",
    "input_seq": "Of states with a rate of inflation other than 4600 percent, which has the lowest real GDP rate of growth?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <inflation_rate> ?pv_1 . ?pv_1 <pred:unit> \"percentage\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"4600\"^^xsd:double ) . ?e <real_gross_domestic_product_growth_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3816",
    "input_seq": "What is the link between Escondido and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Escondido\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3817",
    "input_seq": "How many constitutional monarchies there are with an inflation rate of 6500%?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"constitutional monarchy\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> \"6500\"^^xsd:double .  }"
  },
  {
    "qid": "train_3818",
    "input_seq": "What is the official website of Letters from Iwo Jima?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Letters from Iwo Jima\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_3819",
    "input_seq": "Is the release date of the film titled Tess prior to 1984?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Tess\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1984 ) .  }"
  },
  {
    "qid": "train_3820",
    "input_seq": "How many Chines province have a city, whose dialing code is 0362, as their capital ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of China\" . ?e <capital> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"0362\" .   }"
  },
  {
    "qid": "train_3821",
    "input_seq": "What film was published on the date of 1982-12-16?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1982-12-16\"^^xsd:date .  }"
  },
  {
    "qid": "train_3822",
    "input_seq": "Which recording label is associated with the person with the official website www.stevencurtischapman.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e_1 <record_label> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.stevencurtischapman.com/\" .   }"
  },
  {
    "qid": "train_3823",
    "input_seq": "Is Arabic's ISO 639-2 code, ces?",
    "target_seq": "ASK { ?e <pred:name> \"Arabic\" . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"ces\" .  }"
  },
  {
    "qid": "train_3824",
    "input_seq": "Between Rensselaer County or the Columbia County that borders Berkshire County, which occupies more area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Rensselaer County\" .  } UNION { ?e <pred:name> \"Columbia County\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Berkshire County\" .   } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3825",
    "input_seq": "Where was a movie, whose composer is Loudon Wainwright III, published on 23rd August 2007 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Loudon Wainwright III\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"2007-08-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv .  }"
  },
  {
    "qid": "train_3826",
    "input_seq": "Which movie is longer, The Three Musketeers (the one whose duration is 63 minute) or Gentleman's Agreement?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Three Musketeers\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"63\"^^xsd:double . } UNION { ?e <pred:name> \"Gentleman's Agreement\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3827",
    "input_seq": "Which TV series titled Boston Legal was a winner at the 58th Primetime Emmy Awards?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <title> ?pv . ?pv <pred:value> \"Boston Legal\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"58th Primetime Emmy Awards\" .  }"
  },
  {
    "qid": "train_3828",
    "input_seq": "For the movie that is called Judgment at Nuremberg is the duration not exactly 10 weeks?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Judgment at Nuremberg\" . ?e <duration> ?pv . ?pv <pred:unit> \"week\" . ?pv <pred:value> ?v . FILTER ( ?v != \"10\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3829",
    "input_seq": "When was association football manager James Stewart born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"James Stewart\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"association football manager\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3830",
    "input_seq": "When did Johann Wolfgang von Goethe begin his education at the University of Strasbourg?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Johann Wolfgang von Goethe\" . ?e_2 <pred:name> \"University of Strasbourg\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3831",
    "input_seq": "Which area is smaller, Southeast Asia or Antilles?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Southeast Asia\" .  } UNION { ?e <pred:name> \"Antilles\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3832",
    "input_seq": "Which human has a Munzinger IBA of 00000014293 and ISNI of 0000 0001 1456 0322?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv . ?pv <pred:value> \"00000014293\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1456 0322\" .  }"
  },
  {
    "qid": "train_3833",
    "input_seq": "What landform is located in Honolulu County and has an elevation above sea level more than 0 feet?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Honolulu County\" .  ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"foot\" . ?pv <pred:value> ?v . FILTER ( ?v > \"0\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3834",
    "input_seq": "Which US state has the official website http://www.nh.gov?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nh.gov\" .  }"
  },
  {
    "qid": "train_3835",
    "input_seq": "Which miniseries ended on 1977-01-30?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <end_time> ?pv . ?pv <pred:date> \"1977-01-30\"^^xsd:date .  }"
  },
  {
    "qid": "train_3836",
    "input_seq": "What is the relationship between avant-garde metal and Devin Townsend?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"avant-garde metal\" . ?e_2 <pred:name> \"Devin Townsend\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3837",
    "input_seq": "When did Margot Kidder become a citizen of United States of America?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Margot Kidder\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 <country_of_citizenship> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country_of_citizenship> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3838",
    "input_seq": "What is the connection between Doctor Who (the one that has Steven Moffat as an executive producer) to Alex Kingston?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Doctor Who\" . ?e_1 <executive_producer> ?e_3 . ?e_3 <pred:name> \"Steven Moffat\" . ?e_2 <pred:name> \"Alex Kingston\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3839",
    "input_seq": "How many conversation medium that applies to jurisdiction over New Brunswick (the one that stocks border with Prince Edward Island) or that derives The Count of Monte Cristo (the one that has Guy Pearce as a solid member).",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"communication medium\" .  { ?e <applies_to_jurisdiction> ?e_1 . ?e_1 <pred:name> \"New Brunswick\" . ?e_2 <shares_border_with> ?e_1 . ?e_2 <pred:name> \"Prince Edward Island\" .  } UNION { ?e <derivative_work> ?e_1 . ?e_1 <pred:name> \"The Count of Monte Cristo\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Guy Pearce\" .  } }"
  },
  {
    "qid": "train_3840",
    "input_seq": "Which county of Ireland that shares a border with Northern Ireland has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Ireland\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Northern Ireland\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3841",
    "input_seq": "What is the connection between A View to a Kill (the one whose production company is Metro-Goldwyn-Mayer) to Dolph Lundgren?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A View to a Kill\" . ?e_1 <production_company> ?e_3 . ?e_3 <pred:name> \"Metro-Goldwyn-Mayer\" . ?e_2 <pred:name> \"Dolph Lundgren\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3842",
    "input_seq": "What is the Dewey Decimal Classification of the big city whose place name sign is Lyon 3e - Panneau entrée Lyon.jpg?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <place_name_sign> ?pv_1 . ?pv_1 <pred:value> \"Lyon 3e - Panneau entrée Lyon.jpg\" . ?e <Dewey_Decimal_Classification> ?pv .  }"
  },
  {
    "qid": "train_3843",
    "input_seq": "What is the Munzinger IBA of Tim Roth?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tim Roth\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_3844",
    "input_seq": "Is the official website for Dino De Laurentiis equal to http://www.co.lake.ca.us?",
    "target_seq": "ASK { ?e <pred:name> \"Dino De Laurentiis\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.co.lake.ca.us\" .  }"
  },
  {
    "qid": "train_3845",
    "input_seq": "How many activities have a health specialty schizophrenia or a publication date after 2008?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" .  { ?e_1 <health_specialty> ?e . ?e_1 <pred:name> \"schizophrenia\" .  } UNION { ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2008 ) .  } }"
  },
  {
    "qid": "train_3846",
    "input_seq": "What association football team's headquarters is located in the city whose Italian cadastre code is C351?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"city\" . ?e_1 <Italian_cadastre_code> ?pv . ?pv <pred:value> \"C351\" .   }"
  },
  {
    "qid": "train_3847",
    "input_seq": "Of the mountain ranges with the elevation of over 850 feet above sea level, which one is situated at the highest location above sea level ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mountain range\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"foot\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"850\"^^xsd:double ) . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3848",
    "input_seq": "What FIPS 10-4 (countries and regions) is applicable to the twinned administrative body of Duisburg known as Portsmouth?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Portsmouth\" . ?e <twinned_administrative_body> ?e_1 . ?e_1 <pred:name> \"Duisburg\" .  ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }"
  },
  {
    "qid": "train_3849",
    "input_seq": "What is the language of http://www.westorange.org/, which is the official website for West Orange?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"West Orange\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.westorange.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3850",
    "input_seq": "Which visual artwork is a part of The Fast and the Furious (which contains 2 Fast 2 Furious), having the series ordinal of 1?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <part_of_the_series> ?e_1 . ?e_1 <pred:name> \"The Fast and the Furious\" . ?e_2 <part_of_the_series> ?e_1 . ?e_2 <pred:name> \"2 Fast 2 Furious\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_1 ] <series_ordinal> ?qpv . ?qpv <pred:value> \"1\" .  }"
  },
  {
    "qid": "train_3851",
    "input_seq": "How many Virginia counties comprise Portland's metro area?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Virginia\" . ?e_1 <has_part> ?e . ?e_1 <pred:name> \"Portland metropolitan area\" .   }"
  },
  {
    "qid": "train_3852",
    "input_seq": "How is Club Atlético San Lorenzo de Almagro related to blue which is the official color of 1. FC Magdeburg?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Club Atlético San Lorenzo de Almagro\" . ?e_2 <pred:name> \"blue\" . ?e_3 <official_color> ?e_2 . ?e_3 <pred:name> \"1. FC Magdeburg\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3853",
    "input_seq": "What is the relation between Port Arthur and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Port Arthur\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3854",
    "input_seq": "Which movie is longer, The Alamo (the one whose distributor is Walt Disney Studios Motion Pictures) or Bernie?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Alamo\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"Walt Disney Studios Motion Pictures\" .   } UNION { ?e <pred:name> \"Bernie\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3855",
    "input_seq": "What is the ISNI for John Osborne (the one whose date of birth is 1940-12-01)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John Osborne\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1940-12-01\"^^xsd:date . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_3856",
    "input_seq": "What visual artwork is the one that was nominated for Academy Award for Best Actor and whose title is Born on the Fourth of July and it is titled Born on the Fourth of July ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Actor\" .  ?e <title> ?pv . ?pv <pred:value> \"Born on the Fourth of July\" .  }"
  },
  {
    "qid": "train_3857",
    "input_seq": "Which person won the Filmfare Award for Best Actor in 1995 and is taller than 1.5 metres?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Filmfare Award for Best Actor\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1995 . ?e <height> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v > \"1.5\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3858",
    "input_seq": "Was the rock band of the website www.heart-music.com founded earlier than 1900 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.heart-music.com/\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1900 ) .  }"
  },
  {
    "qid": "train_3859",
    "input_seq": "George HW Bush was president of the United States, tell me what continues it by replacing it in its role",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"George H. W. Bush\" . ?e_2 <pred:name> \"President of the United States\" . ?e_1 <position_held> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <position_held> ; <pred:fact_t> ?e_2 ] <replaced_by> ?qpv .  }"
  },
  {
    "qid": "train_3860",
    "input_seq": "When was the person with ISNI 0000 0000 8414 4060 born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8414 4060\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3861",
    "input_seq": "Which French department with a population size below 510000000 occupies the biggest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"departments of France\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"510000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3862",
    "input_seq": "Does Tin Man (that started on 2007-12-02) or The Cosby Show have more seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tin Man\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2007-12-02\"^^xsd:date . } UNION { ?e <pred:name> \"The Cosby Show\" . } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3863",
    "input_seq": "Dave Grusin has what connection to the 61st Academy Awards?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dave Grusin\" . ?e_2 <pred:name> \"61st Academy Awards\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3864",
    "input_seq": "In which catalog does the ceremonial county of England that has the capital Durham (whose OS grid reference is NZ274424) have a code of 66?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ceremonial county of England\" . ?e <capital> ?e_1 . ?e_1 <pred:name> \"Durham\" . ?e_1 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"NZ274424\" . ?e <catalog_code> ?pv . ?pv <pred:value> \"66\" . [ <pred:fact_h> ?e ; <pred:fact_r> <catalog_code> ; <pred:fact_t> ?pv ] <catalog> ?qpv .  }"
  },
  {
    "qid": "train_3865",
    "input_seq": "What number of republics have an inflation rate that is not 1300 percent?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <inflation_rate> ?pv . ?pv <pred:unit> \"percentage\" . ?pv <pred:value> ?v . FILTER ( ?v != \"1300\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_3866",
    "input_seq": "Does ISNI code 0000 0001 0805 030X match to the University of Chicago Law School?",
    "target_seq": "ASK { ?e <pred:name> \"University of Chicago Law School\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0805 030X\" .  }"
  },
  {
    "qid": "train_3867",
    "input_seq": "What is the number of subscribers for the subreddit Burlingtoniowa, belonging to Burlington (whose elevation is 185 meters above sea level)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Burlington\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> \"185\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Burlingtoniowa\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3868",
    "input_seq": "Which city has more people, Santa Fe (with a population of 405683) or Bendigo?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Santa Fe\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"405683\"^^xsd:double . } UNION { ?e <pred:name> \"Bendigo\" . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3869",
    "input_seq": "How long is the movie titled Dutch?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Dutch\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_3870",
    "input_seq": "Which area is smaller, County Kilkenny or County Roscommon?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"County Kilkenny\" .  } UNION { ?e <pred:name> \"County Roscommon\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  }
]