[
  {
    "qid": "train_898",
    "input_seq": "Is the official website of the Golden Raspberry Awards that were nominated to Transformers (which was nominated for a Golden Raspberry Award for Worst Supporting Actor) equal to http://www.razzies.com/?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Golden Raspberry Awards\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Transformers\" . ?e_1 <nominated_for> ?e_2 . ?e_2 <pred:name> \"Golden Raspberry Award for Worst Supporting Actor\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.razzies.com/\" .  }"
  },
  {
    "qid": "train_899",
    "input_seq": "Which one of visual artwork that match a model item film is the shortest ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e_1 <model_item> ?e . ?e_1 <pred:name> \"film\" .  ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_900",
    "input_seq": "Click was up for an Academy Award for which Best Makeup and Hairstyling nominee?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Click\" . ?e_2 <pred:name> \"Academy Award for Best Makeup and Hairstyling\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_901",
    "input_seq": "What is the exploitation visa number of a visual artwork whose official website is http://www.lefilm-paris.com ?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.lefilm-paris.com/\" . ?e <exploitation_visa_number> ?pv .  }"
  },
  {
    "qid": "train_902",
    "input_seq": "When did  The Nutty Professor (the one whose production company is Paramount Pictures) receive the National Film Registry?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Nutty Professor\" . ?e_1 <production_company> ?e_3 . ?e_3 <pred:name> \"Paramount Pictures\" . ?e_2 <pred:name> \"National Film Registry\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_903",
    "input_seq": "Which one has less ostensible GDP per capita, Majority rule Republic of the Congo or Holy person Lucia",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Democratic Republic of the Congo\" .  } UNION { ?e <pred:name> \"Saint Lucia\" .  } ?e <nominal_GDP_per_capita> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_904",
    "input_seq": "Is Red Skelton a radio personality?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Red Skelton\" . ?e_2 <pred:name> \"radio personality\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_905",
    "input_seq": "Which ISO 3166-2 code corresponds to the non-metro county whose TOID is 7000000000013688?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"non-metropolitan county\" . ?e <TOID> ?pv_1 . ?pv_1 <pred:value> \"7000000000013688\" . ?e <ISO_3166-2_code> ?pv .  }"
  },
  {
    "qid": "train_906",
    "input_seq": "What is the time period that 71298 is the population of Franklin County that shares a border with Berkshire County?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Franklin County\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:name> \"Berkshire County\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"71298\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_907",
    "input_seq": "What association does the University of Padua have to Italian?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of Padua\" . ?e_2 <pred:name> \"Italian\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_908",
    "input_seq": "How many MTV Movie Awards were nominated to Good Will Hunting and were nominated to Air Force One?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Movie Awards\" . ?e_1 <nominated_for> ?e . ?e_1 <pred:name> \"Good Will Hunting\" .  ?e_2 <nominated_for> ?e . ?e_2 <pred:name> \"Air Force One\" .  }"
  },
  {
    "qid": "train_909",
    "input_seq": "What is the relationship between the 2008 Major League Baseball seaon and the Boston Red Sox?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2008 Major League Baseball season\" . ?e_2 <pred:name> \"Boston Red Sox\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_910",
    "input_seq": "Who is famous for electric blues and known by the  official website http://www.joewalsh.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.joewalsh.com/\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"electric blues\" .  }"
  },
  {
    "qid": "train_911",
    "input_seq": "How is E.T. the Extra-Terrestrial related to the Saturn Award for Best Writing?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"E.T. the Extra-Terrestrial\" . ?e_2 <pred:name> \"Saturn Award for Best Writing\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_912",
    "input_seq": "Which town has a population of 135631?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"135631\"^^xsd:double .  }"
  },
  {
    "qid": "train_913",
    "input_seq": "How many Virginia counties have a population of 29000 and border Alexandria whose Dewey Decimal Classification is 2--755296?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Virginia\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29000\"^^xsd:double . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Alexandria\" . ?e_1 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--755296\" .  }"
  },
  {
    "qid": "train_914",
    "input_seq": "What is the connection between Tom Johnson (the one that is a member of Chesterfield F.C.) to association football?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tom Johnson\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Chesterfield F.C.\" . ?e_2 <pred:name> \"association football\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_915",
    "input_seq": "Is http://www.clubdevo.com the official website of the individual whose ISNI is 0000 0001 1450 6617?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1450 6617\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.clubdevo.com\" .  }"
  },
  {
    "qid": "train_916",
    "input_seq": "Which one is longer, Fort Worth (the one whose composer is David Buttolph) or Planet of the Apes (the one whose director is Tim Burton)",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Fort Worth\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"David Buttolph\" .   } UNION { ?e <pred:name> \"Planet of the Apes\" . ?e <director> ?e_2 . ?e_2 <pred:name> \"Tim Burton\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_917",
    "input_seq": "Was the anime that started on 2005-03-31 not published in 1946?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2005-03-31\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1946 ) .  }"
  },
  {
    "qid": "train_918",
    "input_seq": "How is Terminator 2: Judgment Day released for Nintendo Entertainment System related to Acclaim Entertainment?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Terminator 2: Judgment Day\" . ?e_1 <platform> ?e_3 . ?e_3 <pred:name> \"Nintendo Entertainment System\" . ?e_2 <pred:name> \"Acclaim Entertainment\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_919",
    "input_seq": "Which has more people, Sandusky or Fort Myers?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Sandusky\" .  } UNION { ?e <pred:name> \"Fort Myers\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_921",
    "input_seq": "Steve Golin got an Academy Award for which Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Steve Golin\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_922",
    "input_seq": "What is the start date that 146065 is the exploitation visa number of Split (whose title is Split)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Split\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Split\" . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"146065\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_923",
    "input_seq": "What visual artwork is adapted from South Park (that has Marc Shaiman as a voice actor) and has the release date that is prior to 2002 in Germany?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"South Park\" . ?e_1 <voice_actor> ?e_2 . ?e_2 <pred:name> \"Marc Shaiman\" .  ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2002 ) . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }"
  },
  {
    "qid": "train_924",
    "input_seq": "Does Star Trek: The Animated Series or Gulliver's Travels (whose release date is 1996-02-04) have fewer seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Star Trek: The Animated Series\" . } UNION { ?e <pred:name> \"Gulliver's Travels\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-02-04\"^^xsd:date . } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_925",
    "input_seq": "Is Marianne Faithfull's name in native language equal to Marianne Faithfull?",
    "target_seq": "ASK { ?e <pred:name> \"Marianne Faithfull\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Marianne Faithfull\" .  }"
  },
  {
    "qid": "train_926",
    "input_seq": "When was the population of Frankfurt 629,375?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Frankfurt\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"629375\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_927",
    "input_seq": "What does Taipei have to do with Marshall, Texas?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Taipei\" . ?e_2 <pred:name> \"Marshall, Texas\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_928",
    "input_seq": "Established prior to 1460, the university attended by Leonhard Euler is a special example of what class?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Leonhard Euler\" .  ?e <inception> ?pv . ?pv <pred:year> 1460 . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv .  }"
  },
  {
    "qid": "train_929",
    "input_seq": "Was the cost of making the feature film released in France on 1984-10-24 different from  37,000,000 USD?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1984-10-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"France\" . ?e <cost> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> ?v . FILTER ( ?v != \"37000000\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_930",
    "input_seq": "What work did Peter Stone (the one that received Academy Award for Best Writing, Original Screenplay) receive the Academy Award for Best Writing, Original Screenplay for?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Peter Stone\" . ?e_1 <award_received> ?e_3 . ?e_3 <pred:name> \"Academy Award for Best Writing, Original Screenplay\" . ?e_2 <pred:name> \"Academy Award for Best Writing, Original Screenplay\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_931",
    "input_seq": "What is the connection between Mars whose occupation is actor and the United States of America?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mars\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"actor\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_932",
    "input_seq": "Was the person assigned ISNI number 0000 0000 7840 6263 born later than 1917 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7840 6263\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1917 ) .  }"
  },
  {
    "qid": "train_933",
    "input_seq": "What number of musical instruments have the Hornbostel-Sachs classification of 111.242.111?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical instrument\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"111.242.111\" .  }"
  },
  {
    "qid": "train_934",
    "input_seq": "What is the proportion of representatives in an organization/legislature numbering 35 that is the political party whose ISNI is 0000 0001 2190 2546?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2190 2546\" . ?e <number_of_representatives_in_an_organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"35\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_representatives_in_an_organization/legislature> ; <pred:fact_t> ?pv ] <proportion> ?qpv .  }"
  },
  {
    "qid": "train_935",
    "input_seq": "What county town is located in a nonurban locality having GSS code (2011) E07000209?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county town\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"non-metropolitan district\" . ?e_1 <GSS_code_(2011)> ?pv_1 . ?pv_1 <pred:value> \"E07000209\" .   }"
  },
  {
    "qid": "train_936",
    "input_seq": "Who has fewer children, Michael Moore (the one whose children number is 1) or Steven Spielberg?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Michael Moore\" . ?e <number_of_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1\"^^xsd:double . } UNION { ?e <pred:name> \"Steven Spielberg\" . } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_937",
    "input_seq": "What is Mannheim's elevation above sea level?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mannheim\" . ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_938",
    "input_seq": "Film producer Max Fleischer was nominated for an Academy Award for Best Animated Short Film for which project?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Max Fleischer\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"film producer\" . ?e_2 <pred:name> \"Academy Award for Best Animated Short Film\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_939",
    "input_seq": "What is the name of the person which CANTIC-ID is 10060078?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10060078\" .  }"
  },
  {
    "qid": "train_940",
    "input_seq": "What number of Maine counties have Santa Monica as their capital?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maine\" . ?e_1 <capital_of> ?e . ?e_1 <pred:name> \"Santa Monica\" .   }"
  },
  {
    "qid": "train_941",
    "input_seq": "How is Bleach: Memories of Nobody linked to Shin-ichiro Miki?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bleach: Memories of Nobody\" . ?e_2 <pred:name> \"Shin-ichiro Miki\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_942",
    "input_seq": "What does Cher (whose genre is variety) have to do with CBS?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cher\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"variety\" . ?e_2 <pred:name> \"CBS\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_943",
    "input_seq": "How is Since You Went Away related to Joseph Cotten?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Since You Went Away\" . ?e_2 <pred:name> \"Joseph Cotten\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_944",
    "input_seq": "What location is relative to Andorra which shares a border with Catalonia?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Catalonia\" . ?e_2 <pred:name> \"Andorra\" . ?e_1 <shares_border_with> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <shares_border_with> ; <pred:fact_t> ?e_2 ] <direction_relative_to_location> ?qpv .  }"
  },
  {
    "qid": "train_945",
    "input_seq": "How are Belgium and An Inconvenient Truth related?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"An Inconvenient Truth\" . ?e_2 <pred:name> \"Belgium\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_946",
    "input_seq": "How many awards for theatre were established later than 1948?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatre award\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1948 ) .  }"
  },
  {
    "qid": "train_947",
    "input_seq": "What is the Statistics Canada Geographic code for the city whose official website is http://www.kelowna.ca?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.kelowna.ca\" . ?e <Statistics_Canada_Geographic_code> ?pv .  }"
  },
  {
    "qid": "train_948",
    "input_seq": "Does Wimbledon (the one whose duration is 98 minute) or Death on the Nile (the one whose publication date is 1978-01-01) have lesser duration ?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wimbledon\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"98\"^^xsd:double . } UNION { ?e <pred:name> \"Death on the Nile\" . ?e <publication_date> ?pv_2 . ?pv_2 <pred:date> \"1978-01-01\"^^xsd:date . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_949",
    "input_seq": "Which language is associated with http://oru.edu, the official website of the university whose ISNI is 0000 0001 0700 3173?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0700 3173\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://oru.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_950",
    "input_seq": "Jeremy Thomas was an Academy Award nominee for which nominated Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jeremy Thomas\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_951",
    "input_seq": "What is the connection between Mona Lisa (the one that has Michael Caine as a cast member) to Golden Globe Award for Best Screenplay?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mona Lisa\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Michael Caine\" . ?e_2 <pred:name> \"Golden Globe Award for Best Screenplay\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_952",
    "input_seq": "What is the association between Chris Martin (who is famous for piano) and Coldplay?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chris Martin\" . ?e_3 <famous_people> ?e_1 . ?e_3 <pred:name> \"piano\" . ?e_2 <pred:name> \"Coldplay\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_953",
    "input_seq": "Which administrative territorial entity of Canada with an area less than 76000000 square kilometers has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity of Canada\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"76000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_954",
    "input_seq": "Which movie is longer, The Prince of Egypt or The Incredibles (the one whose script is wrote by Brad Bird)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Prince of Egypt\" .  } UNION { ?e <pred:name> \"The Incredibles\" . ?e <screenwriter> ?e_1 . ?e_1 <pred:name> \"Brad Bird\" .   } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_955",
    "input_seq": "Is Calabria or Umbria smaller in size?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Calabria\" .  } UNION { ?e <pred:name> \"Umbria\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_956",
    "input_seq": "What is the connection between Diane Warren to songwriter?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Diane Warren\" . ?e_2 <pred:name> \"songwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_957",
    "input_seq": "Is George Harrison: Living in the Material World or Slumdog Millionaire longer?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"George Harrison: Living in the Material World\" .  } UNION { ?e <pred:name> \"Slumdog Millionaire\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_958",
    "input_seq": "The subreddit saic corresponds to which school of art?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art school\" . ?e <subreddit> ?pv . ?pv <pred:value> \"saic\" .  }"
  },
  {
    "qid": "train_959",
    "input_seq": "Which director of The Stepford Wives, distributed by Columbia Pictures, is also in the cast of The Guns of Navarone?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <director> ?e . ?e_1 <pred:name> \"The Stepford Wives\" . ?e_1 <distributor> ?e_2 . ?e_2 <pred:name> \"Columbia Pictures\" .  ?e_3 <cast_member> ?e . ?e_3 <pred:name> \"The Guns of Navarone\" .  }"
  },
  {
    "qid": "train_960",
    "input_seq": "How many news programs were created by the 1.8 meter tall Stephen Colbert?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <creator> ?e_1 . ?e_1 <pred:name> \"Stephen Colbert\" . ?e_1 <height> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> \"1.8\"^^xsd:double .   }"
  },
  {
    "qid": "train_961",
    "input_seq": "How long is Top Hat?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Top Hat\" . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_962",
    "input_seq": "Who is the person with ISNI  0000 0000 7365 4129?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7365 4129\" .  }"
  },
  {
    "qid": "train_963",
    "input_seq": "What is the area of the administrative territorial entity whose official website is http://www.woodcountywv.com (this statement is in the English language)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.woodcountywv.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <area> ?pv .  }"
  },
  {
    "qid": "train_964",
    "input_seq": "What is the association of Liam O'Brien (who is a member of Portsmouth F.C.) with Eastbourne Borough F.C.?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Liam O'Brien\" . ?e_1 <member_of_sports_team> ?e_3 . ?e_3 <pred:name> \"Portsmouth F.C.\" . ?e_2 <pred:name> \"Eastbourne Borough F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_965",
    "input_seq": "Who is shorter, Brigitte Nielsen or Chris Brown who participated in the 2000 Summer Olympics?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Brigitte Nielsen\" .  } UNION { ?e <pred:name> \"Chris Brown\" . ?e <participant_of> ?e_1 . ?e_1 <pred:name> \"2000 Summer Olympics\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_966",
    "input_seq": "What is the Stack Exchange tag of the time zone whose official website is https://greenwichmeantime.com/?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"time zone\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://greenwichmeantime.com/\" . ?e <Stack_Exchange_tag> ?pv .  }"
  },
  {
    "qid": "train_967",
    "input_seq": "How many markets towns are in a country, a sovereign state, has UK as its FIPS 10-4 (countries and regions)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"market town\" . ?e <country> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"sovereign state\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"UK\" .   }"
  },
  {
    "qid": "train_968",
    "input_seq": "When the miniseries that was based on The Temptations with genre of rhythm and blue was published?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <based_on> ?e_1 . ?e_1 <pred:name> \"The Temptations\" . ?e_1 <genre> ?e_2 . ?e_2 <pred:name> \"rhythm and blues\" .  ?e <publication_date> ?pv .  }"
  },
  {
    "qid": "train_969",
    "input_seq": "What person's Twitter username is sridevibkapoor and name in native language is శ్రీదేవి?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"sridevibkapoor\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"శ్రీదేవి\" .  }"
  },
  {
    "qid": "train_970",
    "input_seq": "Which language is associated with LL-Q150 (fra)-Fhala.K-Notre-Dame de Paris.wav, the pronunciation audio of the literary work that is in the movement Romanticism?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e <movement> ?e_1 . ?e_1 <pred:name> \"Romanticism\" .  ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"LL-Q150 (fra)-Fhala.K-Notre-Dame de Paris.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_971",
    "input_seq": "Who has fewer children, Chandra Wilson or Christina Aguilera?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Chandra Wilson\" .  } UNION { ?e <pred:name> \"Christina Aguilera\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_972",
    "input_seq": "What is the number of administrative territorial entities in Canada that are separated from the Northwest Territories or have the official title Nunavut?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity of Canada\" .  { ?e <separated_from> ?e_1 . ?e_1 <pred:name> \"Northwest Territories\" .  } UNION { ?e <official_name> ?pv . ?pv <pred:value> \"Nunavut\" .  } }"
  },
  {
    "qid": "train_973",
    "input_seq": "When did the city with ISO 3166-2 code TH-10 have a population numbering 6355144?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"TH-10\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6355144\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_974",
    "input_seq": "Of the counties in Oregon with less than 670000000 people, which has the largest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Oregon\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"670000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_975",
    "input_seq": "Is http://www.trin.cam.ac.uk/ the official website of the college of the University of Cambridge where Charles, Prince of Wales was educated?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Cambridge\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Charles, Prince of Wales\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.trin.cam.ac.uk/\" .  }"
  },
  {
    "qid": "train_976",
    "input_seq": "Which has higher elevation above sea level, Longview whose area is 55.8 square miles or San Luis Obispo?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Longview\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square mile\" . ?pv_1 <pred:value> \"55.8\"^^xsd:double . } UNION { ?e <pred:name> \"San Luis Obispo\" . } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_977",
    "input_seq": "Did the police procedural genre 'Wanted' or did Cagney & Lacey have more seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Wanted\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"police procedural\" .   } UNION { ?e <pred:name> \"Cagney & Lacey\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_978",
    "input_seq": "How many house musics have people from Everything but the Girl and are from the Netherlands?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"house music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Everything but the Girl\" .  ?e <country_of_origin> ?e_2 . ?e_2 <pred:name> \"Netherlands\" .  }"
  }
]