[
  {
    "qid": "train_3449",
    "input_seq": "What is the running time of the 2000 version of the musical film Peter Pan?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Peter Pan\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"musical film\" .  ?e <inception> ?pv . ?pv <pred:year> 2000 . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3450",
    "input_seq": "What university is headquartered in the location of a big city which is the birthplace of Chuck Norris (the one that died in West Palm Beach) ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"big city\" . ?e_2 <place_of_birth> ?e_1 . ?e_2 <pred:name> \"Chuck Norris\" . ?e_2 <place_of_death> ?e_3 . ?e_3 <pred:name> \"West Palm Beach\" .   }"
  },
  {
    "qid": "train_3451",
    "input_seq": "What human has the ISNI of 0000 0000 4474 6809?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 4474 6809\" .  }"
  },
  {
    "qid": "train_3453",
    "input_seq": "How many novels do we know that contain King Kong character (the one that is created by Merian C. Cooper)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <characters> ?e_1 . ?e_1 <pred:name> \"King Kong\" . ?e_1 <creator> ?e_2 . ?e_2 <pred:name> \"Merian C. Cooper\" .   }"
  },
  {
    "qid": "train_3454",
    "input_seq": "Is Ajax Kaapstad, an association football club, nickname equal to Αστικοί Πολεμιστές ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Ajax Kaapstad\" . ?e <nickname> ?pv . ?pv <pred:value> \"Αστικοί Πολεμιστές\" .  }"
  },
  {
    "qid": "train_3455",
    "input_seq": "Who has fewer children, Georgy Zhukov or Kenny Loggins?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Georgy Zhukov\" .  } UNION { ?e <pred:name> \"Kenny Loggins\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3456",
    "input_seq": "What is the number of  higher education institutions having a member called UCLA Bruins men's basketball and the postal code 52242-1316?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <member_of> ?e . ?e_1 <pred:name> \"UCLA Bruins men's basketball\" .  ?e <postal_code> ?pv . ?pv <pred:value> \"52242-1316\" .  }"
  },
  {
    "qid": "train_3457",
    "input_seq": "How is James Stewart who died on 1905-12-21 related to Presbyterianism?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"James Stewart\" . ?e_1 <date_of_death> ?pv . ?pv <pred:date> \"1905-12-21\"^^xsd:date . ?e_2 <pred:name> \"Presbyterianism\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3458",
    "input_seq": "How many U.S. states whose population is less than 3700000 or that is located in the Central Time Zone?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"3700000\"^^xsd:double ) .  } UNION { ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Central Time Zone\" .  } }"
  },
  {
    "qid": "train_3459",
    "input_seq": "What end time pertains to the 31st United States Congress?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"31st United States Congress\" . ?e <end_time> ?pv .  }"
  },
  {
    "qid": "train_3460",
    "input_seq": "What film series that stars Bradley Cooper (who went to school at The New School) has \"The Hangover\" in its title?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film series\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Bradley Cooper\" . ?e_1 <educated_at> ?e_2 . ?e_2 <pred:name> \"The New School\" .  ?e <title> ?pv . ?pv <pred:value> \"The Hangover\" .  }"
  },
  {
    "qid": "train_3461",
    "input_seq": "Which human settlement has postal code 6105?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human settlement\" . ?e <postal_code> ?pv . ?pv <pred:value> \"6105\" .  }"
  },
  {
    "qid": "train_3462",
    "input_seq": "Is the official website of the record label headquartered in Munich, the twinned administrative body of Cincinnati, http://www.sesamestreet.org/ ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Munich\" . ?e_1 <twinned_administrative_body> ?e_2 . ?e_2 <pred:name> \"Cincinnati\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sesamestreet.org/\" .  }"
  },
  {
    "qid": "train_3463",
    "input_seq": "How is Ki Sung-yueng related to Sunderland Association Football Club?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ki Sung-yueng\" . ?e_2 <pred:name> \"Sunderland A.F.C.\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3464",
    "input_seq": "Is 48706–48710 the postal code for the higher education institution that Deion Sanders attended?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <educated_at> ?e . ?e_1 <pred:name> \"Deion Sanders\" .  ?e <postal_code> ?pv . ?pv <pred:value> \"48706–48710\" .  }"
  },
  {
    "qid": "train_3465",
    "input_seq": "How is Mars (first performed in 2016-11-13) related to Brian Grazer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mars\" . ?e_1 <date_of_first_performance> ?pv . ?pv <pred:date> \"2016-11-13\"^^xsd:date . ?e_2 <pred:name> \"Brian Grazer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3466",
    "input_seq": "Which has more people, La Jolla or Colchester?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"La Jolla\" .  } UNION { ?e <pred:name> \"Colchester\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3467",
    "input_seq": "Of Japanese prefectures that are administrative divisions of Japan, which occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"prefecture of Japan\" . ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"Japan\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3468",
    "input_seq": "Who is taller, Jennifer Lawrence or David Brown, who was born in St. Louis?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Jennifer Lawrence\" .  } UNION { ?e <pred:name> \"David Brown\" . ?e <place_of_birth> ?e_1 . ?e_1 <pred:name> \"St. Louis\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3469",
    "input_seq": "What is the production code of Tin Man, which clocks in at 45 minutes?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tin Man\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> \"45\"^^xsd:double . ?e <production_code> ?pv .  }"
  },
  {
    "qid": "train_3470",
    "input_seq": "About the NBA draft that is chosen from Texas A&M University, does it have point in time prior to 2002?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"National Basketball Association Draft\" . ?e <draft_pick_from_school> ?e_1 . ?e_1 <pred:name> \"Texas A&M University\" .  ?e <point_in_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 2002 ) .  }"
  },
  {
    "qid": "train_3471",
    "input_seq": "Which human settlement shares a border with Montclair and is the death place of James Monroe (whose date of birth is 1799-09-10)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human settlement\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Montclair\" .  ?e_2 <place_of_death> ?e . ?e_2 <pred:name> \"James Monroe\" . ?e_2 <date_of_birth> ?pv . ?pv <pred:date> \"1799-09-10\"^^xsd:date .  }"
  },
  {
    "qid": "train_3472",
    "input_seq": "For the Libris-URI qn259mz846bq3nn who is the human?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"qn259mz846bq3nn\" .  }"
  },
  {
    "qid": "train_3473",
    "input_seq": "How many researchers were not an organist?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" . ?e <different_from> ?e_1 . ?e_1 <pred:name> \"organist\" .   }"
  },
  {
    "qid": "train_3474",
    "input_seq": "Tell me the number of symptoms that have the mesh code C23.888.592.612.441 or eMedicine 150215.",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" .  { ?e <MeSH_Code> ?pv . ?pv <pred:value> \"C23.888.592.612.441\" .  } UNION { ?e <eMedicine> ?pv . ?pv <pred:value> \"150215\" .  } }"
  },
  {
    "qid": "train_3475",
    "input_seq": "For what work did Mark Johnson (ISNI 0000 0003 5431 9415) receive the Academy Award for Best Picture?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mark Johnson\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0003 5431 9415\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_3476",
    "input_seq": "What is the tie-in between The Dictator (whose script is penned by David Mandel) and Chris Parnell?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Dictator\" . ?e_1 <screenwriter> ?e_3 . ?e_3 <pred:name> \"David Mandel\" . ?e_2 <pred:name> \"Chris Parnell\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3477",
    "input_seq": "What has The Expendables 2 to do with People's Republic of China?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Expendables 2\" . ?e_2 <pred:name> \"People's Republic of China\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3478",
    "input_seq": "Who is taller, Orlando Bloom or Michael Jordan (the one that influenced Kobe Bryant)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Orlando Bloom\" .  } UNION { ?e <pred:name> \"Michael Jordan\" . ?e_1 <influenced_by> ?e . ?e_1 <pred:name> \"Kobe Bryant\" .   } ?e <height> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3479",
    "input_seq": "Is 153990 the population (as of 2010-04-01) of the Pennsylvania county where State College is located?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Pennsylvania\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"State College\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"153990\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-04-01\"^^xsd:date .  }"
  },
  {
    "qid": "train_3480",
    "input_seq": "What band is famous for new wave and has official website http://petshopboys.co.uk?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"new wave\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://petshopboys.co.uk\" .  }"
  },
  {
    "qid": "train_3481",
    "input_seq": "What is the character role of Liam Neeson in The Chronicles of Narnia: The Voyage of the Dawn Treader (the one whose genre is action film) ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"The Chronicles of Narnia: The Voyage of the Dawn Treader\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"action film\" . ?e_2 <pred:name> \"Liam Neeson\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3482",
    "input_seq": "Is the publication date 1993-12-08 for the entertainment whose publisher is Bandai Co., Ltd.?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publisher> ?e_1 . ?e_1 <pred:name> \"Bandai Co., Ltd.\" .  ?e <publication_date> ?pv . ?pv <pred:date> \"1993-12-08\"^^xsd:date .  }"
  },
  {
    "qid": "train_3483",
    "input_seq": "The Primetime Emmy awarded to Mary-Louise Parker is represented online at the site www.emmys.com in which language?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"Mary-Louise Parker\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emmys.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3484",
    "input_seq": "Does The Scarlet Letter (whose production company is Metro-Goldwyn-Mayer) or The Diary of Anne Frank (that was nominated for an Academy Award for Best Supporting Actor) have the longer runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Scarlet Letter\" . ?e <production_company> ?e_1 . ?e_1 <pred:name> \"Metro-Goldwyn-Mayer\" .   } UNION { ?e <pred:name> \"The Diary of Anne Frank\" . ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Supporting Actor\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3485",
    "input_seq": "What language is associated with the official website https://gnu.org/licenses/lgpl.html for the free software license whose short name is GNU LGPL?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"free software license\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"GNU LGPL\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://gnu.org/licenses/lgpl.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_3486",
    "input_seq": "What country is DC Comic's headquarter location in New York City?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"DC Comics\" . ?e_2 <pred:name> \"New York City\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_3487",
    "input_seq": "How many businesses does the person nicknamed \"The Donald\" have?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"businessperson\" . ?e_1 <occupation> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <nickname> ?pv_1 . ?pv_1 <pred:value> \"The Donald\" .   }"
  },
  {
    "qid": "train_3488",
    "input_seq": "When did David Lynch receive a Cannes Best Director Award?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"David Lynch\" . ?e_2 <pred:name> \"Cannes Best Director Award\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3489",
    "input_seq": "Which has the smallest vertical depth among the seas whose vertical depth is greater than 170 metres?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <vertical_depth> ?pv_1 . ?pv_1 <pred:unit> \"metre\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"170\"^^xsd:double ) . ?e <vertical_depth> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3490",
    "input_seq": "What is the 3D film composed by Jon Brion?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"3D film\" . ?e <composer> ?e_1 . ?e_1 <pred:name> \"Jon Brion\" .   }"
  },
  {
    "qid": "train_3491",
    "input_seq": "Estelle Harris voices what character on Toy Story 2?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Toy Story 2\" . ?e_2 <pred:name> \"Estelle Harris\" . ?e_1 <voice_actor> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <voice_actor> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_3492",
    "input_seq": "How Anna Karenina, whose publication date is 1915-01-01 is related to drama film?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Anna Karenina\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1915-01-01\"^^xsd:date . ?e_2 <pred:name> \"drama film\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3493",
    "input_seq": "Who has more kids: Olivia Wilde or William Henry Harrison?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Olivia Wilde\" .  } UNION { ?e <pred:name> \"William Henry Harrison\" .  } ?e <number_of_children> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3494",
    "input_seq": "Did the English-language Collateral or did Fear the Walking Dead run for fewer seasons?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Collateral\" . ?e <language_of_work_or_name> ?e_1 . ?e_1 <pred:name> \"English\" .   } UNION { ?e <pred:name> \"Fear the Walking Dead\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3495",
    "input_seq": "How many woodwind instruments are known because of famous Tom Scott (the one that has the record label Verve Records) and Paquito D'Rivera?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"woodwind instrument\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Tom Scott\" . ?e_1 <record_label> ?e_2 . ?e_2 <pred:name> \"Verve Records\" .  ?e <famous_people> ?e_3 . ?e_3 <pred:name> \"Paquito D'Rivera\" .  }"
  },
  {
    "qid": "train_3496",
    "input_seq": "How is Molde FK related to white ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Molde FK\" . ?e_2 <pred:name> \"white\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3497",
    "input_seq": "Which University of Oxford college belonging to the United Kingdom is designated by ISNI 0000 0001 2353 9744?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Oxford\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United Kingdom\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2353 9744\" .  }"
  },
  {
    "qid": "train_3498",
    "input_seq": "Of the theatrical genres nominated for a Primetime Emmy for Outstanding Comedy Series, which has the fewest episodes?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Primetime Emmy Award for Outstanding Comedy Series\" .  ?e <number_of_episodes> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3499",
    "input_seq": "Which municipality of the Netherlands has local dialing code 071 and demonym Leidenaar?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"municipality of the Netherlands\" . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"071\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Leidenaar\" .  }"
  },
  {
    "qid": "train_3500",
    "input_seq": "Thin Lizzy and hard rock are related in what way?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thin Lizzy\" . ?e_2 <pred:name> \"hard rock\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3501",
    "input_seq": "What is the connection between Edmonton (the one whose official name is Fort Edmonton) to Canada?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Edmonton\" . ?e_1 <official_name> ?pv . ?pv <pred:value> \"Fort Edmonton\" . ?e_2 <pred:name> \"Canada\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3502",
    "input_seq": "When is the date of birth of the fictional person that has the job of entrepreneur?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fictional human\" . ?e <occupation> ?e_1 . ?e_1 <pred:name> \"entrepreneur\" .  ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3503",
    "input_seq": "What is the number of airlines whose beginning date is after the year 1926 or hub airfield is Heathrow Airport?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1926 ) .  } UNION { ?e <airline_hub> ?e_1 . ?e_1 <pred:name> \"Heathrow Airport\" .  } }"
  },
  {
    "qid": "train_3504",
    "input_seq": "What is the run-time of the visual artwork assigned exploitation visa number 131796 in 2012?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"131796\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:year> 2012 . ?e <duration> ?pv .  }"
  },
  {
    "qid": "train_3505",
    "input_seq": "Did variety tv shows not end in 1648?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"variety\" .  ?e <end_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1648 ) .  }"
  },
  {
    "qid": "train_3506",
    "input_seq": "Which university has fewer employees, Peking University or University of Texas at Arlington?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Peking University\" .  } UNION { ?e <pred:name> \"University of Texas at Arlington\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3507",
    "input_seq": "Does The Santa Clause 2 or The Santa Clause 3: The Escape Clause have the longer runtime?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Santa Clause 2\" .  } UNION { ?e <pred:name> \"The Santa Clause 3: The Escape Clause\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3509",
    "input_seq": "How is Billy Crystal classified by Munzinger IBA?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Billy Crystal\" . ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_3510",
    "input_seq": "How many dynasties were established before 1371 or are located in Djibouti with 675,891 inhabitants ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" .  { ?e <location> ?e_1 . ?e_1 <pred:name> \"Djibouti\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"675891\"^^xsd:double .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1371 ) .  } }"
  },
  {
    "qid": "train_3511",
    "input_seq": "How is Bosnia and Herzegovina related to Sarajevo that is the twinned administrative body of Magdeburg?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bosnia and Herzegovina\" . ?e_2 <pred:name> \"Sarajevo\" . ?e_3 <twinned_administrative_body> ?e_2 . ?e_3 <pred:name> \"Magdeburg\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3512",
    "input_seq": "What is the title of Oscar Wilde (the one whose original language is English)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Oscar Wilde\" . ?e <original_language_of_film_or_TV_show> ?e_1 . ?e_1 <pred:name> \"English\" .  ?e <title> ?pv .  }"
  },
  {
    "qid": "train_3513",
    "input_seq": "What are the number of National Football League Drafts that follow 2007 NFL Draft ?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"National Football League Draft\" . ?e <follows> ?e_1 . ?e_1 <pred:name> \"2007 NFL Draft\" .   }"
  },
  {
    "qid": "train_3514",
    "input_seq": "Is DieRotenBullen the Twitter username of Anorthosis Famagusta FC?",
    "target_seq": "ASK { ?e <pred:name> \"Anorthosis Famagusta FC\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"DieRotenBullen\" .  }"
  },
  {
    "qid": "train_3515",
    "input_seq": "What is the relationship between Jonah Hex (the one that is from DC Universe) and the Confederate States Army?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jonah Hex\" . ?e_1 <from_fictional_universe> ?e_3 . ?e_3 <pred:name> \"DC Universe\" . ?e_2 <pred:name> \"Confederate States Army\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3516",
    "input_seq": "Which movie is shorter, Superman II: The Richard Donner Cut or Crimes and Misdemeanors?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Superman II: The Richard Donner Cut\" .  } UNION { ?e <pred:name> \"Crimes and Misdemeanors\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3517",
    "input_seq": "When was Danilo Donati born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Danilo Donati\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_3518",
    "input_seq": "How does Walter F. Parkes relate to a screenwriter   ?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Walter F. Parkes\" . ?e_2 <pred:name> \"screenwriter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3519",
    "input_seq": "Which chemical element whose oxidation state is not 5 has the largest atomic number?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical element\" . ?e <oxidation_state> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"5\"^^xsd:double ) . ?e <atomic_number> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3520",
    "input_seq": "Which movie is shorter, The Rose or The Great Gatsby (produced by Jesse Louis Lasky)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Great Gatsby\" . ?e <producer> ?e_1 . ?e_1 <pred:name> \"Jesse Louis Lasky\" .   } UNION { ?e <pred:name> \"The Rose\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_3521",
    "input_seq": "What is the connection between Little Nicky (the one whose duration is 87 minute) to Ozzy Osbourne?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Little Nicky\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"87\"^^xsd:double . ?e_2 <pred:name> \"Ozzy Osbourne\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_3522",
    "input_seq": "Which has higher unemployment, Eritrea or Sri Lanka?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Eritrea\" .  } UNION { ?e <pred:name> \"Sri Lanka\" .  } ?e <unemployment_rate> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3523",
    "input_seq": "When did Hesse become a part of Germany?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hesse\" . ?e_2 <pred:name> \"Germany\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_3524",
    "input_seq": "How many subscribers does the human whose ISNI is 0000 0001 1500 3341 have under the Twitter username MaryLynnRajskub?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1500 3341\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"MaryLynnRajskub\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3525",
    "input_seq": "When did Lexington (the one whose local dialing code is 859) have  a population of 295803?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lexington\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"859\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"295803\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_3526",
    "input_seq": "What university is located in Norwich (the one that is the death place of Malcolm Arnold)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <located_in_the_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Norwich\" . ?e_2 <place_of_death> ?e_1 . ?e_2 <pred:name> \"Malcolm Arnold\" .   }"
  },
  {
    "qid": "train_3527",
    "input_seq": "Was the film production company, established in 1917, dissolved before 1995?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1917 . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1995 ) .  }"
  },
  {
    "qid": "train_3528",
    "input_seq": "What association football club has a Pinterest username of egyzsc?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Pinterest_username> ?pv . ?pv <pred:value> \"egyzsc\" .  }"
  },
  {
    "qid": "train_3529",
    "input_seq": "How many jazz' famous people include the human whose official website is http://www.michaelbrecker.com?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"jazz\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.michaelbrecker.com\" .   }"
  },
  {
    "qid": "train_3530",
    "input_seq": "How many subscribers does Cambridge United F.C. have on its Twitter username CambridgeUtdFC?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cambridge United F.C.\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"CambridgeUtdFC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_3531",
    "input_seq": "When did Kevin Betsy stop being a member of Yeovil Town F.C.?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kevin Betsy\" . ?e_2 <pred:name> \"Yeovil Town F.C.\" . ?e_1 <member_of_sports_team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }"
  },
  {
    "qid": "train_3532",
    "input_seq": "Which has more people, Mogadishu or Saint John (the one whose inception time is 1604)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Mogadishu\" . } UNION { ?e <pred:name> \"Saint John\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1604 . } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_3533",
    "input_seq": "What person uses the twitter username mcgregor_ewan? This statement subscription number is 1402789.",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"mcgregor_ewan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1402789\"^^xsd:double .  }"
  }
]