[
  {
    "qid": "train_248",
    "input_seq": "Which Maryland county whose proportion of water area is under 20 percent has the highest percent of water area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Maryland\" . ?e <water_as_percent_of_area> ?pv_1 . ?pv_1 <pred:unit> \"percentage\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"20\"^^xsd:double ) . ?e <water_as_percent_of_area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_249",
    "input_seq": "Is the running time shorter for Let Me In or Quo Vadis (officially titled Quo vadis?)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Let Me In\" . } UNION { ?e <pred:name> \"Quo Vadis\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Quo vadis?\" . } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_250",
    "input_seq": "What is Diane Keaton's birth name?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Diane Keaton\" . ?e <birth_name> ?pv .  }"
  },
  {
    "qid": "train_251",
    "input_seq": "What is the connection between St Helens (the one that is the twinned administrative body of Stuttgart) to Warrington?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"St Helens\" . ?e_3 <twinned_administrative_body> ?e_1 . ?e_3 <pred:name> \"Stuttgart\" . ?e_2 <pred:name> \"Warrington\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_252",
    "input_seq": "Which record label is affiliated with the website www.beggars.com/banquet?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.beggars.com/banquet/\" .  }"
  },
  {
    "qid": "train_253",
    "input_seq": "Which written work corresponds with both ISBN-13 # 978-0-395-38949-2 and OCLC control number 12162097?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <ISBN-13> ?pv . ?pv <pred:value> \"978-0-395-38949-2\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"12162097\" .  }"
  },
  {
    "qid": "train_254",
    "input_seq": "Does the activity that is Michel Foucault's interest have a Dewey Decimal Classification equal to 170?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e_1 <interests> ?e . ?e_1 <pred:name> \"Michel Foucault\" .  ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"170\" .  }"
  },
  {
    "qid": "train_255",
    "input_seq": "How many medals did James Stewart (the one that received 13th Academy Awards) from the United States of America win?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e_1 <award_received> ?e . ?e_1 <pred:name> \"James Stewart\" . ?e_1 <award_received> ?e_2 . ?e_2 <pred:name> \"13th Academy Awards\" .  ?e <country> ?e_3 . ?e_3 <pred:name> \"United States of America\" .  }"
  },
  {
    "qid": "train_256",
    "input_seq": "What is the beginning date of the MTV Video Music Award that is won by Chris Brown (who has the Jive Records label)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"MTV Video Music Award\" . ?e <winner> ?e_1 . ?e_1 <pred:name> \"Chris Brown\" . ?e_1 <record_label> ?e_2 . ?e_2 <pred:name> \"Jive Records\" .  ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_257",
    "input_seq": "How is Technical University of Berlin related to the MBA degree?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Technical University of Berlin\" . ?e_2 <pred:name> \"Master of Business Administration\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_258",
    "input_seq": "Which rock and roll personality is designated by ISNI 0000 0000 8161 0628?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <famous_people> ?e . ?e_1 <pred:name> \"rock and roll\" .  ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8161 0628\" .  }"
  },
  {
    "qid": "train_259",
    "input_seq": "Was the individual whose ISNI is 0000 0000 2566 5552 born at a time other than 1968 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 2566 5552\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1968 ) .  }"
  },
  {
    "qid": "train_260",
    "input_seq": "How is Cole Porter related to film score?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"film score\" . ?e_2 <pred:name> \"Cole Porter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_261",
    "input_seq": "Did the person with Munzinger IBA 00000024082 start working before 1963?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <Munzinger_IBA> ?pv_1 . ?pv_1 <pred:value> \"00000024082\" . ?e <work_period_(start)> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1963 ) .  }"
  },
  {
    "qid": "train_262",
    "input_seq": "Which Munzinger IBA identifies the person who produced Last Action Hero?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e_1 <producer> ?e . ?e_1 <pred:name> \"Last Action Hero\" .  ?e <Munzinger_IBA> ?pv .  }"
  },
  {
    "qid": "train_263",
    "input_seq": "What number of city boroughs are twinned administrative entities of Durban or West Yorkshire admin divisions?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" .  { ?e_1 <contains_administrative_territorial_entity> ?e . ?e_1 <pred:name> \"West Yorkshire\" .  } UNION { ?e_1 <twinned_administrative_body> ?e . ?e_1 <pred:name> \"Durban\" .  } }"
  },
  {
    "qid": "train_264",
    "input_seq": "Which is at a lower elevation above sea level, Odense or Harare?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Odense\" .  } UNION { ?e <pred:name> \"Harare\" .  } ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_265",
    "input_seq": "What is the connection between Weeds (the one whose duration is 115 minute) to Angelo Badalamenti?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Weeds\" . ?e_1 <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> \"115\"^^xsd:double . ?e_2 <pred:name> \"Angelo Badalamenti\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_266",
    "input_seq": "Was the popular music famously represented by Tupac Shakur invented prior to 1958 ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"popular music\" . ?e <famous_people> ?e_1 . ?e_1 <pred:name> \"Tupac Shakur\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1958 ) .  }"
  },
  {
    "qid": "train_267",
    "input_seq": "How was it determined that Maryland (the one that is the residence of Neal Stephenson) has a popualtion of 4781468?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Maryland\" . ?e_1 <residence> ?e . ?e_1 <pred:name> \"Neal Stephenson\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4781468\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_268",
    "input_seq": "What method was used to determine that the national association football team with the FIFA country code RSA, has a ranking of 96?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <FIFA_country_code> ?pv_1 . ?pv_1 <pred:value> \"RSA\" . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <determination_method> ?qpv .  }"
  },
  {
    "qid": "train_269",
    "input_seq": "What is the gender of the citizens called the Maghiar people belonging to the ethnic group that has an ethnic affiliate named Michael Curtiz?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"ethnic group\" . ?e_1 <ethnic_group> ?e . ?e_1 <pred:name> \"Michael Curtiz\" .  ?e <demonym> ?pv . ?pv <pred:value> \"maghiar\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <sex_or_gender> ?qpv .  }"
  },
  {
    "qid": "train_270",
    "input_seq": "Was Harvard Law School founded more recently than 1811 ?",
    "target_seq": "ASK { ?e <pred:name> \"Harvard Law School\" . ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1811 ) .  }"
  },
  {
    "qid": "train_271",
    "input_seq": "When did Enrico Fermi receive the Nobel Prize in Physics?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Enrico Fermi\" . ?e_2 <pred:name> \"Nobel Prize in Physics\" . ?e_1 <award_received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_272",
    "input_seq": "How is the Technical University of Munich related to Germany?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Technical University of Munich\" . ?e_2 <pred:name> \"Germany\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_273",
    "input_seq": "What relation does Ed Lauter have to Family Plot?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Family Plot\" . ?e_2 <pred:name> \"Ed Lauter\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_274",
    "input_seq": "Which area is larger, Apulia or Sardinia (the one whose NUTS code is ITB)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Apulia\" . } UNION { ?e <pred:name> \"Sardinia\" . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"ITB\" . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_275",
    "input_seq": "Is the smaller area occupied by Clinton County (FIPS 6-4 (US counties) code 39027) or Union County, population 52300?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Clinton County\" . ?e <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"39027\" . } UNION { ?e <pred:name> \"Union County\" . ?e <population> ?pv_2 . ?pv_2 <pred:unit> \"1\" . ?pv_2 <pred:value> \"52300\"^^xsd:double . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_276",
    "input_seq": "How many films have a start date that is after 2012 and are a common property of Microsoft whose official website is https://www.microsoft.com/cs-cz?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <start_time> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 2012 ) . ?e_1 <properties_for_this_type> ?e . ?e_1 <pred:name> \"Microsoft\" . ?e_1 <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.microsoft.com/cs-cz\" .  }"
  },
  {
    "qid": "train_277",
    "input_seq": "What is the London area that is where Judy Garland dies or that have the TOID of 4000000074558887",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"area of London\" .  { ?e_1 <place_of_death> ?e . ?e_1 <pred:name> \"Judy Garland\" .  } UNION { ?e <TOID> ?pv . ?pv <pred:value> \"4000000074558887\" .  } }"
  },
  {
    "qid": "train_278",
    "input_seq": "What is Malta's diplomatic relationship with Israel, where the nominal GDP is 31079439501.7794 USD?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Malta\" . ?e_2 <pred:name> \"Israel\" . ?e_2 <nominal_GDP> ?pv . ?pv <pred:unit> \"United States dollar\" . ?pv <pred:value> \"31079439501.7794\"^^xsd:double . ?e_1 <diplomatic_relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic_relation> ; <pred:fact_t> ?e_2 ] <statement_is_subject_of> ?qpv .  }"
  },
  {
    "qid": "train_279",
    "input_seq": "How many regions of Italy share a border with the region of Italy whose capital is Florence (that is the capital of Italy)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"region of Italy\" . ?e_1 <shares_border_with> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"region of Italy\" . ?e_2 <capital_of> ?e_1 . ?e_2 <pred:name> \"Florence\" . ?e_3 <capital> ?e_2 . ?e_3 <pred:name> \"Italy\" .   }"
  },
  {
    "qid": "train_280",
    "input_seq": "What is the connection between New Zealand national cricket team to human?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Zealand national cricket team\" . ?e_2 <pred:name> \"human\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_281",
    "input_seq": "What is the connection between Airport (the one whose genre is disaster film) to Helen Hayes (the one whose date of birth is 1900-10-10)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Airport\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"disaster film\" . ?e_2 <pred:name> \"Helen Hayes\" . ?e_2 <date_of_birth> ?pv . ?pv <pred:date> \"1900-10-10\"^^xsd:date . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_282",
    "input_seq": "How is Hameur Bouazza related to AC Arles?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hameur Bouazza\" . ?e_2 <pred:name> \"AC Arles\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_283",
    "input_seq": "What language is associated with the official website http://www.perthstjohnstonefc.co.uk/ for the association football club whose headquarters is located in Perth (that is the capital of Perth and Kinross)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <headquarters_location> ?e_1 . ?e_1 <pred:name> \"Perth\" . ?e_1 <capital_of> ?e_2 . ?e_2 <pred:name> \"Perth and Kinross\" .  ?e <official_website> ?pv . ?pv <pred:value> \"http://www.perthstjohnstonefc.co.uk/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_284",
    "input_seq": "What is the connection between Jim Brown (the one that is related to sport baseball) to Clinton County (the one that is located in Pennsylvania)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jim Brown\" . ?e_1 <sport> ?e_3 . ?e_3 <pred:name> \"baseball\" . ?e_2 <pred:name> \"Clinton County\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_4 . ?e_4 <pred:name> \"Pennsylvania\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_285",
    "input_seq": "What is the connection between Jack White (the one that has the occupation of guitarist) to Wayne State University?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jack White\" . ?e_1 <occupation> ?e_3 . ?e_3 <pred:name> \"guitarist\" . ?e_2 <pred:name> \"Wayne State University\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_286",
    "input_seq": "Is The Mummy's (which has a review score of 34/100) duration greater than 80 minutes?",
    "target_seq": "ASK { ?e <pred:name> \"The Mummy\" . ?e <review_score> ?pv_1 . ?pv_1 <pred:value> \"34/100\" . ?e <duration> ?pv . ?pv <pred:unit> \"minute\" . ?pv <pred:value> ?v . FILTER ( ?v > \"80\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_287",
    "input_seq": "What is the elevation above sea level of the U.S. city with postal code 79701-12?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"79701-12\" . ?e <elevation_above_sea_level> ?pv .  }"
  },
  {
    "qid": "train_288",
    "input_seq": "Is the elevation of Lake County (whose area is 1622 square kilometers) less than 7400 meters above sea level?",
    "target_seq": "ASK { ?e <pred:name> \"Lake County\" . ?e <area> ?pv_1 . ?pv_1 <pred:unit> \"square kilometre\" . ?pv_1 <pred:value> \"1622\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:unit> \"metre\" . ?pv <pred:value> ?v . FILTER ( ?v < \"7400\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_289",
    "input_seq": "When was Daniel Radcliffe the MTV Movie Award winner for Best On-Screen Duo?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"MTV Movie Award for Best On-Screen Duo\" . ?e_2 <pred:name> \"Daniel Radcliffe\" . ?e_1 <winner> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <winner> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_290",
    "input_seq": "Is 14 the sport uniform number of the person who is a member of the Morocco national football team?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <member_of_sports_team> ?e_1 . ?e_1 <pred:name> \"Morocco national football team\" .  ?e <sport_number> ?pv . ?pv <pred:value> \"14\" .  }"
  },
  {
    "qid": "train_291",
    "input_seq": "When was the person with ISNI 0000 0001 1450 534X born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1450 534X\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_292",
    "input_seq": "What person has the official site of http://www.itzhakperlman.com?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.itzhakperlman.com/\" .  }"
  },
  {
    "qid": "train_293",
    "input_seq": "Who died in Rochdale, designated by WOEID 33424?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <place_of_death> ?e_1 . ?e_1 <pred:name> \"Rochdale\" . ?e_1 <WOEID> ?pv . ?pv <pred:value> \"33424\" .   }"
  },
  {
    "qid": "train_294",
    "input_seq": "Which is shorter: 50 First Dates or A Room with a View?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"50 First Dates\" .  } UNION { ?e <pred:name> \"A Room with a View\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_295",
    "input_seq": "Which movie made less at the box office, Crazy Heart or Fargo (the one whose cost is 7000000 United States dollar)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Crazy Heart\" . } UNION { ?e <pred:name> \"Fargo\" . ?e <cost> ?pv_1 . ?pv_1 <pred:unit> \"United States dollar\" . ?pv_1 <pred:value> \"7000000\"^^xsd:double . } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_296",
    "input_seq": "Of the cities that have a population greater than 24000000, which is the smallest in area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"24000000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_297",
    "input_seq": "What is the official website of the higher education institution whose ARCHON code is 941?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"941\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_298",
    "input_seq": "What is the character role of Jackie Cooper in Superman (the one that is followed by Superman II)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Superman\" . ?e_1 <followed_by> ?e_3 . ?e_3 <pred:name> \"Superman II\" . ?e_2 <pred:name> \"Jackie Cooper\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_299",
    "input_seq": "Was SImon Callow born after 1959?",
    "target_seq": "ASK { ?e <pred:name> \"Simon Callow\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1959 ) .  }"
  },
  {
    "qid": "train_300",
    "input_seq": "How is Hidalgo County related to Texas, story setting of Crazy Heart?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hidalgo County\" . ?e_2 <pred:name> \"Texas\" . ?e_3 <narrative_location> ?e_2 . ?e_3 <pred:name> \"Crazy Heart\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_301",
    "input_seq": "When was the person whose official website is http://www.thora.org born?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.thora.org\" . ?e <date_of_birth> ?pv .  }"
  },
  {
    "qid": "train_302",
    "input_seq": "To which part does a demonym 'Koreanerin' apply to a geographic region replaced by South Korea ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <replaced_by> ?e_1 . ?e_1 <pred:name> \"South Korea\" .  ?e <demonym> ?pv . ?pv <pred:value> \"Koreanerin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }"
  },
  {
    "qid": "train_303",
    "input_seq": "Which movie features the character of Alien (the one that presents in work Alien: Resurrection)?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <characters> ?e_1 . ?e_1 <pred:name> \"Alien\" . ?e_1 <present_in_work> ?e_2 . ?e_2 <pred:name> \"Alien: Resurrection\" .   }"
  },
  {
    "qid": "train_304",
    "input_seq": "Was Irving Thalberg born in a year different from 1945 ?",
    "target_seq": "ASK { ?e <pred:name> \"Irving Thalberg\" . ?e <date_of_birth> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1945 ) .  }"
  },
  {
    "qid": "train_305",
    "input_seq": "How many newscasts feature the character of Stephen Colbert from The Colbert Report?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <characters> ?e_1 . ?e_1 <pred:name> \"Stephen Colbert\" . ?e_1 <present_in_work> ?e_2 . ?e_2 <pred:name> \"The Colbert Report\" .   }"
  },
  {
    "qid": "train_306",
    "input_seq": "Which has a lesser number of seasons, Nashville (which has Powers Boothe as a cast member) or The Mickey Mouse Club?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nashville\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"Powers Boothe\" .   } UNION { ?e <pred:name> \"The Mickey Mouse Club\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_307",
    "input_seq": "Of US cities with telephone area code 401, which is lowest relative to sea level?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"401\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_308",
    "input_seq": "I want to know which one has the least duration among the animated film that has a duration of less than 780 minutes.",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:unit> \"minute\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"780\"^^xsd:double ) . ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_309",
    "input_seq": "How many professions have a KldB-2010 occupation code of 43124?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <KldB-2010_occupation_code> ?pv . ?pv <pred:value> \"43124\" .  }"
  },
  {
    "qid": "train_310",
    "input_seq": "What is the relationship between Jay and Silent Bob Strike Back and Shannen Doherty?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jay and Silent Bob Strike Back\" . ?e_2 <pred:name> \"Shannen Doherty\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_311",
    "input_seq": "How many Netherlands provinces border Utrecht whose licence plate code is L?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"province of the Netherlands\" . ?e <shares_border_with> ?e_1 . ?e_1 <pred:name> \"Utrecht\" . ?e_1 <licence_plate_code> ?pv . ?pv <pred:value> \"L\" .   }"
  },
  {
    "qid": "train_312",
    "input_seq": "Which university has more employees, Tsinghua University or Northwestern University?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tsinghua University\" .  } UNION { ?e <pred:name> \"Northwestern University\" .  } ?e <employees> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_313",
    "input_seq": "How many programming languages influenced Julia (the one with the operating system Microsoft Windows)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"programming language\" . ?e_1 <influenced_by> ?e . ?e_1 <pred:name> \"Julia\" . ?e_1 <operating_system> ?e_2 . ?e_2 <pred:name> \"Microsoft Windows\" .   }"
  },
  {
    "qid": "train_314",
    "input_seq": "Among the counties of New York with population less than 760000,which one has the largest area ?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New York\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"760000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_315",
    "input_seq": "What is the Dewey Decimal Classification of The Da Vinci Code (the one whose ISBN-13 is 978-0-552-15971-5)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"The Da Vinci Code\" . ?e <ISBN-13> ?pv_1 . ?pv_1 <pred:value> \"978-0-552-15971-5\" . ?e <Dewey_Decimal_Classification> ?pv .  }"
  },
  {
    "qid": "train_316",
    "input_seq": "What is the ISBN-10 of Thunderball (the one whose OCLC control number is 778193414)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Thunderball\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"778193414\" . ?e <ISBN-10> ?pv .  }"
  },
  {
    "qid": "train_317",
    "input_seq": "What is the connection between Santa Fe (the one that origins from Austria) to black-and-white?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Santa Fe\" . ?e_1 <country_of_origin> ?e_3 . ?e_3 <pred:name> \"Austria\" . ?e_2 <pred:name> \"black-and-white\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_318",
    "input_seq": "When did children's music originate?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"children's music\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_319",
    "input_seq": "How many states of the United States that have a less than 1.8 population or the residence of Jessica Lange?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" .  { ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"1.8\"^^xsd:double ) .  } UNION { ?e_1 <residence> ?e . ?e_1 <pred:name> \"Jessica Lange\" .  } }"
  },
  {
    "qid": "train_320",
    "input_seq": "Of Arizona counties with a population surpassing 7700, which is biggest in terms of area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of Arizona\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"7700\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_321",
    "input_seq": "How is Michael Crichton related to film producer?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Crichton\" . ?e_2 <pred:name> \"film producer\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_322",
    "input_seq": "Which movie is shorter, The Music Man (the one that was nominated for Golden Globe Award for Best Original Score) or Star Wars: The Clone Wars (the one whose production company is Warner Bros.)?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"The Music Man\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Golden Globe Award for Best Original Score\" .   } UNION { ?e <pred:name> \"Star Wars: The Clone Wars\" . ?e <production_company> ?e_2 . ?e_2 <pred:name> \"Warner Bros.\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_323",
    "input_seq": "Which area is smaller, Cook Islands or Wales?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Cook Islands\" .  } UNION { ?e <pred:name> \"Wales\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_324",
    "input_seq": "How many subscribers does the football club Leon Cort that played 12 games as a member whose twitter username is FGRFC_Official?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e_1 <member_of_sports_team> ?e . ?e_1 <pred:name> \"Leon Cort\" . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member_of_sports_team> ; <pred:fact_t> ?e ] <number_of_matches_played/races/starts> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"12\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"FGRFC_Official\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_325",
    "input_seq": "how many science fiction films are that belong to the genre Babylon 5 which also has the IAB code 652",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science fiction\" . ?e_1 <genre> ?e . ?e_1 <pred:name> \"Babylon 5\" .  ?e <IAB_code> ?pv . ?pv <pred:value> \"652\" .  }"
  },
  {
    "qid": "train_326",
    "input_seq": "For the Philadelphia Flyers, what language is associated with this creative work for its official website of https://www.nhl.com/flyers?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Philadelphia Flyers\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.nhl.com/flyers\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_327",
    "input_seq": "Which area is smaller, Tyler or Beaufort?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Tyler\" .  } UNION { ?e <pred:name> \"Beaufort\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_328",
    "input_seq": "Is 0000 0001 1479 5658  Eric Bana's ISNI?",
    "target_seq": "ASK { ?e <pred:name> \"Eric Bana\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1479 5658\" .  }"
  },
  {
    "qid": "train_329",
    "input_seq": "What is the connection between Geelong Football Club to Australia (the one that is the release region of The NeverEnding Story)?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Geelong Football Club\" . ?e_2 <pred:name> \"Australia\" . ?e_3 <film_release_region> ?e_2 . ?e_3 <pred:name> \"The NeverEnding Story\" . ?e_1 ?p ?e_2 .  }"
  }
]