[
  {
    "qid": "train_1294",
    "input_seq": "Tell me the official website for the association football club that has the Twitter username of acchievoverona.",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"acchievoverona\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1295",
    "input_seq": "How many male given names match that of Bono or have the Soundex G600?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"male given name\" .  { ?e_1 <given_name> ?e . ?e_1 <pred:name> \"Bono\" .  } UNION { ?e <Soundex> ?pv . ?pv <pred:value> \"G600\" .  } }"
  },
  {
    "qid": "train_1296",
    "input_seq": "What is the official name of Sheffield which had the ISO 3166-2 code of GB-SHF?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sheffield\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"GB-SHF\" . ?e <official_name> ?pv .  }"
  },
  {
    "qid": "train_1297",
    "input_seq": "What visual artwork has official website http://www.howshedoesitmovie.com/ and was nominated for a Golden Raspberry Award for Worst Actress?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.howshedoesitmovie.com/\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Golden Raspberry Award for Worst Actress\" .  }"
  },
  {
    "qid": "train_1298",
    "input_seq": "What's the relationship between Peter Cushing and actor?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peter Cushing\" . ?e_2 <pred:name> \"actor\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1299",
    "input_seq": "What is the language of Brittany (the one whose motto text is Potius mori quam fœdari) the English Channel was named after ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"English Channel\" . ?e_2 <pred:name> \"Brittany\" . ?e_2 <motto_text> ?pv . ?pv <pred:value> \"Potius mori quam fœdari\" . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <language_of_work_or_name> ?qpv .  }"
  },
  {
    "qid": "train_1300",
    "input_seq": "What is the connection between Ron Howard (the one whose mass is 229 pound) to Seattle Seahawks?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ron Howard\" . ?e_1 <mass> ?pv . ?pv <pred:unit> \"pound\" . ?pv <pred:value> \"229\"^^xsd:double . ?e_2 <pred:name> \"Seattle Seahawks\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1301",
    "input_seq": "Lionel Messi is the stats leader with 61 points scored for which national soccer team?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <statistical_leader> ?e_1 . ?e_1 <pred:name> \"Lionel Messi\" .  [ <pred:fact_h> ?e ; <pred:fact_r> <statistical_leader> ; <pred:fact_t> ?e_1 ] <number_of_points/goals/set_scored> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"61\"^^xsd:double .  }"
  },
  {
    "qid": "train_1302",
    "input_seq": "What is the CANTIC-ID of the person whose ISNI is 0000 0001 1450 5198?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1450 5198\" . ?e <CANTIC-ID> ?pv .  }"
  },
  {
    "qid": "train_1303",
    "input_seq": "Is 2001:620:8::/48 the IPv6 routing prefix for Groningen (whose number of households is 109976)?",
    "target_seq": "ASK { ?e <pred:name> \"Groningen\" . ?e <number_of_households> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"109976\"^^xsd:double . ?e <IPv6_routing_prefix> ?pv . ?pv <pred:value> \"2001:620:8::/48\" .  }"
  },
  {
    "qid": "train_1305",
    "input_seq": "How is St. Louis Blues starring Ruby Dee related to black-and-white?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"St. Louis Blues\" . ?e_1 <cast_member> ?e_3 . ?e_3 <pred:name> \"Ruby Dee\" . ?e_2 <pred:name> \"black-and-white\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1306",
    "input_seq": "How many land-grant universities have the street address of 3500 John A. Merritt Blvd, Nashville, TN, 37209-1561 or are named after Tennessee (the one whose FIPS 10-4 (countries and regions) is US47)?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"land-grant university\" .  { ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"3500 John A. Merritt Blvd, Nashville, TN, 37209-1561\" .  } UNION { ?e <named_after> ?e_1 . ?e_1 <pred:name> \"Tennessee\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"US47\" .  } }"
  },
  {
    "qid": "train_1307",
    "input_seq": "Of all the United States of America independent cities, which covers the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"independent city\" . ?e <country> ?e_1 . ?e_1 <pred:name> \"United States of America\" .  ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1308",
    "input_seq": "How many rock bands were founded after 1962 or whose Instagram username is linkinpark?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock band\" .  { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1962 ) .  } UNION { ?e <Instagram_username> ?pv . ?pv <pred:value> \"linkinpark\" .  } }"
  },
  {
    "qid": "train_1309",
    "input_seq": "Does Kitchener or Paramaribo have the smaller population size?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Kitchener\" .  } UNION { ?e <pred:name> \"Paramaribo\" .  } ?e <population> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1310",
    "input_seq": "Were production expenses cheaper for Thunderball, filmed in Florida, or Thank You for Smoking?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Thunderball\" . ?e <filming_location> ?e_1 . ?e_1 <pred:name> \"Florida\" .   } UNION { ?e <pred:name> \"Thank You for Smoking\" .  } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1311",
    "input_seq": "How many subscribers does the Twitter username davenavarro6767 have, belonging to a person whose ISNI is 0000 0001 1449 9699 ?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1449 9699\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"davenavarro6767\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }"
  },
  {
    "qid": "train_1312",
    "input_seq": "Is Gioachino Rossini's  Libris-URI ljx01rd432x86fs?",
    "target_seq": "ASK { ?e <pred:name> \"Gioachino Rossini\" . ?e <Libris-URI> ?pv . ?pv <pred:value> \"ljx01rd432x86fs\" .  }"
  },
  {
    "qid": "train_1313",
    "input_seq": "How much rock music is influenced by the band having the genre of stoner rock?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rock music\" . ?e <influenced_by> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"band\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"stoner rock\" .   }"
  },
  {
    "qid": "train_1314",
    "input_seq": "What does Fred Frith have to do with Christ's College?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fred Frith\" . ?e_2 <pred:name> \"Christ's College\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1315",
    "input_seq": "How is Shammi Kapoor related to the India in a diplomatic relationship with Mozambique?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shammi Kapoor\" . ?e_2 <pred:name> \"India\" . ?e_3 <diplomatic_relation> ?e_2 . ?e_3 <pred:name> \"Mozambique\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1316",
    "input_seq": "Which area is larger, Summit or Wheaton?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Summit\" .  } UNION { ?e <pred:name> \"Wheaton\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1317",
    "input_seq": "What higher education institution is the employer of the person who has  Libris-URI xv8bc3fg0wf200d?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e_1 <employer> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <Libris-URI> ?pv . ?pv <pred:value> \"xv8bc3fg0wf200d\" .   }"
  },
  {
    "qid": "train_1318",
    "input_seq": "Does the bubblegum pop personality go by the Twitter username donnyosmond ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <genre> ?e_1 . ?e_1 <pred:name> \"bubblegum pop\" .  ?e <Twitter_username> ?pv . ?pv <pred:value> \"donnyosmond\" .  }"
  },
  {
    "qid": "train_1319",
    "input_seq": "When did Birmingham (the birthplace of Steve Winwood) start being located in Birmingham (whose ISO 3166-2 code is GB-BIR)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Birmingham\" . ?e_3 <place_of_birth> ?e_1 . ?e_3 <pred:name> \"Steve Winwood\" . ?e_2 <pred:name> \"Birmingham\" . ?e_2 <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-BIR\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }"
  },
  {
    "qid": "train_1320",
    "input_seq": "Which Indian state with a population different from 22000 occupies the least area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of India\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"22000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1321",
    "input_seq": "What is the connection between pop music to The Isley Brothers?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"pop music\" . ?e_2 <pred:name> \"The Isley Brothers\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1322",
    "input_seq": "How many Primetime Emmy Awards were earned by Ted Danson or created in a year excluding 1953?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" .  { ?e <winner> ?e_1 . ?e_1 <pred:name> \"Ted Danson\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 1953 ) .  } }"
  },
  {
    "qid": "train_1323",
    "input_seq": "Which was shorter, Pittsburgh with John Wayne in the cast, or Jane Eyre, originating in France?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Pittsburgh\" . ?e <cast_member> ?e_1 . ?e_1 <pred:name> \"John Wayne\" .   } UNION { ?e <pred:name> \"Jane Eyre\" . ?e <country_of_origin> ?e_2 . ?e_2 <pred:name> \"France\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1324",
    "input_seq": "Which film is shorter in duration, Requiem for a Dream or Jay and Silent Bob Strike Back?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Requiem for a Dream\" .  } UNION { ?e <pred:name> \"Jay and Silent Bob Strike Back\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1325",
    "input_seq": "Which Roberto Benigni work earned him an Academy Award Best Actor nomination?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Roberto Benigni\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 <nominated_for> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <nominated_for> ; <pred:fact_t> ?e_2 ] <for_work> ?qpv .  }"
  },
  {
    "qid": "train_1326",
    "input_seq": "What does An Inconvenient Truth have to do with Slovenia?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"An Inconvenient Truth\" . ?e_2 <pred:name> \"Slovenia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1327",
    "input_seq": "Which earned more in ticket sales: Little Fockers or Charlie and the Chocolate Factory, an Academy Award nominee for Best Costume Design?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Little Fockers\" .  } UNION { ?e <pred:name> \"Charlie and the Chocolate Factory\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Costume Design\" .   } ?e <box_office> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1328",
    "input_seq": "What is the character role of Gary Sinise who was cast in Apollo 13?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Apollo 13\" . ?e_2 <pred:name> \"Gary Sinise\" . ?e_1 <cast_member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast_member> ; <pred:fact_t> ?e_2 ] <character_role> ?qpv .  }"
  },
  {
    "qid": "train_1329",
    "input_seq": "What is the relationship between Capote and National Society of Film Critics Award for Best Director?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Capote\" . ?e_2 <pred:name> \"National Society of Film Critics Award for Best Director\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1330",
    "input_seq": "What feature film was nominated for an Academy Award for Best Supporting Actor and an Academy Award for Best Actor?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"feature film\" . ?e <nominated_for> ?e_1 . ?e_1 <pred:name> \"Academy Award for Best Supporting Actor\" .  ?e <nominated_for> ?e_2 . ?e_2 <pred:name> \"Academy Award for Best Actor\" .  }"
  },
  {
    "qid": "train_1331",
    "input_seq": "What is the relation between Allegheny County and Pennsylvania?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Allegheny County\" . ?e_2 <pred:name> \"Pennsylvania\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1332",
    "input_seq": "When did the city where Ariel Sharon works have a population of 25030?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e_1 <work_location> ?e . ?e_1 <pred:name> \"Ariel Sharon\" .  ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25030\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1333",
    "input_seq": "Of animated series with a debut show later than 1997, which has the fewest seasons?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animated series\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:year> ?v_1 . FILTER ( ?v_1 > 1997 ) . ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1334",
    "input_seq": "In how many sovereign states are in the region where Inside Deep Throat was distributed?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e_1 <film_distribute_region> ?e . ?e_1 <pred:name> \"Inside Deep Throat\" .   }"
  },
  {
    "qid": "train_1335",
    "input_seq": "When did the county of New Jersey that contains the administrative division Elizabeth (the one whose postal code is 07201) have a population of 537736?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"county of New Jersey\" . ?e <contains_administrative_territorial_entity> ?e_1 . ?e_1 <pred:name> \"Elizabeth\" . ?e_1 <postal_code> ?pv_1 . ?pv_1 <pred:value> \"07201\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"537736\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point_in_time> ?qpv .  }"
  },
  {
    "qid": "train_1336",
    "input_seq": "What is the native language name of Donald Sutherland (the one whose date of birth is 1863-04-08)?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Donald Sutherland\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1863-04-08\"^^xsd:date . ?e <name_in_native_language> ?pv .  }"
  },
  {
    "qid": "train_1337",
    "input_seq": "Tell me the profession that is the person's occupation with official website http://www.bernadettepeters.com/",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e_1 <occupation> ?e . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.bernadettepeters.com/\" .   }"
  },
  {
    "qid": "train_1338",
    "input_seq": "Which person's official name is ا__پ_ ک__ر?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"House of Flying Daggers\" . ?e_2 <pred:name> \"wuxia\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1339",
    "input_seq": "What is the proportion of the ethnic group Austrians in Austria?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Austria\" . ?e_2 <pred:name> \"Austrians\" . ?e_1 <ethnic_group> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <ethnic_group> ; <pred:fact_t> ?e_2 ] <proportion> ?qpv .  }"
  },
  {
    "qid": "train_1340",
    "input_seq": "What is the GitHub username of the facility whose ISNI is 0000 0004 1936 8761?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1936 8761\" . ?e <GitHub_username> ?pv .  }"
  },
  {
    "qid": "train_1341",
    "input_seq": "Which area is smaller in size, Province of Salerno or Province of Rome?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Province of Salerno\" .  } UNION { ?e <pred:name> \"Province of Rome\" .  } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1342",
    "input_seq": "is the publication date not in 2009 for Christopher Columbus: The Discovery?",
    "target_seq": "ASK { ?e <pred:name> \"Christopher Columbus: The Discovery\" . ?e <publication_date> ?pv . ?pv <pred:year> ?v . FILTER ( ?v != 2009 ) .  }"
  },
  {
    "qid": "train_1343",
    "input_seq": "Which not-real person appears in Law & Order, with Benjamin Bratt as a cast member?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fictional human\" . ?e <present_in_work> ?e_1 . ?e_1 <pred:name> \"Law & Order\" . ?e_1 <cast_member> ?e_2 . ?e_2 <pred:name> \"Benjamin Bratt\" .   }"
  },
  {
    "qid": "train_1344",
    "input_seq": "What is the ISNI of the person whose name in native language is Aretha Louise Franklin?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Aretha Louise Franklin\" . ?e <ISNI> ?pv .  }"
  },
  {
    "qid": "train_1345",
    "input_seq": "How many reggaes include the human whose nickname is Mr. 305 in famous people?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <famous_people> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"human\" . ?e_1 <nickname> ?pv . ?pv <pred:value> \"Mr. 305\" .   }"
  },
  {
    "qid": "train_1346",
    "input_seq": "What person's birth name is Jennifer Lynn Connelly and CANTIC-ID is a10068594?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <birth_name> ?pv . ?pv <pred:value> \"Jennifer Lynn Connelly\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a10068594\" .  }"
  },
  {
    "qid": "train_1347",
    "input_seq": "When was the film production company whose official website is http://www.rbe.co.in/ established?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film production company\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.rbe.co.in/\" . ?e <inception> ?pv .  }"
  },
  {
    "qid": "train_1348",
    "input_seq": "Did the record label of Wayne Shorter begin before 1565?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"record label\" . ?e_1 <record_label> ?e . ?e_1 <pred:name> \"Wayne Shorter\" .  ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1565 ) .  }"
  },
  {
    "qid": "train_1349",
    "input_seq": "How many metropolitan areas are located inside the Greenwich Mean Time zone?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <located_in_time_zone> ?e_1 . ?e_1 <pred:name> \"Greenwich Mean Time\" .   }"
  },
  {
    "qid": "train_1350",
    "input_seq": "Is Ulster County's FIPS 6-4 (US counties) code 05119 ?",
    "target_seq": "ASK { ?e <pred:name> \"Ulster County\" . ?e <FIPS_6-4_(US_counties)> ?pv . ?pv <pred:value> \"05119\" .  }"
  },
  {
    "qid": "train_1351",
    "input_seq": "What is the relationship between War and Peace (the one whose release region is United States of America) to Belgium?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"War and Peace\" . ?e_1 <film_release_region> ?e_3 . ?e_3 <pred:name> \"United States of America\" . ?e_2 <pred:name> \"Belgium\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1352",
    "input_seq": "Sugar Hill Records Headquarters is located in Nashville (which is the working location of Willie Nelson), what country is it a part of?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Sugar Hill Records\" . ?e_2 <pred:name> \"Nashville\" . ?e_3 <work_location> ?e_2 . ?e_3 <pred:name> \"Willie Nelson\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }"
  },
  {
    "qid": "train_1353",
    "input_seq": "What is the number towns that have the official website http://www.doncaster.gov.uk/ or are the filming location of Fast Food Nation?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" .  { ?e <official_website> ?pv . ?pv <pred:value> \"http://www.doncaster.gov.uk/\" .  } UNION { ?e_1 <filming_location> ?e . ?e_1 <pred:name> \"Fast Food Nation\" .  } }"
  },
  {
    "qid": "train_1354",
    "input_seq": "Tell me the visual art work that is called Сол__и_, and that has a duration under 420 minutes.",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Doris Lessing\" . ?e_2 <pred:name> \"London\" . ?e_2 <demonym> ?pv . ?pv <pred:value> \"londinese\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1355",
    "input_seq": "Out of the big cities, with fewer than 1000 annual number of weddings, which has the smallest area?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"1000\"^^xsd:double ) . ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1356",
    "input_seq": "What degree did Leonard Cohen achieve at McGill University?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Leonard Cohen\" . ?e_2 <pred:name> \"McGill University\" . ?e_1 <educated_at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <educated_at> ; <pred:fact_t> ?e_2 ] <academic_degree> ?qpv .  }"
  },
  {
    "qid": "train_1357",
    "input_seq": "Which show has more seasons, Seinfeld or A Pup Named Scooby-Doo?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Seinfeld\" .  } UNION { ?e <pred:name> \"A Pup Named Scooby-Doo\" .  } ?e <number_of_seasons> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1358",
    "input_seq": "Which one, Breakfast at Tiffany's (the one whose publication date is 1962-01-12) or The Matrix, has greater cost?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Breakfast at Tiffany's\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1962-01-12\"^^xsd:date . } UNION { ?e <pred:name> \"The Matrix\" . } ?e <cost> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1359",
    "input_seq": "What is the connection between Star Wars Episode II: Attack of the Clones to Liam Neeson?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Star Wars Episode II: Attack of the Clones\" . ?e_2 <pred:name> \"Liam Neeson\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1360",
    "input_seq": "What is the musical which was first performed before 1989 and received Tony Award for Best Revival of a Musical (the point in time of this statement is 1997)",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <date_of_first_performance> ?pv . ?pv <pred:year> ?v . FILTER ( ?v < 1989 ) . ?e <award_received> ?e_1 . ?e_1 <pred:name> \"Tony Award for Best Revival of a Musical\" . [ <pred:fact_h> ?e ; <pred:fact_r> <award_received> ; <pred:fact_t> ?e_1 ] <point_in_time> ?qpv . ?qpv <pred:year> 1997 .  }"
  },
  {
    "qid": "train_1361",
    "input_seq": "Which literary work contain a narrative location - the state of the United States that contains Indian River County ?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literary work\" . ?e <narrative_location> ?e_1 . ?e_1 <pred:instance_of> ?c_1 . ?c_1 <pred:name> \"state of the United States\" . ?e_2 <located_in_the_administrative_territorial_entity> ?e_1 . ?e_2 <pred:name> \"Indian River County\" .   }"
  },
  {
    "qid": "train_1362",
    "input_seq": "Does Nicaragua or Ireland (whose population is 2877300) have the higher mains voltage?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Nicaragua\" . } UNION { ?e <pred:name> \"Ireland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2877300\"^^xsd:double . } ?e <mains_voltage> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1363",
    "input_seq": "How is Fredericksburg related to the USA?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fredericksburg\" . ?e_2 <pred:name> \"United States of America\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1364",
    "input_seq": "Which person has ISNI 0000 0001 2122 7480?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2122 7480\" .  }"
  },
  {
    "qid": "train_1365",
    "input_seq": "What is the area of the United States city that is the formation location of Symantec?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e_1 <location_of_formation> ?e . ?e_1 <pred:name> \"Symantec\" .  ?e <area> ?pv .  }"
  },
  {
    "qid": "train_1366",
    "input_seq": "What is the connection between How I Met Your Mother to Alyson Hannigan?",
    "target_seq": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"How I Met Your Mother\" . ?e_2 <pred:name> \"Alyson Hannigan\" . ?e_1 ?p ?e_2 .  }"
  },
  {
    "qid": "train_1367",
    "input_seq": "What is the official website of the Hugo Award for Best Novelette?",
    "target_seq": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hugo Award for Best Novelette\" . ?e <official_website> ?pv .  }"
  },
  {
    "qid": "train_1368",
    "input_seq": "Electric blues artist Jimi Hendrix plays the glockenspiel in which work?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jimi Hendrix\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"electric blues\" . ?e_2 <pred:name> \"glockenspiel\" . ?e_1 <instrument> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <instrument> ; <pred:fact_t> ?e_2 ] <present_in_work> ?qpv .  }"
  },
  {
    "qid": "train_1369",
    "input_seq": "Does Star Alliance have more than 20 members?",
    "target_seq": "ASK { ?e <pred:name> \"Star Alliance\" . ?e <member_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"20\"^^xsd:double ) .  }"
  },
  {
    "qid": "train_1370",
    "input_seq": "What is the number of higher learning institutions whose CANTIC-ID is a11100503 or date of establishment is after 1908?",
    "target_seq": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" .  { ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11100503\" .  } UNION { ?e <inception> ?pv . ?pv <pred:year> ?v . FILTER ( ?v > 1908 ) .  } }"
  },
  {
    "qid": "train_1371",
    "input_seq": "The psychological thriller genre of Dune is combined with the genre of Robert Louis Stevenson to produce what novel?",
    "target_seq": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e_1 <genre> ?e . ?e_1 <pred:name> \"Robert Louis Stevenson\" .  ?e_2 <genre> ?e . ?e_2 <pred:name> \"Dune\" . ?e_2 <genre> ?e_3 . ?e_3 <pred:name> \"psychological thriller\" .  }"
  },
  {
    "qid": "train_1372",
    "input_seq": "What is the series ordinal for Robin Hood's (the one whose genre is buddy film) composer, Johnny Mercer (the one that received 28th Golden Globe Awards)?",
    "target_seq": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Robin Hood\" . ?e_1 <genre> ?e_3 . ?e_3 <pred:name> \"buddy film\" . ?e_2 <pred:name> \"Johnny Mercer\" . ?e_2 <award_received> ?e_4 . ?e_4 <pred:name> \"28th Golden Globe Awards\" . ?e_1 <composer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <composer> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }"
  },
  {
    "qid": "train_1373",
    "input_seq": "Does Lycoming County or Cumberland County established in 1750 have less area?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Lycoming County\" . } UNION { ?e <pred:name> \"Cumberland County\" . ?e <inception> ?pv_1 . ?pv_1 <pred:year> 1750 . } ?e <area> ?pv . ?pv <pred:value> ?v .  } ORDER BY ?v LIMIT 1"
  },
  {
    "qid": "train_1374",
    "input_seq": "Which has a longer run-time,  RKO Pictures \"Gloria\" or \"Never Say Never Again\" with director of photography Douglas Slocombe?",
    "target_seq": "SELECT ?e WHERE { { ?e <pred:name> \"Glory\" . ?e <distributor> ?e_1 . ?e_1 <pred:name> \"RKO Pictures\" .   } UNION { ?e <pred:name> \"Never Say Never Again\" . ?e <director_of_photography> ?e_2 . ?e_2 <pred:name> \"Douglas Slocombe\" .  } ?e <duration> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1375",
    "input_seq": "Is http://www.nick.com/spongebob-squarepants/ the official website of SpongeBob SquarePants?",
    "target_seq": "ASK { ?e <pred:name> \"SpongeBob SquarePants\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nick.com/spongebob-squarepants/\" .  }"
  },
  {
    "qid": "train_1376",
    "input_seq": "Which has the largest density among the medications whose atomic number is not 20?",
    "target_seq": "SELECT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <atomic_number> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 != \"20\"^^xsd:double ) . ?e <density> ?pv . ?pv <pred:value> ?v .  } ORDER BY DESC(?v) LIMIT 1"
  },
  {
    "qid": "train_1377",
    "input_seq": "Is 0xbd73sj535vf06 the Libris-URI of the person influenced by Mary Shelley (the one that has the occupation of playwright) ?",
    "target_seq": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <influenced_by> ?e_1 . ?e_1 <pred:name> \"Mary Shelley\" . ?e_1 <occupation> ?e_2 . ?e_2 <pred:name> \"playwright\" .  ?e <Libris-URI> ?pv . ?pv <pred:value> \"0xbd73sj535vf06\" .  }"
  }
]